Repository: JulioPr0/ml-rock-paper-scissors
Catalog: Rock, Paper, Scissors game with ML.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: For instance, your ML model could better recognize one skin tone over another, causing some hand poses to be more accurately predicted than some in other skin tones. This is known as bias, because it favors one type of information over another.
de: Dein ML-Modell könnte zum Beispiel eine Hautfarbe besser erkennen als eine andere. Das führt natürlich dazu, dass einige Handgesten genauer vorhergesagt werden können als die mit einer anderen Hautfarbe. Dies wird als Verzerrung (Bias) bezeichnet, da das Modell einen Informationstyp bevorzugt behandelt.
es: Por ejemplo, tu modelo de ML podría reconocer mejor un tono de piel que otro, haciendo que algunas posturas de la mano se determinen con más precisión para unos tonos de piel que para otros tonos. Esto se conoce como sesgo (o bias), porque es más favorable a un tipo de información que a otro.
es_419: Por ejemplo, tu modelo de ML podría reconocer mejor un tono de piel que otro, lo que ocasionaría que algunas poses se reconozcan de forma más precisa que algunas en otros tonos de piel. A esto se le conoce como sesgo, ya que favorece un tipo de información sobre otro.
fr: Par exemple, ton modèle d’apprentissage automatique pourrait mieux reconnaître une couleur de peau qu’une autre, ce qui fait que certaines positions de la main pourraient être prédites plus précisément que d’autres dans d’autres couleurs de peau. C’est ce qu’on appelle un biais, car cela favorise un type d’informations plutôt qu’un autre.
it: Ad esempio, il tuo modello di apprendimento automatico potrebbe riconoscere meglio una tonalità di pelle rispetto a un’altra, prevedendo così in modo più accurato alcune pose rispetto ad altre in altre tonalità di pelle. Questo fenomeno è conosciuto come sbilanciamento, perché favorisce un tipo di informazione rispetto a un’altra.
ja: 例えば、あなたの機械学習モデルがある皮膚の色を別の色よりもうまく認識するために、皮膚の色によって一部の手の形の予測精度に差が出るかもしれません。これはバイアスと呼ばれ、あるタイプの情報をほかの情報よりも好んでしまうことを意味します。
ko: 예를 들어, ML 모델이 한 피부톤을 다른 피부톤보다 더 잘 인식하여 특정 손 포즈를 다른 피부톤보다 더 정확하게 예측할 수 있습니다. 이를 편향성이라고 부르는데, 한 유형의 정보를 다른 유형의 정보보다 선호하기 때문에 나타납니다.
nl: Je ML-model kan bijvoorbeeld beter zijn in het herkennen van één bepaalde huidskleur, waardoor handgebaren met deze huidskleur beter worden voorspeld dan handgebaren met andere huidskleuren. Dit wordt vooringenomenheid genoemd, omdat het ene type informatie de voorkeur krijgt boven het andere.
no: For eksempel kan det hende at maskinlæringsmodellen din gjenkjenner én hudfarge bedre enn en annen, slik at noen håndtegn forutses mer nøyaktig enn andre. Dette kalles partiskhet fordi modellen favoriserer én type informasjon.
pt: Por exemplo, o modelo de AM pode reconhecer um tom de pele melhor do que outro, fazendo com que alguns sinais com a mão sejam previstos com mais precisão em um certo tom de pele. Isso é conhecido como parcialidade, já que favorece um tipo de informação em detrimento de outro.
sv: Din maskininlärningsmodell kan till exempel vara bättre på att känna igen en hudfärg framför andra, vilket leder till att en del handgester förutsägs mer träffsäkert än gester som görs av en hand med en annan hudfärg. Det här kallas partiskhet eftersom den värderar en typ av information högre än en annan.
th: ตัวอย่างเช่น โมเดล ML ของคุณอาจรู้จำโทนสีผิวหนึ่งมากกว่าโทนสีผิวอื่น ทำให้บางท่าทางมือได้รับการคาดคะเนแม่นยำมากกว่าบางท่าทางมือในโทนสีผิวอื่น สิ่งนี้เรียกว่าความลำเอียง เนื่องจากเป็นการสนับสนุนประเภทข้อมูลหนึ่งมากกว่าประเภทข้อมูลอื่น
tr: Örneğin makine öğrenimi modelin, bir ten rengini diğerinden daha iyi tanıyıp bazı el pozlarının başka ten renklerindeki pozlardan daha doğru tahmin edilmesine neden olabilir. Bu, bir bilgi türünü diğerine tercih ettiği için yanlılık olarak bilinir.
vi: Ví dụ: mô hình ML của bạn có thể nhận biết một màu da tốt hơn một màu da khác, khiến một số tư thế bàn tay được dự đoán chính xác hơn so với một số tư thế có màu da khác. Đây được gọi là sự thiên lệch, vì mô hình đó ưu tiên một kiểu thông tin hơn một kiểu khác.
zh_cn: 例如，你的机器学习模型可能对某种肤色的识别效果更好，从而导致某些手势的预测较其他肤色的手势更准确。这被称为偏差，因为它更偏向于某一类信息。
zh_tw: 例如，你的 ML 模型可以更好地辨識一種膚色而不是另一種膚色，進而使某些手勢比其他膚色的某些手勢更準確地預測。這稱之為偏見，因為它偏好某一種資訊超過另一種資訊。

source: Your model only affects this game, but what if you were implementing this Rock, Paper, Scissors game on every iPhone around the world? Unfair bias due to overfitting is a serious problem in systems meant for use by everyone.
de: Dein Modell ist nur für dieses Spiel gedacht, aber was wäre denn, wenn du dieses „Schere, Stein, Papier“-Spiel für jedes iPhone auf der ganzen Welt implementieren würdest? Unfaire Verzerrungen wegen Überanpassung sind ein großes Problem in Systemen, die für alle Menschen gedacht sind.
es: Tu modelo solo afecta a este juego. Pero, ¿qué pasaría si quisieras implementar este juego de “Piedra, papel o tijera“ en todos los iPhone del mundo? El sesgo incorrecto causado por el sobreajuste es un problema serio en los sistemas pensados para que los use cualquier persona.
es_419: Tu modelo solamente afecta a este juego, ¿pero qué pasaría si fueras a implementar este juego de Piedra, papel o tijeras en todos los iPhone del mundo? El sesgo causado por el sobreajuste sería un problema serio en sistemas que están diseñados para cualquier persona.
fr: Ton modèle ne concerne que ce jeu, mais imagine si tu implémentais ce jeu Pierre, papier, ciseaux sur tous les iPhone du monde ? Un biais inéquitable dû à un surapprentissage est un problème grave dans les systèmes destinés à être utilisés par tout le monde.
it: Il tuo modello ha effetto solo su questo gioco, ma cosa accadrebbe se implementassi il tuo Sasso, carta, forbici su ogni iPhone in tutto il mondo? Uno sbilanciamento ingiusto causato dal sovradattamento è un problema serio nei sistemi pensati per essere utilizzati da chiunque.
ja: あなたのモデルはこのゲームにしか影響しませんが、もしもこのじゃんけんゲームが世界中のすべてのiPhoneに実装されるとしたらどうでしょうか? 過適合による不公平なバイアスは、すべての人が使うためのシステムでは深刻な問題となります。
ko: 여러분의 모델은 이 게임에만 영향을 미치지만, 이 가위, 바위, 보 게임을 전 세계의 모든 iPhone에서 구현한다면 어떻게 될까요? 과적합으로 인한 불공정한 편향성은 모든 사람을 대상으로 하는 시스템에서 심각한 문제를 야기합니다.
nl: Je model is alleen van invloed op deze game, maar wat zou er gebeuren als je deze Steen, papier, schaar-game op elke iPhone in de hele wereld zou zetten? Oneerlijke vooringenomenheid als gevolg van overspecialisatie is een ernstig probleem in systemen die voor algemeen gebruik zijn bedoeld.
no: Modellen din påvirker bare dette spillet, men hva hvis dette stein, saks, papir-spillet ble implementert på alle iPhoner i hele verden? Partiskhet på grunn av overtilpasning er et alvorlig problem i systemer som skal kunne brukes av alle.
pt: O modelo afeta apenas este jogo, mas e se você implementasse esse jogo de Pedra, Papel e Tesoura em todos os iPhones do mundo? A parcialidade gerada pelo sobreajuste é um problema sério em sistemas projetados para o uso de qualquer pessoa.
sv: Din modell påverkar bara det här spelet, men vad skulle hända om det här Sten, sax, påse-spelet implementerades på varenda iPhone i hela världen? Partiskhet på grund av överpassning är ett allvarligt problem i system som är avsett att användas av alla.
th: โมเดลของคุณมีผลต่อเกมนี้ แต่จะเกิดอะไรขึ้นหากคุณใช้เกมเป่ายิ้งฉุบนี้บน iPhone ทุกเครื่องทั่วโลก ความลำเอียงที่ไม่เป็นธรรมเนื่องจาก overfitting เป็นปัญหาที่ร้ายแรงในระบบที่ออกแบบมาให้ทุกคนใช้
tr: Modelin yalnızca bu oyunu etkiliyor ama ya bu Taş, Kâğıt, Makas oyununu dünyanın her yerindeki iPhone’larda gerçekleştiriyor olsaydın ne olurdu? Aşırı uyumdan kaynaklanan adaletsiz yanlılık, herkesin kullanımına yönelik sistemlerde ciddi bir sorundur.
vi: Mô hình của bạn chỉ ảnh hưởng đến trò chơi này, nhưng nếu bạn đang triển khai trò chơi Kéo Búa Bao này trên mọi iPhone trên khắp thế giới thì sao? Sự thiên lệch không công bằng do quá khớp là một vấn đề nghiêm trọng trong các hệ thống dành cho mọi người sử dụng.
zh_cn: 你的模型只影响了这个游戏，但如果是在全世界的每一台 iPhone 上执行这款“石头剪刀布”游戏呢？在供所有人使用的系统中，因过拟合而导致的不公平偏差是一个严重的问题。
zh_tw: 你的模型只影響這個遊戲，但如果你在全世界的每部 iPhone 上實做了這個「剪刀、石頭、布」遊戲會怎樣？由於過度擬合所導致的不公平偏見是眾人使用的系統中的一個嚴重問題。

source: It’s important to think about how to avoid bias when creating your own datasets and training your ML model.
de: Es ist wichtig, darüber nachzudenken, wie sich solche Verzerrungen beim Erstellen eines eigenen Datensatzes und beim Trainieren des ML-Modells verhindern lassen.
es: Es importante pensar en cómo evitar los sesgos cuando crees tus propios conjuntos de datos y entrenes tus modelos de ML.
es_419: Es importante pensar en cómo evitar los sesgos al crear tus propios conjuntos de datos y entrenar tu modelo de ML.
fr: Il est important de réfléchir aux manières d’éviter les biais lors de la création de tes propres ensembles de données et de l’entraînement de ton modèle d’apprentissage automatique.
it: È importante pensare a come evitare lo sbilanciamento quando crei un insieme di dati e addestri il tuo modello di apprendimento automatico.
ja: 自分だけのデータセットを作成して機械学習モデルを学習させるときには、どうやってバイアスを避けるかを考えるのが重要です。
ko: 나만의 데이터 세트를 만들고 ML 모델을 훈련할 때 편향성을 없애는 방법을 생각하는 것이 중요합니다.
nl: Het is belangrijk om te bedenken hoe je vooringenomenheid kunt vermijden bij het samenstellen van je eigen gegevenssets en het trainen van je ML-model.
no: Det er viktig at du tenker på hvordan du kan unngå partiskhet når du lager dine egne datasett og trener maskinlæringsmodellen din.
pt: É importante pensar como evitar a parcialidade ao criar os seus próprios conjuntos de dados e treinar o modelo de AM.
sv: Det är viktigt att fundera på hur du kan undvika partiskhet när du skapar egna datauppsättningar och tränar maskininlärningsmodellen.
th: คุณควรคำนึงถึงวิธีหลีกเลี่ยงความลำเอียงเมื่อสร้างชุดข้อมูลและฝึกโมเดล ML ของคุณ
tr: Kendi veri kümelerini yaratırken ve makine öğrenimi modelini eğitirken yanlılıktan nasıl kaçınacağını düşünsen iyi olur.
vi: Điều quan trọng là bạn cần suy nghĩ về cách tránh sự thiên lệch khi tạo ra tập dữ liệu của chính bạn và huấn luyện mô hình ML.
zh_cn: 创建自己的数据集和训练机器学习模型时，考虑如何避免偏差是很重要的。
zh_tw: 在建立自己的資料集和訓練 ML 模型時，思考如何避免偏見非常重要。

source: Some ways to mitigate bias are to:
de: Verzerrungen lassen sich beispielsweise mit diesen Möglichkeiten reduzieren:
es: Aquí tienes algunas maneras de mitigar los sesgos:
es_419: Aquí tienes algunas formas de mitigar los sesgos:
fr: Voici plusieurs façons d’atténuer les biais :
it: Ecco alcuni modi per mitigare lo sbilanciamento:
ja: バイアスを軽減するには以下のような方法があります:
ko: 편향성을 완화하는 몇 가지 방법은 다음과 같습니다.
nl: Manieren waarop je vooringenomenheid kunt voorkomen:
no: Her er noen måter du kan minimere partiskhet på:
pt: Algumas maneiras de mitigar a parcialidade:
sv: Här är några sätt att minimera partiskhet:
th: บางวิธีในการลดความลำเอียงคือ:
tr: Yanlılığı azaltmanın bazı yolları şunlardır:
vi: Một số cách để giảm bớt sự thiên lệch là:
zh_cn: 减少偏差的一些方法是：
zh_tw: 有一些可減少偏見方法：

source: Make sure your training and validation datasets are diverse, and don’t [overfit](glossary://overfitting) to one group or situation.
de: Stelle sicher, dass deine Trainings- und Prüfungsdatensätze divers sind und dass du eine [Überanpassung](glossary://overfitting) von einer bestimmten Gruppe oder Situation verhinderst.
es: Asegúrate de que los conjuntos de datos de entrenamiento y validación son diversos y no [se sobreajustan](glossary://overfitting) a ningún grupo o situación.
es_419: Asegúrate de que tus conjuntos de datos de entrenamiento y validación sean diversos y que no se [sobreajusten](glossary://overfitting) a un grupo o situación en particular.
fr: Assure-toi de la diversité de tes ensembles de données d’entraînement et de validation, et évite le [surapprentissage](glossary://overfitting) pour un groupe ou une situation.
it: Assicurati che gli insiemi di dati per l’addestramento e per la convalida siano assortiti ed evita il [sovradattamento](glossary://overfitting) a un singolo gruppo o situazione.
ja: 学習データセットと検証データセットに多様性を持たせ、1つのグループや状況に[過適合](glossary://overfitting)しないようにする。
ko: 훈련 및 유효성 확인 데이터 세트가 다양한지 확인하고, 하나의 그룹 또는 상황에 [과적합](glossary://overfitting)하지 마세요.
nl: Zorg dat je trainings- en validatiegegevenssets gevarieerd zijn en niet [overgespecialiseerd](glossary://overfitting) zijn voor een bepaalde groep of situatie.
no: Sørg for at trenings- og valideringsdatasettene er allsidige, og at de ikke er [overtilpasset](glossary://overfitting) for én gruppe eller situasjon.
pt: Garanta que os conjuntos de dados de treinamento e validação tenham diversidade e não estejam [sobreajustados](glossary://overfitting) a um único grupo ou situação.
sv: Se till att dina datauppsättningar för träning och validering är mångsidiga och inte [överpassas](glossary://overfitting) till en grupp eller situation.
th: ตรวจสอบให้แน่ใจว่าชุดข้อมูลการฝึกและชุดข้อมูลการตรวจสอบของคุณมีความหลากหลาย และอย่า [overfit](glossary://overfit) กับหนึ่งกลุ่มหรือหนึ่งสถานการณ์
tr: Eğitim ve doğrulama veri kümelerinde çok çeşit olduğundan ve bir gruba veya duruma [aşırı uyum](glossary://overfitting) göstermediğinden emin ol.
vi: Đảm bảo rằng các tập dữ liệu huấn luyện và xác thực của bạn đa dạng và không [quá khớp](glossary://overfitting) với một nhóm hoặc tình huống.
zh_cn: 确保你的训练和验证数据集是多样化的，不能对某个群组或某种情况[过拟合](glossary://overfitting)。
zh_tw: 確認你的訓練和資料集的驗證是多樣化的，並且不要[過度擬合](glossary://overfitting)到某一組或某個情況。

source: Think about and address edge cases that your users might encounter.
de: Überlege dir Grenzfälle, auf die Benutzer:innen stoßen könnten, und beuge ihnen vor.
es: Considera y atiende los casos extremos que podrían presentarse a quienes usen tu app.
es_419: Piensa en los casos extremos que podrían presentarse con tus usuarios y en cómo solucionarlos.
fr: Réfléchis aux cas limites que tes utilisateurs pourraient rencontrer et traite-les.
it: Considera e affronta i casi limite che l’utente potrebbe incontrare.
ja: ユーザが直面する可能性のあるエッジケースを考えて対処する。
ko: 사용자가 직면할 수 있는 엣지 케이스를 생각해 보고 해결하세요.
nl: Bedenk welke randgevallen je gebruikers kunnen tegenkomen en hoe je hiermee omgaat.
no: Tenk gjennom og løs hjørnetilfeller som brukerne kan støte på.
pt: Pense e lide com os casos extremos que os usuários podem encontrar.
sv: Fundera över och åtgärda kantfall som användare kan påträffa.
th: ลองนึกถึงและแก้ไข edge case ที่ผู้ใช้ของคุณอาจพบ
tr: Kullanıcılarının karşılaşabileceği uç durumları düşün ve bunların üzerine eğil.
vi: Suy nghĩ và giải quyết các trường hợp hóc búa mà người dùng của bạn có thể gặp phải.
zh_cn: 思考并解决用户可能会遇到的边界情况。
zh_tw: 思考並解決使用者可能遇到的邊緣案例。

source: Remember that ML model development is an iterative process. Create multiple datasets and train more ML models! It’s up to you when your model is good enough for your app.
de: Denk daran, dass die ML-Modellentwicklung ein iterativer (sich wiederholender) Prozess ist. Also erstelle weitere Datensätze und trainiere noch mehr ML-Modelle! Du entscheidest, wann das Modell gut genug ist für deine App.
es: Recuerda que el desarrollo de modelos de ML es un proceso iterativo. Crea múltiples conjunto de datos y entrena más modelos de ML. Tú decides cuándo el modelo es lo bastante bueno para tu app.
es_419: Recuerda que el desarrollo de modelos de ML es un proceso iterativo. Así que crea varios conjuntos de datos y entrena más modelos de ML. Tú decides cuándo el modelo es lo suficientemente bueno para tu app.
fr: N’oublie pas que le développement d’un modèle d’apprentissage automatique est un processus itératif. Crée plusieurs ensembles de données et entraîne plus de modèles d’apprentissage automatique ! C’est à toi de décider à quel moment ton modèle est assez bon pour ton app.
it: Ricorda che lo sviluppo di un modello di apprendimento automatico è un processo iterativo. Crea più insiemi di dati e addestra più modelli di apprendimento automatico! Sei tu a decidere quando il modello è sufficientemente adatto alla tua app.
ja: 機械学習モデルの開発は反復プロセスであることを忘れないでください。複数のデータセットを作成してより多くの機械学習モデルを学習させましょう! モデルが十分学習したのでAppに使えるという判断をいつするかはあなた次第です。
ko: ML 모델 개발은 반복적인 프로세스라는 것을 기억하세요. 여러 데이터 세트를 생성하고 더 많은 ML 모델을 훈련하세요! 사용자의 앱에 실용적인 모델인지는 여러분이 어떻게 하느냐에 달려 있습니다.
nl: Onthoud dat de ontwikkeling van ML-modellen een proces is met veel herhaling. Maak meerdere gegevenssets aan en train meerdere ML-modellen! Jij bepaalt wanneer je model goed genoeg is voor je app.
no: Husk at utviklingen av maskinlæringsmodeller er en iterativ prosess. Lag flere datasett og tren flere maskinlæringsmodeller! Det er du som bestemmer når modellen er god nok for appen din.
pt: Lembre‑se de que o desenvolvimento do modelo de AM é um processo iterativo. Crie vários conjuntos de dados e treine mais modelos de AM! Cabe a você decidir quando o modelo é bom o suficiente para o app.
sv: Kom ihåg att utvecklingen av maskininlärningsmodeller är en iterativ process. Skapa flera datauppsättningar och träna fler maskininlärningsmodeller! Det är upp till dig att avgöra när modellen är tillräckligt bra för din app.
th: อย่าลืมว่าการพัฒนาโมเดล ML เป็นกระบวนการทำซ้ำ สร้างชุดข้อมูลจำนวนมากและฝึกโมเดล ML มากขึ้น! ขึ้นอยู่กับคุณแล้วว่าโมเดลของคุณจะดีพอสำหรับแอปของคุณเมื่อใด
tr: Makine öğrenimi modeli geliştirmenin tekrarlı bir süreç olduğunu unutma. Birden fazla veri kümesi yarat ve daha fazla makine öğrenimi modeli eğit! Modelinin uygulama için yeteri kadar iyi olup olmadığına sen karar ver.
vi: Hãy nhớ rằng phát triển mô hình ML là một quá trình mang tính lặp lại. Hãy tạo ra nhiều tập dữ liệu và huấn luyện nhiều mô hình ML của bạn! Bạn quyết định thời điểm mô hình đủ phù hợp với ứng dụng của mình.
zh_cn: 要记住，机器学习模型开发是一个迭代的过程。创建多个数据集并训练更多的机器学习模型！模型对于 App 是否已经足够好用取决于你。
zh_tw: 請記住，ML 模型開發是一個反覆執行的過程。建立多個資料集並訓練更多 ML 模型！你的模型什麼時候對你的 App 才算是完美的，完全取決於你。

# GuideBook..Guide0..StepGet Started with Machine Learning..TaskGroup3..title
source: Creating your own ML dataset
de: Eigenen ML-Datensatz erstellen
es: Crea tu propio conjunto de datos de ML
es_419: Crear tu propio conjunto de datos de ML
fr: Création de ton propre ensemble de données d’apprentissage automatique
it: Creare un insieme di dati personalizzato per l’apprendimento automatico
ja: 自分だけの機械学習データセットを作成する
ko: 나만의 ML 데이터 세트 만들기
nl: Een eigen ML-gegevensset aanmaken
no: Lage ditt eget datasett for maskinlæring
pt: Criando o seu próprio conjunto de dados de AM
sv: Skapa din egen datauppsättning för maskininlärning
th: การสร้างชุดข้อมูล ML ของคุณเอง
tr: Kendi makine öğrenimi veri kümeni yaratma
vi: Tạo tập dữ liệu ML của chính bạn
zh_cn: 创建你自己的机器学习数据集
zh_tw: 建立你自己的 ML 資料集

source: Collect and organize data for your model
de: Daten für dein Modell sammeln und organisieren
es: Recopilar y organizar datos para el modelo
es_419: Recopilar y organizar datos para el modelo
fr: Collecter et organiser de données pour un modèle
it: Raccogliere e organizzare dati per il tuo modello
ja: モデル用のデータを収集して整理する
ko: 모델에 관한 데이터 수집 및 구성하기
nl: Gegevens voor je model verzamelen en ordenen
no: Samle og organiser data for modellen din
pt: Colete e organize dados para o modelo
sv: Samla in och ordna data för din modell
th: รวบรวมและจัดระเบียบข้อมูลสำหรับโมเดลของคุณ
tr: Modelin için verileri toplama ve düzenleme
vi: Thu thập và sắp xếp dữ liệu cho mô hình của bạn
zh_cn: 收集和整理用于模型的数据
zh_tw: 收集和整理模型的資料

source: Tips to create your own dataset for a machine learning model.
de: Tipps für das Erstellen eigener Datensätze für ML-Modelle.
es: Consejos para crear un conjunto de datos propio para un modelo de aprendizaje automático.
es_419: Consejos para crear tu propio conjunto de datos para un modelo de aprendizaje automático.
fr: Astuces pour créer ton propre ensemble de données pour un modèle d’apprentissage automatique.
it: Suggerimenti per creare un insieme di dati personale per un modello di apprendimento automatico.
ja: 機械学習モデル用の自分だけのデータセットを作成するためのヒント。
ko: 기계 학습 모델을 위한 나만의 데이터 세트를 만드는 팁입니다.
nl: Tips voor het aanmaken van je eigen gegevensset voor een ML-model.
no: Tips om hvordan du kan lage ditt eget datasett for en maskinlæringsmodell.
pt: Dicas para criar o seu próprio conjunto de dados para um modelo de aprendizado de máquina.
sv: Tips om hur du skapar en egen datauppsättning för en maskininlärningsmodell.
th: เคล็ดลับในการสร้างชุดข้อมูลของคุณเองสำหรับโมเดลการเรียนรู้ของเครื่อง
tr: Bir makine öğrenimi modeli için kendi veri kümeni yaratma ipuçları.
vi: Các mẹo để tạo ra tập dữ liệu của riêng bạn cho một mô hình học máy.
zh_cn: 创建用于机器学习模型的个人数据集的提示。
zh_tw: 提示你如何為機器學習模型建立自己的資料集。

source: Computers are great at detecting patterns in data when given enough examples. To create a hand pose machine learning model, you’ll need several images of hands.
de: Computer können sehr gut Muster in Daten erkennen, wenn sie genug Beispiele haben. Um ein ML-Modell für Handgesten zu erstellen, benötigst du also mehrere Bilder von Händen.
es: Los ordenadores son muy buenos detectando patrones de datos si disponen de suficientes ejemplos. Para crear un modelo de aprendizaje de posturas de manos, necesitarás varias imágenes de manos.
es_419: Las computadoras hacen un gran trabajo detectando patrones si disponen de suficientes ejemplos. Para crear un modelo de aprendizaje automático de poses de manos, necesitarás varias imágenes de manos.
fr: Les ordinateurs sont très doués pour détecter des patterns dans des données lorsqu’on leur donne suffisamment d’exemples. Pour créer un modèle d’apprentissage automatique de positions de la main, tu auras besoin de plusieurs images de mains.
it: I computer sono ottimi a rilevare schemi ripetitivi nei dati se ricevono abbastanza esempi. Per creare un modello di apprendimento automatico per le pose delle mani avrai bisogno di varie immagini di mani.
ja: コンピュータは、十分な例があればデータ中のパターンを検出することができます。手の形の機械学習モデルを作成するには、手のイメージが何枚か必要です。
ko: 컴퓨터는 충분한 예가 주어지면 데이터 패턴을 아주 잘 감지합니다. 손 포즈 기계 학습 모델을 만들려면 손의 여러 이미지가 필요합니다.
nl: Computers zijn erg goed in het ontdekken van patronen in gegevens mits je ze genoeg voorbeelden geeft. Om een ML-model voor handgebaren aan te maken, heb je meerdere afbeeldingen van handen nodig.
no: Datamaskiner er veldig flinke til å oppdage mønstre i data når de får nok eksempler. Du trenger flere bilder av hender for å lage en maskinlæringsmodell for håndtegn.
pt: Computadores são ótimos para detectar padrões em dados quando recebem exemplos suficientes. Para criar um modelo de aprendizado de máquina de sinais com a mão, você precisará de várias imagens de mãos.
sv: Datorer är suveräna på att upptäcka mönster i data när de får tillräckligt många exempel. När du skapar en maskininlärningsmodell för handgester behöver du flera bilder på händer.
th: คอมพิวเตอร์จะตรวจจับรูปแบบในข้อมูลได้ดีเมื่อให้ตัวอย่างที่มากเพียงพอ ในการสร้างโมเดลการเรียนรู้ของเครื่องท่าทางมือ คุณจึงต้องมีภาพมือหลายภาพ
tr: Bilgisayarlar, yeterince örnek verilirse verilerdeki örüntüleri bulmada harikadır. Bir el pozu makine öğrenimi modeli yaratmak için birçok el görüntüsüne ihtiyacın olacak.
vi: Máy tính có khả năng phát hiện các khuôn mẫu trong dữ liệu rất tốt khi được cung cấp đủ ví dụ. Để tạo ra một mô hình học máy tư thế bàn tay, bạn sẽ cần một số hình ảnh về bàn tay.
zh_cn: 当提供的例子足够多时，电脑十分擅长检测数据中的模式。如果要创建手势机器学习模型，你需要一些手部的图像。
zh_tw: 如果提供了足夠的範例，電腦便能精確地偵測資料中的模式。若要建立手部姿勢的機器學習模型，你需要多個手部影像。
