Repository: JulioPr0/ml-rock-paper-scissors
Catalog: Rock, Paper, Scissors game with ML.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: [Vision](doc://com.apple.documentation/documentation/vision) then extracts an [MLMultiArray](doc://com.apple.documentation/documentation/coreml/mlmultiarray) from these observations.
de: [Vision](doc://com.apple.documentation/documentation/vision) extrahiert dann [MLMultiArray](doc://com.apple.documentation/documentation/coreml/mlmultiarray) (mehrfaches ML-Array) aus diesen Beobachtungen.
es: Entonces [Vision](doc://com.apple.documentation/documentation/vision) extrae un vector [MLMultiArray](doc://com.apple.documentation/documentation/coreml/mlmultiarray) de estas observaciones.
es_419: Después, se extrae un arreglo [MLMultiArray](doc://com.apple.documentation/documentation/coreml/mlmultiarray) de estas observaciones mediante [Vision](doc://com.apple.documentation/documentation/vision).
fr: [Vision](doc://com.apple.documentation/documentation/vision) extrait ensuite un [MLMultiArray](doc://com.apple.documentation/documentation/coreml/mlmultiarray) de ces observations.
it: Quindi, il framework [Vision](doc://com.apple.documentation/documentation/vision) estrae un array [MLMultiArray](doc://com.apple.documentation/documentation/coreml/mlmultiarray) da tali osservazioni.
ja: 次に[Vision](doc://com.apple.documentation/documentation/vision)はこれらの観察結果から[MLMultiArray](doc://com.apple.documentation/documentation/coreml/mlmultiarray)を抽出します。
ko: 그런 다음 [Vision](doc://com.apple.documentation/documentation/vision)이 이러한 관찰 대상에서 [MLMultiArray](doc://com.apple.documentation/documentation/coreml/mlmultiarray)를 추출합니다.
nl: [Vision](doc://com.apple.documentation/documentation/vision) extraheert vervolgens een [MLMultiArray](doc://com.apple.documentation/documentation/coreml/mlmultiarray) uit deze waarnemingen.
no: Deretter henter [Vision](doc://com.apple.documentation/documentation/vision) ut en [MLMultiArray](doc://com.apple.documentation/documentation/coreml/mlmultiarray) fra disse observasjonene.
pt: Depois, [Vision](doc://com.apple.documentation/documentation/vision) extrai um [MLMultiArray](doc://com.apple.documentation/documentation/coreml/mlmultiarray) dessas observações.
sv: [Vision](doc://com.apple.documentation/documentation/vision) extraherar sedan en [MLMultiArray](doc://com.apple.documentation/documentation/coreml/mlmultiarray) från de här observationerna.
th: จากนั้น [Vision](doc://com.apple.documentation/documentation/vision) จะดึง [MLMultiArray](doc://com.apple.documentation/documentation/coreml/mlmultiarray) จากการสังเกตเหล่านี้
tr: [Vision](doc://com.apple.documentation/documentation/vision) da bu gözlemlerden bir [MLMultiArray](doc://com.apple.documentation/documentation/coreml/mlmultiarray) seçip çıkarır.
vi: Sau đó, [Vision](doc://com.apple.documentation/documentation/vision) trích xuất một [MLMultiArray](doc://com.apple.documentation/documentation/coreml/mlmultiarray) từ những quan sát này.
zh_cn: [Vision](doc://com.apple.documentation/documentation/vision) 随后会从这些观察中提取一个 [MLMultiArray](doc://com.apple.documentation/documentation/coreml/mlmultiarray)（机器学习多重数组）。
zh_tw: [Vision](doc://com.apple.documentation/documentation/vision) 接著會從這些觀察中擷取出 [MLMultiArray](doc://com.apple.documentation/documentation/coreml/mlmultiarray)。

source: An `MLMultiArray` instance provides location coordinates that (in this case) map to the major hand joints, giving your ML model a rich set of hand-position data that it uses to train itself.
de: Eine `MLMultiArray`-Instanz stellt Ortskoordinaten bereit, die (in diesem Fall) den Hauptgelenken in der Hand zugeordnet sind. Dadurch steht deinem ML-Modell eine große Sammlung von Handpositionsdaten zur Verfügung, mit denen sich das Modell selbst trainiert.
es: Una instancia de `MLMultiArray` proporciona coordenadas de localización que (en este caso) toman como referencia las principales articulaciones de la mano, dando al modelo de ML un variado conjunto de datos de posiciones de la mano que utiliza para entrenarse.
es_419: Una instancia de `MLMultiArray` ofrece las coordenadas de ubicación que, en este caso, corresponden con las articulaciones principales de la mano, lo que le brinda a tu modelo de ML un conjunto de datos de posiciones de manos que puede usar para entrenarse.
fr: Une instance `MLMultiArray` fournit des coordonnées de position qui, dans ce cas, correspondent aux principales articulations de la main, donnant à ton modèle d’apprentissage automatique un riche ensemble de données de positions de la main qu’il utilise pour s’entraîner.
it: Un’istanza di `MLMultiArray` fornisce coordinate di posizione che, in questo caso, corrispondono alle articolazioni principali della mano, dando al modello di apprendimento automatico un ricco insieme di dati sulle posizioni delle mani che può utilizzare per addestrarsi.
ja: `MLMultiArray`インスタンスは、（今回の場合は）主な手の関節に対応する位置の座標を提供し、機械学習モデルの学習に使用される豊富な手の位置のデータを与えます。
ko: `MLMultiArray` 인스턴스는 (이 경우) 주요 손 관절을 매핑하는 위치 좌표를 제공하여 ML 모델이 스스로 훈련하는 데 사용하는 풍부한 손 위치 데이터 세트를 제공합니다.
nl: Een instantie van `MLMultiArray` bevat locatiecoördinaten die (in dit geval) corresponderen met belangrijke gewrichten in de hand. Zo krijgt je ML-model de beschikking over een uitgebreide set gegevens over handposities waarmee het model zichzelf kan trainen.
no: En `MLMultiArray`-instans gir koordinater for punktene som (i dette tilfellet) kobles til de største leddene i hånden, slik at maskinlæringsmodellen får et stort datasett for håndens posisjon, som den bruker til å trene seg selv.
pt: Uma instância de `MLMultiArray` fornece coordenadas de localização que (neste caso) mapeiam as principais articulações da mão, o que oferece ao modelo de AM um farto conjunto de dados de posições da mão que ele usa para se treinar.
sv: En instans av `MLMultiArray` tillhandahåller platskoordinater som (i det här fallet) kopplas till de större lederna i handen, vilket ger maskininlärningsmodellen en stor uppsättning handgestdata som den använder till att träna sig själv.
th: ชื่อแทนประเภท `MLMultiArray` จะให้พิกัดตำแหน่งที่ตั้งที่แมปไปยังส่วนเชื่อมต่อของมือ (ในกรณีนี้) ซึ่งช่วยให้โมเดล ML ของคุณมีชุดข้อมูลตำแหน่งมือมากมายที่ใช้ในการฝึกตัวเอง
tr: Bir `MLMultiArray` örneği, (bu durumda) belli başlı el eklemleriyle eşlenen konum koordinatları sunar ve ML modeline kendini eğitmek için kullanabileceği el konumu verilerinden oluşan zengin bir küme verir.
vi: Một thể hiện `MLMultiArray` cung cấp các tọa độ vị trí ánh xạ (trong trường hợp này) đến các khớp bàn tay chính, cung cấp cho mô hình ML của bạn một tập dữ liệu vị trí bàn tay phong phú mà mô hình đó sử dụng để tự huấn luyện.
zh_cn: `MLMultiArray` 实例提供了（在本例中）映射到主要手部关节的位置坐标，为你的机器学习模型自我训练提供了一组丰富的手部位置数据。
zh_tw: `MLMultiArray` 實例提供了（在這種情況下）對應到主要手部關節的位置座標，為你的 ML 模型提供一組豐富的手部位置資料，用來訓練自己。

source: In your Rock, Paper, Scissors game, if the model successfully receives an input, you’ll receive an output of a label and the [confidence](glossary://confidence), or probability, of that label. For example, if you decide to pose with a ✌️ move, the model could interpret that 80 percent scissors, 15 percent rock, and 5 percent paper. 🤷‍♀️
de: Wenn das Modell in deinem „Schere, Stein, Papier“-Spiel eine Eingabe empfängt, erhältst du eine Ausgabe in Form eines Etiketts und der [Konfidenz](glossary://confidence) oder Wahrscheinlichkeit für dieses Etikett. Wenn du zum Beispiel die Geste ✌️ zeigst, könnte das Model sie zu 80 Prozent als Schere, 15 Prozent als Stein und zu 5 Prozent als Papier interpretieren. 🤷‍♀️
es: En el juego “Piedra, papel o tijera”, si el modelo recibe correctamente una entrada, obtendrás como salida una etiqueta y la [precisión](glossary://confidence), o probabilidad, de esa etiqueta. Por ejemplo, si decides poner una postura ✌️, el modelo podría interpretar que esa imagen corresponde al 80 por ciento a tijera, el 15 por ciento a piedra y el 5 por ciento a papel. 🤷‍♀️
es_419: En tu juego de Piedra, papel o tijeras, si el modelo recibe correctamente una entrada, tú recibirás una salida con una etiqueta y la [fiabilidad](glossary://confidence), o probabilidad, de la etiqueta. Por ejemplo, si decides usar ✌️, el modelo podría interpretarlo como 80% tijeras, 15% piedra y 5% papel. 🤷‍♀️
fr: Dans ton jeu Pierre, papier, ciseaux, si le modèle reçoit bien une entrée, tu obtiens une sortie composée d’une étiquette et de la [confiance](glossary://confidence), ou probabilité, de cette étiquette. Par exemple, si tu décides de poser avec le coup ✌️, le modèle pourrait l’interpréter à 80 pour cent comme des ciseaux, à 15 pour cent comme une pierre et à 5 pour cent comme du papier. 🤷‍♀️
it: Nel tuo gioco Sasso, carta, forbici, se il modello riceve correttamente un input, riceverai come output un’etichetta e un valore di [accuratezza](glossary://confidence), o probabilità, di tale etichetta. Ad esempio, se decidi di effettuare la mossa ✌️, il modello potrebbe interpretarla 80 percento Forbici, 15 percento Sasso e 5 percento Carta. 🤷‍♀️
ja: じゃんけんゲームで、モデルが無事に入力を受け取ると、ラベルおよびそのラベルの[信頼度](glossary://confidence)つまり確率が出力されます。例えば、✌️の手を出すと、モデルはそれを80%チョキ、15%グー、5%パーのように解釈します。🤷‍♀️
ko: 가위, 바위, 보 게임에서 모델이 입력을 성공적으로 수신하면 레이블과 해당 레이블의 [신뢰도](glossary://confidence) 또는 확률을 출력합니다. 예를 들어, ✌️ 동작으로 포즈를 취하기로 결정한 경우 모델은 가위 80%, 바위 15%, 보 5%로 해석할 수 있습니다. 🤷‍♀️
nl: Als het model in je Steen, papier, schaar-game invoer ontvangt, ontvang je als uitvoer een label en de [betrouwbaarheid](glossary://confidence), of waarschijnlijkheid, van dat label. Als je bijvoorbeeld met een ✌️-zet poseert, interpreteert het model dat als 80 procent schaar, 15 procent steen en 5 procent papier. 🤷‍♀️
no: Når modellen får inndata i stein, saks, papir-spillet ditt, får du utdata i form av en etikett og [konfidensen](glossary://confidence), eller sannsynligheten, for etiketten. Hvis du for eksempel viser et ✌️-tegn, kan modellen tolke det som 80 prosent saks, 15 prosent stein og 5 prosent papir. 🤷‍♀️
pt: No jogo Pedra, Papel e Tesoura, se o modelo receber uma entrada com sucesso, você receberá uma saída com uma etiqueta e a [confiança](glossary://confidence) (ou probabilidade) dessa etiqueta. Por exemplo, se você decide mostrar um movimento de ✌️, o modelo pode interpretá‑lo como 80 por cento tesoura, 15 por cento pedra e 5 por cento papel. 🤷‍♀️
sv: Om modellen tar emot en inmatning i Sten, sax, påse-spelet får du en utmatning av en etikett och [konfidensen](glossary://confidence), eller sannolikheten, för den etiketten. Om du till exempel bestämmer dig för att använda draget ✌️ skulle modellen kunna tolka det som 80 procent sax, 15 procent sten och 5 procent papper. 🤷‍♀️
th: ในเกมเป่ายิ้งฉุบ หากโมเดลได้รับ input คุณจะได้รับ output ของป้ายและ[ความมั่นใจ](glossary://confidence) หรือความน่าจะเป็นของป้ายนั้น ตัวอย่างเช่น หากคุณตัดสินใจทำท่าทางด้วยท่า ✌️ โมเดลอาจจะตีความว่าเป็นกรรไกร 80 เปอร์เซ็นต์, ค้อน 15 เปอร์เซ็นต์ และกระดาษ 5 เปอร์เซ็นต์ 🤷‍♀️
tr: Taş, Kâğıt, Makas oyununda model başarılı bir şekilde bir giriş alırsa bir etiket çıkışı ile birlikte o etiketin [güvenilirliğini](glossary://confidence) veya olasılığını alırsın. Örneğin bir ✌️ hareketiyle poz vermeyi seçersen model bunu yüzde 80 makas, yüzde 15 taş ve yüzde 5 kâğıt olarak yorumlayabilir. 🤷‍♀️
vi: Trong trò chơi Kéo Búa Bao của bạn, nếu mô hình nhận được đầu vào thành công thì bạn sẽ nhận được một đầu ra là một nhãn và [độ tin cậy](glossary://confidence) hoặc xác suất của nhãn đó. Ví dụ: nếu bạn quyết định làm tư thế với nước đi ✌️ thì mô hình có thể diễn giải là 80% kéo, 15% búa và 5% bao. 🤷‍♀️
zh_cn: 在“石头剪刀布”游戏中，如果模型成功接收到一个输入，你将收到一个标签和标签[置信度](glossary://confidence)（或概率）的输出。例如，如果你决定出 ✌️ 动作，模型可以解释为 80% 的概率是剪刀，15% 的概率是石头，以及 5% 的概率是布。🤷‍♀️
zh_tw: 在你的「剪刀、石頭、布」遊戲中，如果模型成功接收輸入，你會收到標籤的輸出以及該標籤的[信賴度](glossary://confidence)或機率。例如，若你決定使用 ✌️ 動作，模型可以解譯 80% 的剪刀、15% 的石頭和 5% 的布。🤷‍♀️

source: Beyond image classification, you can use machine learning in your daily life.
de: Du kannst maschinelles Lernen neben der Klassifizierung von Bildern auch in deinem Alltag verwenden.
es: Además de para la clasificación de imágenes, puedes usar el aprendizaje automático en tu vida diaria.
es_419: Además de usarse para la clasificación de imágenes, el aprendizaje automático te puede servir en tu día a día.
fr: Au-delà de la classification d’images, tu peux utiliser l’apprentissage automatique dans ta vie de tous les jours.
it: Al di là della classificazione delle immagini, puoi utilizzare l’apprendimento automatico nella tua vita quotidiana.
ja: イメージの分類だけでなく、機械学習は日々の生活の中で使われています。
ko: 이미지 분류 외에도 일상 생활에서 기계 학습을 사용할 수 있습니다.
nl: Je kunt machinelearning niet alleen voor de classificatie van afbeeldingen gebruiken. Machinelearning kan ook nuttig zijn in het dagelijks leven.
no: I tillegg til klassifikasjon av bilder kan du bruke maskinlæring i hverdagen.
pt: Além da classificação de imagens, você pode usar o aprendizado de máquina no dia a dia.
sv: Bortom bildklassificering kan du använda maskininlärning i det dagliga livet.
th: คุณสามารถใช้การเรียนรู้ของเครื่องในชีวิตประจำวันของคุณได้มากกว่าการจัดประเภทภาพ
tr: Görüntü sınıflandırmanın dışında, makine öğrenimini günlük hayatta da kullanabilirsin.
vi: Ngoài việc phân loại hình ảnh, bạn có thể sử dụng học máy trong cuộc sống thường ngày.
zh_cn: 除了图像分类之外，你还可以在日常生活中使用机器学习。
zh_tw: 除了影像分類，你還可以在日常生活中使用機器學習。

source: Here are some examples; can you think of any others?
de: Hier sind ein paar Beispiele. Fallen dir noch andere ein?
es: Aquí tienes algunos ejemplos; ¿se te ocurren otros?
es_419: Aquí te incluimos algunos ejemplos, ¿pero se te ocurren otros?
fr: Voici quelques exemples. En trouves-tu d’autres ?
it: Ecco alcuni esempi; riesci a pensare ad altri?
ja: いくつか例を挙げるので、ほかにもないか考えてみましょう。
ko: 다음은 몇 가지 예입니다. 또 다른 것도 생각해 보세요.
nl: Hier volgen een paar voorbeelden. Kun je nog andere bedenken?
no: Her er noen eksempler. Kan du finne flere?
pt: Aqui estão alguns exemplos. Você consegue pensar em outros?
sv: Här är några exempel. Kan du komma på några andra?
th: นี่คือตัวอย่างบางส่วน คุณนึกถึงสิ่งอื่นอีกไหม
tr: İşte birkaç örnek; aklına başka örnekler geliyor mu?
vi: Đây là một số ví dụ; bạn có thể nghĩ được bất kỳ ví dụ nào khác không?
zh_cn: 这有一些例子；你还能想到别的吗？
zh_tw: 這裡有一些範例，你還能想出其他範例嗎？

source: Face ID and Touch ID on your Apple devices
de: Face ID und Touch ID auf deinen Apple-Geräten
es: Face ID y Touch ID en los dispositivos Apple
es_419: Face ID y Touch ID en tus dispositivos Apple
fr: Face ID et Touch ID sur tes appareils Apple
it: Face ID e Touch ID sui tuoi dispositivi Apple
ja: AppleデバイスのFace IDとTouch ID
ko: Apple 기기의 Face ID 및 Touch ID
nl: Face ID en Touch ID op je Apple apparaten
no: Face ID og Touch ID på Apple-enhetene dine
pt: Face ID e Touch ID nos dispositivos Apple
sv: Face ID och Touch ID på dina Apple-enheter
th: Face ID และ Touch ID บนอุปกรณ์ Apple ของคุณ
tr: Apple aygıtlarında Face ID ve Touch ID
vi: Face ID và Touch ID trên các thiết bị Apple của bạn
zh_cn: Apple 设备上的面容 ID 和触控 ID
zh_tw: Apple 裝置上的Face ID 和 Touch ID

source: Voice assistants, like Siri
de: Sprachassistenten wie Siri
es: Asistentes controlados por voz, como Siri
es_419: Asistentes de voz, como Siri
fr: Les assistants vocaux, tels que Siri
it: Assistenti vocali, come Siri
ja: Siriなどの音声アシスタント
ko: Siri와 같은 음성 비서
nl: Stemassistenten, zoals Siri
no: Taleassistenter, for eksempel Siri
pt: Assistentes de voz, como a Siri
sv: Röstassistenter som Siri
th: ผู้ช่วยสั่งการด้วยเสียง เช่น Siri
tr: Siri gibi sesli yardımcılar
vi: Trợ lý giọng nói, như Siri
zh_cn: 语音助手，如 Siri
zh_tw: 語音助理，如 Siri

source: Recommendations made on streaming services
de: Empfehlungen bei Streamingdiensten
es: Recomendaciones sobre servicios de streaming
es_419: Recomendaciones en servicios de streaming
fr: Les recommandations des services de streaming
it: Contenuti consigliati su servizi di streaming
ja: ストリーミングサービスに表示されるおすすめ
ko: 스트리밍 서비스에서 제공하는 추천
nl: Aanbevelingen van streamingdiensten
no: Anbefalinger fra strømmetjenester
pt: Recomendações feitas em serviços de streaming
sv: Rekommendationer som gjorts i strömningstjänster
th: คำแนะนำที่สร้างบนบริการการสตรีม
tr: Yayın servislerinde sunulan öneriler
vi: Các đề xuất được đưa ra trên các thiết bị truyền phát
zh_cn: 流媒体服务的推荐内容
zh_tw: 關於串流服務的建議

source: The “For You” tab in the Photos app
de: Der Tab „Für dich“ in der App „Fotos“
es: La pestaña “Para ti” de la app Fotos
es_419: La pestaña Para ti de la app Fotos
fr: L’onglet « Pour vous » de l’app Photos
it: Il pannello “Per te” nell’app Foto
ja: “写真”Appの“For You”タブ
ko: 사진 앱의 ‘For You’ 탭
nl: Het tabblad 'Voor jou' in de Foto's-app
no: «For deg»-fanen i Bilder-appen
pt: A aba “Para Você” no app Fotos
sv: ”För dig”-fliken i appen Bilder
th: แถบ “สำหรับคุณ” ในแอปรูปภาพ
tr: Fotoğraflar uygulamasındaki “Sizin İçin” sekmesi
vi: Tab “Cho bạn” trong ứng dụng Ảnh
zh_cn: “照片” App 中的“为你推荐”标签页
zh_tw: 「照片」App 中的「為你推薦」標籤頁

source: Train your ML model
de: Dein ML-Modell trainieren
es: Entrenar el modelo de ML
es_419: Entrenar el modelo de ML
fr: Entraîner ton modèle d’apprentissage automatique
it: Addestrare il modello di apprendimento automatico
ja: 機械学習モデルを学習させる
ko: ML 모델 훈련하기
nl: Het ML-model trainen
no: Tren maskinlæringsmodellen
pt: Treine o modelo de AM
sv: Träna maskininlärningsmodellen
th: ฝึกโมเดล ML ของคุณ
tr: Makine öğrenimi modelini eğitme
vi: Huấn luyện mô hình ML của bạn
zh_cn: 训练你的机器学习模型
zh_tw: 訓練你的 ML 模型

source: Use a pre-existing dataset to create your own ML model.
de: Verwende einen vorhandenen Datensatz, um ein eigenes ML-Modell zu erstellen.
es: Usa un conjunto de datos preexistente para crear tu propio modelo de aprendizaje automático.
es_419: Usa un conjunto de datos preexistente para crear tu propio modelo de ML.
fr: Utilise un ensemble de données préexistant pour créer ton propre modèle d’apprentissage automatique.
it: Utilizza un insieme di dati già esistente per creare un modello di apprendimento automatico tutto tuo.
ja: 既存のデータセットを使って自分だけの機械学習モデルを作成します。
ko: 기존 데이터 세트를 사용하여 고유한 ML 모델을 만듭니다.
nl: Gebruik een bestaande gegevensset om je eigen ML-model aan te maken.
no: Bruk et eksisterende datasett til å lage din egen maskinlæringsmodell.
pt: Use um conjunto de dados pré‑existentes para criar o seu próprio modelo de AM.
sv: Använd en befintlig datauppsättning till att skapa en egen maskininlärningsmodell.
th: ใช้ชุดข้อมูลที่มีอยู่ก่อนหน้าเพื่อสร้างโมเดล ML ของคุณเอง
tr: Kendi makine öğrenimi modelini yaratmak için önceden var olan bir veri kümesini kullan.
vi: Sử dụng một tập dữ liệu có sẵn để tạo ra mô hình ML của riêng bạn.
zh_cn: 使用现有的数据集创建自己的机器学习模型。
zh_tw: 使用預先存在的資料集建立你自己的 ML 模型。

source: Now it’s time to train your first ML model!
de: Jetzt ist es an der Zeit, dein erstes ML-Modell zu trainieren!
es: ¡Ya es el momento de entrenar tu primer modelo de ML!
es_419: ¡Ahora es el momento de entrenar tu primer modelo de ML!
fr: À présent, il est temps d’entraîner ton premier modèle d’apprentissage automatique !
it: È giunto il momento di addestrare il tuo primo modello di apprendimento automatico!
ja: それでは、最初の機械学習モデルを学習させましょう!
ko: 이제 첫 번째 ML 모델을 훈련할 시간입니다!
nl: Nu is het tijd om je eerste ML-model te trainen!
no: Nå er det på tide å trene den første maskinlæringsmodellen din!
pt: Agora é hora de treinar o seu primeiro modelo de AM!
sv: Nu är det dags att träna din första maskininlärningsmodell!
th: ตอนนี้ถึงเวลาฝึกโมเดล ML แรกของคุณแล้ว!
tr: Şimdi sıra ilk makine öğrenimi modelini eğitmede!
vi: Bây giờ là lúc huấn luyện mô hình ML đầu tiên của bạn!
zh_cn: 现在该训练你的第一个机器学习模型了！
zh_tw: 現在是時候來訓練你的第一個 ML 模型了！

source: You’ll start by using a pre-existing dataset of labeled hand pose images to train the model.
de: Du nutzt zunächst einen bereits vorhandenen Datensatz mit etikettierten Bildern von Handgesten, um das Modell zu trainieren.
es: Empieza por entrenar el modelo usando un conjunto de datos preexistente de imágenes etiquetadas de posturas de manos.
es_419: Para entrenar el modelo, usa un conjunto de datos existente de imágenes etiquetadas de poses de mano.
fr: Tu commenceras par utiliser un ensemble de données préexistant d’images de positions de la main étiquetées pour entraîner le modèle.
it: Inizierai ad addestrare il modello utilizzando un insieme di dati già esistente contenente immagini etichettate di pose delle mani.
ja: まずは、ラベル付けされた手の形のイメージを集めた既存のデータセットを使用してモデルを学習させます。
ko: 기존 레이블이 지정된 손 포즈 이미지의 데이터 세트를 사용하여 모델 훈련을 시작해 보세요.
nl: Je begint met een bestaande gegevensset met gelabelde afbeeldingen van handgebaren om het model te trainen.
no: Du begynner med å trene modellen med et eksisterende datasett med merkede håndtegn.
pt: Para começar, você usará um conjunto de dados pré‑existentes com imagens de sinais com a mão para treinar o modelo.
sv: Du börjar med att använda en befintlig datauppsättning med etiketterade bilder av handgester till att träna modellen.
th: คุณจะเริ่มโดยใช้ชุดข้อมูลของภาพท่าทางมือที่ติดป้ายที่มีอยู่ก่อนหน้าเพื่อฝึกโมเดล
tr: Modeli eğitmek için etiketli el pozu görüntülerinin önceden var olan bir veri kümesini kullanarak başlayacaksın.
vi: Bạn sẽ bắt đầu bằng cách sử dụng tập dữ liệu có sẵn gồm các hình ảnh tư thế bàn tay đã gắn nhãn để huấn luyện mô hình.
zh_cn: 你将首先使用已标记手势图像的现有数据集来训练模型。
zh_tw: 你將會使用包含已標記的手部姿勢影像的現有資料集來開始訓練模型。
