Repository: JulioPr0/ml-rock-paper-scissors
Catalog: Rock, Paper, Scissors game with ML.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: You’ll gather images of hand poses and label them to your game’s moves: Rock ✊, Paper ✋, and Scissors ✌️. These labeled images are the only examples that the machine’s “brain” has ever seen, so make sure they’re representative of what each hand pose looks like.
de: Du sammelst daher Bilder von Handgesten und etikettierst sie mit den entsprechenden Spielzügen deines Spiels: Schere ✌️, Stein ✊ und Papier ✋. Diese etikettierten Bilder sind die einzigen Bilder, die das „Gehirn“ der Maschine jemals gesehen hat. Du solltest also sicherstellen, dass sie die jeweiligen Handgesten so gut wie möglich darstellen.
es: Recopilarás imágenes de posturas de manos y las etiquetarás para tus jugadas: Piedra ✊, Papel ✋ y Tijera ✌️. Estas imágenes etiquetadas son los únicos ejemplos que ha visto hasta ahora el “cerebro” del ordenador, así que intenta que sean representativas de cómo son las diversas posturas de las manos.
es_419: Debes recopilar imágenes de poses de manos y etiquetarlas con los movimientos del juego: piedra ✊, papel ✋ y tijeras ✌️. Estas imágenes etiquetadas son los únicos ejemplos con los que cuenta el “cerebro” de la máquina, así que asegúrate de que sean representativas de las diversas poses.
fr: Tu vas collecter des images de positions de la main et les étiqueter selon les coups de ton jeu : Pierre ✊, Papier ✋ et Ciseaux ✌️. Ces images étiquetées sont les seuls exemples que le « cerveau » de la machine ait jamais vus. Aussi, assure-toi qu’elles sont représentatives de chaque position de la main.
it: Raccoglierai immagini di pose delle mani e le etichetterai con le mosse del gioco: Sasso ✊, Carta ✋ e Forbici✌️. Queste immagini etichettate sono gli unici esempi che il “cervello” della macchina abbia mai visto, quindi assicurati che siano rappresentative dell’aspetto di ciascuna posa delle mani.
ja: 手の形のイメージを収集して、ゲームで出せる手であるグー✊、チョキ✌️、パー✋のラベルを付けます。これらのラベル付きイメージは、機械の“頭脳”が見る唯一の例なので、それぞれの手の形の見た目の代表としてふさわしいものにしましょう。
ko: 손 포즈의 이미지를 수집하고 게임의 동작인 가위✌️, 바위 ✊, 보 ✋ 레이블을 지정합니다. 이렇게 레이블이 지정된 이미지는 기계의 ‘뇌’가 본 유일한 예이므로, 각각의 손 포즈가 어떻게 보여지는지 나타내도록 해야 합니다.
nl: Je gaat afbeeldingen van handgebaren verzamelen en deze labelen met de zetten van je game: steen ✊, papier ✋ en schaar ✌️. Deze gelabelde afbeeldingen zijn de enige afbeeldingen die het "brein" van de machine ooit heeft gezien, dus zorg dat ze een goed beeld geven van elk handgebaar.
no: Du må samle bilder av håndtegn og merke dem med tegnene i spillet: stein ✊, saks ✌️ og papir ✋. Disse merkede bildene er de eneste eksemplene som maskinens «hjerne» har sett, så du må sørge for at de er representative for hvordan hvert håndtegn ser ut.
pt: Reúna imagens de sinais com a mão e as etiquete de acordo com os movimentos do jogo: Pedra ✊, Papel ✋ e Tesoura ✌️. Como essas imagens etiquetadas são os únicos exemplos que o “cérebro” da máquina já viu, é importante que elas representem bem a aparência que cada sinal com a mão tem.
sv: Du kommer att samla in bilder på handgester och etikettera dem med spelets drag: sten ✊, sax ✌️ och påse ✋. De här etiketterade bilderna är de enda exemplen som maskinens ”hjärna” någonsin har sett, så se till att de är representativa för utseendet på de olika handgesterna.
th: คุณจะได้รวบรวมภาพของท่าทางมือและติดป้ายภาพเป็นท่าของเกมของคุณ ซึ่งได้แก่: ค้อน ✊, กระดาษ ✋ และกรรไกร ✌️ ภาพที่ติดป้ายเหล่านี้เป็นเพียงตัวอย่างเดียวที่ “สมอง” ของเครื่องเคยเห็น คุณจึงต้องดูให้แน่ใจว่าภาพเหล่านี้เป็นตัวแทนของสิ่งที่ดูเหมือนท่าทางมือ
tr: El pozu görüntülerini toplayacak ve bunları oyunundaki hareketlerle etiketleyeceksin: Taş ✊, Kâğıt ✋ ve Makas ✌️. Bu etiketli görüntüler, makinenin “beyninin” gördüğü tek örneklerdir, bu yüzden bunların her el pozu görünüşünü temsil ettiğinden emin ol.
vi: Bạn sẽ thu thập hình ảnh về các tư thế bàn tay và gắn nhãn cho chúng theo các nước đi của trò chơi: Búa ✊, Bao ✋ và Kéo ✌️. Những hình ảnh được gắn nhãn này chỉ là các ví dụ mà “bộ não” của máy từng nhìn thấy, vậy nên hãy đảm bảo rằng chúng đại diện cho hình ảnh của từng tư thế bàn tay.
zh_cn: 你将收集手势的图像，然后将它们标记为游戏的动作：石头 ✊、布 ✋ 和剪刀 ✌️。这些标记的图像是机器的“大脑”见过的唯一例子，所以要确保它们代表每个手势的样子。
zh_tw: 你將收集手部姿勢的影像並將它們標記為你的遊戲動作：剪刀 ✌️、石頭 ✊ 和布 ✋。這些標記的影像是機器的「大腦」見過的唯一範例，因此請確保它們能代表每個手部姿勢的模樣。

source: Machine learning engineers often need to go through their datasets and ensure they’re good quality datasets. This process is called [data cleaning](glossary://data%20cleaning), and it’s one of the most important steps in machine learning since it dramatically affects how your machine learning model performs.
de: ML-Entwickler:innen müssen ihre Datensätze oft durchschauen und sicherstellen, dass die Qualität der Datensätze hoch ist. Dieser Prozess wird als [Datenbereinigung](glossary://data%20cleaning) bezeichnet und ist einer der wichtigsten Schritte beim maschinellen Lernen, da er großen Einfluss auf die Funktionsweise des ML-Modells hat.
es: Es frecuente que los ingenieros dedicados al aprendizaje automático tengan que revisar sus conjuntos de datos para asegurarse de que son de buena calidad. Este proceso se denomina [limpieza de datos](glossary://data%20cleaning) y es uno de los pasos más importantes del aprendizaje automático, ya que afecta mucho al funcionamiento del modelo de aprendizaje automático.
es_419: Los ingenieros especializados en aprendizaje automático suelen tener que revisar sus conjuntos de datos y asegurarse de que sean de calidad. A este proceso se le llama [limpieza de datos](glossary://data%20cleaning), y es uno de los pasos más importantes del aprendizaje automático, ya que afecta en gran medida el funcionamiento del modelo.
fr: Les ingénieurs en apprentissage automatique doivent souvent passer en revue leurs ensembles de données pour s’assurer qu’ils sont de bonne qualité. Ce processus s’appelle le [nettoyage de données](glossary://data%20cleaning), et il constitue l’une des étapes les plus importantes de l’apprentissage automatique puisqu’il a un impact considérable sur les performances de ton modèle d’apprentissage automatique.
it: Spesso gli ingegneri che si occupano di apprendimento automatico devono ricontrollare gli insiemi di dati per assicurarsi che siano di buona qualità. Questo processo viene chiamato [pulizia dei dati](glossary://data%20cleaning) ed è uno dei passaggi più importanti nell’apprendimento automatico perché influisce in modo sostanziale sulle prestazioni di un modello.
ja: 機械学習のエンジニアは、データセットをチェックして良質であることを確認する必要があることが多いです。このプロセスは[データクリーニング](glossary://data%20cleaning)と呼ばれ、機械学習モデルの性能に大きく影響するため、機械学習において最も重要な手順の1つです。
ko: 기계 학습 엔지니어는 자주 데이터 세트를 살펴보고 양질의 데이터 세트인지 확인해야 합니다. 이 프로세스를 [데이터 정제](glossary://data%20cleaning)라고 하며, 기계 학습 모델이 작동하는 방식에 아주 큰 영향을 미치기 때문에 기계 학습에서 가장 중요한 단계 중 하나입니다.
nl: Engineers die zich bezighouden met machinelearning moeten de kwaliteit van hun gegevenssets regelmatig controleren. Dit proces wordt [gegevensopschoning](glossary://data%20cleaning) genoemd. Het is een van de belangrijkste stappen in machinelearning omdat het bepalend is voor de prestaties van het ML-model.
no: Ingeniører som arbeider med maskinlæring, må ofte gå gjennom datasettene sine for å sikre at de er av god kvalitet. Denne prosessen kalles [datarydding](glossary://data%20cleaning), og den er et av de viktigste trinnene i maskinlæring fordi den får store konsekvenser for maskinlæringsmodellens ytelse.
pt: Normalmente, as pessoas que trabalham com engenharia de aprendizado de máquina precisam analisar os conjuntos de dados para garantir que eles sejam de boa qualidade. Esse processo é chamado de [limpeza de dados](glossary://data%20cleaning) e é um dos passos mais importantes no aprendizado de máquina, já que afeta drasticamente o desempenho do modelo de aprendizado de máquina.
sv: Ingenjörer som arbetar med maskininlärning måste ofta gå igenom sina datauppsättningar och se till att de håller en hög kvalitet. Den här processen kallas för [datarensning](glossary://data%20cleaning) och är ett av de viktigaste stegen inom maskininlärning eftersom den har en dramatisk effekt på maskininlärningsmodellens prestanda.
th: วิศวกรการเรียนรู้ของเครื่องต้องตรวจสอบชุดข้อมูลและดูให้แน่ใจว่าชุดข้อมูลมีคุณภาพที่ดีอยู่เสมอ กระบวนการนี้เรียกว่า[การทำความสะอาดข้อมูล](glossary://data%20cleaning) ซึ่งเป็นหนึ่งในขั้นตอนสำคัญในการเรียนรู้ของเครื่อง เนื่องจากขั้นตอนนี้จะส่งผลต่อวิธีการทำงานของโมเดลการเรียนรู้ของเครื่องของคุณอย่างเห็นได้ชัด
tr: Makine öğrenimi mühendislerinin sıklıkla veri kümelerini gözden geçirip bunların iyi kalitede veri kümeleri olduğundan emin olmaları gerekir. Bu işleme [veri temizleme](glossary://data%20cleaning) denir ve makine öğrenimi modelinin performansını önemli ölçüde etkilediğinden makine öğreniminin en önemli adımlarından biridir.
vi: Các kỹ sư học máy thường cần xem xét kỹ lưỡng tập dữ liệu của họ và đảm bảo rằng chúng là các tập dữ liệu có chất lượng tốt. Quá trình này được gọi là [làm sạch dữ liệu](glossary://data%20cleaning) và đó là một trong những bước quan trọng nhất trong học máy vì nó tác động sâu sắc đến hoạt động của mô hình học máy.
zh_cn: 机器学习工程师经常需要浏览他们的数据集，并确保它们是高质量的数据集。这个过程称为[数据清理](glossary://data%20cleaning)，它是机器学习中最重要的步骤之一，因为它会显著影响机器学习模型的表现。
zh_tw: 機器學習的工程師經常需要檢查他們的資料集並確保它們是高品質的資料集。這個過程稱為[資料清理](glossary://data%20cleaning)，它是機器學習中最重要的步驟之一，因為它對機器學習模型的執行方式有很大的影響。

source: Some examples of how to clean the data for your hand pose ML model include:
de: Hier sind einige Beispiele, wie du die Daten für dein Handgesten-ML-Modell bereinigen kannst:
es: Algunos ejemplos de cómo limpiar el modelo de ML de las posturas de manos:
es_419: A continuación se incluyen algunos ejemplos de cómo puedes limpiar el modelo de ML de las poses de mano:
fr: Voici des exemples de manières de nettoyer les données de ton modèle d’apprentissage automatique de positions de la main :
it: Alcuni esempi di pulizia dei dati per il tuo modello di apprendimento automatico per le pose delle mani includono:
ja: 手の形の機械学習モデルに使うデータをどうクリーニングすればよいか、以下に例を挙げます:
ko: 손 포즈 ML 모델의 데이터를 정제하는 몇 가지 예시는 다음과 같습니다.
nl: Hier volgen enkele voorbeelden van manieren waarop je de gegevens van je ML-model voor handgebaren kunt opschonen:
no: Her er noen eksempler på hvordan du kan rydde i dataene for maskinlæringsmodellen for håndtegn:
pt: Alguns exemplos de como limpar os dados do modelo de AM de sinais com a mão incluem:
sv: Några exempel på hur du rensar maskininlärningsmodellens data för handgester omfattar att:
th: ตัวอย่างบางส่วนของวิธีทำความสะอาดข้อมูลสำหรับโมเดล ML ท่าทางมือของคุณ ได้แก่:
tr: El pozu makine öğrenimi modelinin verilerini temizleme örnekleri arasında şunlar sayılabilir:
vi: Một số ví dụ về cách làm sạch dữ liệu cho mô hình ML tư thế bàn tay của bạn bao gồm:
zh_cn: 一些如何清理手势机器学习模型数据的例子包括：
zh_tw: 有一些如何為你的手部姿勢 ML 模型清理資料的範例：

source: Ensuring there is a hand pose in the image
de: Stelle sicher, dass eine Handgeste auf dem Bild zu sehen ist.
es: Asegurarse de que en la imagen hay una postura de mano.
es_419: Asegúrate de que se muestre una pose de mano en la imagen.
fr: Vérifie que l’image contient une position de la main
it: Assicurarsi che nell’immagine sia presente la posa di una mano
ja: イメージに手の形が写っていることを確認する
ko: 이미지에 손 포즈가 있는지 확인하기
nl: Controleren of de afbeelding een handgebaar bevat
no: Sørg for at det er et håndtegn i bildet
pt: Garantir que exista um sinal com a mão na imagem
sv: Se till att det finns en handgest i bilden.
th: การตรวจสอบให้แน่ใจว่ามีท่าทางมืออยู่ในภาพ
tr: Görüntüde el pozu olduğundan emin olma
vi: Đảm bảo rằng có một tư thế bàn tay trong hình ảnh
zh_cn: 确保图像中有一个手势
zh_tw: 確定影像中有手部的姿勢

source: Ensuring the hand pose isn’t too far from the camera, and not too close in the frame
de: Stelle sicher, dass die Handgeste nicht zu weit von der Kamera entfernt ist und sich nicht zu nah im Rahmen befindet.
es: Asegurarse de que la postura de la mano no está demasiado lejos de la cámara ni demasiado cerca en el encuadre.
es_419: Asegúrate de que la pose de mano no esté muy lejos ni muy cerca del visor de la cámara.
fr: Vérifie que la position de la main n’est pas trop éloignée, ni trop proche de l’appareil photo
it: Assicurarsi che la posa della mano non sia troppo lontana dalla fotocamera e non sia troppo vicina nell’inquadratura
ja: 手の形がカメラから遠すぎず、フレームに近すぎもしないことを確認する
ko: 손 포즈가 카메라에서 너무 멀리 떨어지지 않도록 하고 프레임에서 너무 가까이 가지 않도록 하기
nl: Controleren of de foto van het handgebaar niet van te dichtbij of te veraf is gemaakt
no: Sørg for at håndtegnet ikke er for langt unna kameraet, og ikke for nært i bildet
pt: Garantir que o sinal com a mão não esteja muito longe da câmera nem muito perto do quadro
sv: Se till att handgesten inte är för långt borta från kameran och inte för nära i bildrutan.
th: การตรวจสอบให้แน่ใจว่าท่าทางมือไม่ได้อยู่ห่างจากกล้องมากเกินไป และไม่ได้อยู่ใกล้เกินไปในเฟรม
tr: El pozunun kameraya çok uzak olmadığından ve karede çok yakın görünmediğinden emin olma
vi: Đảm bảo rằng tư thế bàn tay không quá xa camera và không quá gần trong khung hình
zh_cn: 确保手势没有离摄像头太远，但也不能太靠近取景框
zh_tw: 確定手的姿勢不會離相機太遠，在畫面中也不會太近

source: Ensuring that your images aren’t mislabeled, like a rock image accidentally labeled as scissors
de: Stelle sicher, dass die Bilder nicht falsch etikettiert sind, z. B. dass ein Bild mit „Stein“ nicht als „Schere“ etikettiert ist.
es: Comprobar que las imágenes no están mal etiquetadas, como una imagen de una piedra accidentalmente etiquetada como tijeras.
es_419: Asegúrate de que las imágenes no estén mal etiquetadas (por ejemplo, una imagen del movimiento de piedra etiquetada como si fuera de tijeras).
fr: Vérifie que tes images sont bien étiquetées, par exemple qu’une image de pierre n’est pas accidentellement étiquetée comme des ciseaux
it: Assicurarsi che le immagini non siano accidentalmente etichettate in modo errato, come l’immagine di una Roccia etichettata accidentalmente come Forbici
ja: イメージのラベル付けが誤っていないことを確認する（グーのイメージに誤ってチョキのラベルが付いているなど）
ko: 실수로 가위로 레이블이 지정된 바위 이미지와 같이 이미지의 레이블이 잘못 지정되지 않도록 하기
nl: Controleren of de afbeeldingen een verkeerd label hebben, zoals een afbeelding van een steengebaar dat is gelabeld als een schaargebaar
no: Sørg for at bildene ikke er merket feil, for eksempel at et bilde av tegnet for stein ikke er merket som saks
pt: Garantir que as imagens não tenham uma etiqueta incorreta, como uma imagem de pedra acidentalmente marcada como tesoura
sv: Se till att bilder inte är feletiketterade, som att en stenbild oavsiktligt har etiketterats som en sax.
th: การตรวจสอบให้แน่ใจว่าภาพของคุณไม่ได้ติดป้ายผิด เช่น ภาพค้อนติดป้ายผิดเป็นกรรไกรโดยไม่ได้ตั้งใจ
tr: Görüntülerinin yanlış etiketlenmediğinden (örneğin bir taş görüntüsünün yanlışlıkla makas olarak etiketlenmesi) emin olma
vi: Đảm bảo rằng hình ảnh không bị gắn nhãn sai, ví dụ như hình ảnh búa được vô tình gắn nhãn là kéo
zh_cn: 确保图像没有被错误标记，例如将石头图像意外标记为剪刀
zh_tw: 確定你的影像沒有標記錯誤，例如不小心標記為剪刀的石頭影像

source: Ensuring there aren’t duplicate photos in the dataset
de: Stelle sicher, dass sich keine doppelten Fotos im Datensatz befinden.
es: Cerciorarse de que en el conjunto de datos no hay fotos duplicadas.
es_419: Asegúrate de que no haya fotos duplicadas en el conjunto de datos.
fr: Vérifie qu’il n’y a pas de photos en double dans l’ensemble de données
it: Assicurarsi che non ci siano foto duplicate nell’insieme di dati
ja: データセットに写真の重複がないことを確認する
ko: 데이터 세트에 중복된 사진이 없도록 하기
nl: Controleren of de gegevensset geen dubbele foto's bevat
no: Sørg for at det ikke er to eksemplarer av bilder i datasettet
pt: Garantir que não existam fotos duplicadas no conjunto de dados
sv: Se till att det inte finns dubblettbilder i datauppsättningen.
th: การตรวจสอบให้แน่ใจว่าไม่มีภาพซ้ำในชุดข้อมูล
tr: Veri kümesinde yinelen fotoğraf olmadığından emin olma
vi: Đảm bảo rằng không có ảnh trùng lặp trong tập dữ liệu
zh_cn: 确保数据集中没有重复的照片
zh_tw: 確定資料集中沒有重複的照片

source: Ensuring there are roughly equal amounts of images for each hand gesture
de: Stelle sicher, dass ungefähr gleich viele Bilder für jede Handgeste vorhanden sind.
es: Asegurarse de que en general hay la misma cantidad de imágenes para cada gesto de mano.
es_419: Asegúrate de que haya una cantidad similar de imágenes de cada gesto.
fr: Vérifie que tu as à peu près le même nombre d’images pour chaque geste de la main
it: Assicurarsi che approssimativamente sia presente uno stesso numero di immagini per ciascun gesto
ja: それぞれの手の形に対しておおよそ同じ枚数のイメージがあることを確認する
ko: 각 손 제스처에 대해 거의 동일한 수의 이미지가 있는지 확인하기
nl: Controleren of het aantal afbeeldingen per handgebaar ongeveer hetzelfde is
no: Sørg for at det er omtrent like mange bilder av hvert håndtegn
pt: Garantir que existam quantidades aproximadamente iguais das imagens de cada gesto
sv: Se till att det finns ungefär lika många bilder för varje handgest.
th: การตรวจสอบให้แน่ใจว่าภาพสำหรับแต่ละท่าทางมือมีจำนวนโดยประมาณเท่ากัน
tr: Her el hareketi için yaklaşık aynı sayıda görüntü olduğundan emin olma
vi: Đảm bảo rằng số lượng hình ảnh cho mỗi cử chỉ bàn tay xấp xỉ bằng nhau
zh_cn: 确保各个手势的图像数量大致相等
zh_tw: 確定每個手部姿勢有大致相同數量的影像

source: Increase the size of your training dataset artificially
de: Deinen Trainingsdatensatz künstlich vergrößern
es: Aumentar artificialmente el tamaño del conjunto de datos de entrenamiento
es_419: Incrementar de forma artificial el tamaño del conjunto de datos de entrenamiento
fr: Augmenter artificiellement la taille d’un ensemble de données d’apprentissage
it: Aumentare in maniera artificiale le dimensioni dell’insieme di dati di addestramento
ja: 学習データセットのサイズを人工的に増やす
ko: 훈련 데이터 세트의 크기를 인위적으로 늘리기
nl: De omvang van je trainingsgegevensset kunstmatig vergroten
no: Øk størrelsen på treningsdatasettet på en kunstig måte
pt: Aumente o tamanho do conjunto de dados de treinamento artificialmente
sv: Öka storleken på träningens datauppsättning artificiellt
th: เพิ่มขนาดชุดข้อมูลการฝึกของคุณด้วยการจัดทำขึ้น
tr: Eğitim veri kümenin büyüklüğünü yapay olarak artırma
vi: Tăng kích cỡ của tập dữ liệu huấn luyện theo cách nhân tạo
zh_cn: 人为增加训练数据集的大小
zh_tw: 以人工方式增加訓練資料集的大小
