Repository: JulioPr0/ml-rock-paper-scissors
Catalog: Rock, Paper, Scissors game with ML.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Does the model recognize your hand poses correctly?
de: Werden deine Handgesten vom Modell korrekt erkannt?
es: ¿Reconoce correctamente el modelo las posturas de las manos?
es_419: ¿El modelo reconoce tus poses de mano correctamente?
fr: Le modèle reconnaît-il correctement la position de ta main ?
it: Il modello riconosce correttamente le pose della mano?
ja: モデルはあなたの手の形を正しく認識しましたか?
ko: 모델이 손 포즈를 제대로 인식하나요?
nl: Worden je handgebaren goed door het model herkend?
no: Gjenkjenner modellen håndtegnene som den skal?
pt: O modelo reconhece corretamente os sinais com a mão?
sv: Känner modellen igen dina handgester som den ska?
th: โมเดลรู้จำท่าทางมือของคุณได้ถูกต้องหรือไม่
tr: Model el pozlarını doğru tanıyor mu?
vi: Mô hình có nhận biết chính xác các tư thế bàn tay của bạn không?
zh_cn: 模型能正确识别你的手势吗？
zh_tw: 模型能正確地辨識你的手部姿勢嗎？

source: Which of the hand poses does it seem best at identifying?
de: Welche Handgesten kann es am besten identifizieren?
es: ¿Cuál de las posturas de las manos parece que identifica mejor?
es_419: ¿Cuál pose parece ser la que mejor puede identificar?
fr: Laquelle des positions de la main semble-il le mieux identifier ?
it: Quali pose sembra riuscire a identificare meglio?
ja: 一番うまく識別される手の形は何ですか?
ko: 어떤 손 포즈를 가장 잘 식별하는 것 같나요?
nl: Welke handgebaren herkent het model het beste?
no: Hvilke håndtegn ser det ut til at den gjenkjenner best?
pt: Qual dos sinais com a mão ele parece identificar melhor?
sv: Vilken av handgesterna verkar den vara bäst på att identifiera?
th: ท่าทางมือแบบใดที่ดูเหมือนจะระบุได้ดีที่สุด
tr: Hangi el pozunu tanımada en iyi gibi görünüyor?
vi: Mô hình nhận dạng tư thế bàn tay nào của bạn tốt nhất?
zh_cn: 哪个手势的辨认度最高？
zh_tw: 它似乎最擅長辨識哪一個手部姿勢呢？

source: Which hand poses does it struggle to identify?
de: Bei welchen Handgesten hat das Modell Probleme beim Identifizieren?
es: ¿Qué posturas de las manos le cuesta más trabajo identificar?
es_419: ¿Cuáles son las posiciones que tiene problemas para identificar?
fr: Quelles positions de la main a-t-il du mal à identifier ?
it: Quali pose fa più fatica a identificare?
ja: 識別がうまくいかない手の形は何ですか?
ko: 어떤 손 포즈를 식별하기가 어려울까요?
nl: Welke handgebaren vindt het model moeilijk om te herkennen?
no: Hvilke håndtegn har den problemer med å gjenkjenne?
pt: Qual dos sinais com a mão ele tem mais dificuldade de identificar?
sv: Vilka handgester har den svårt att identifiera?
th: ท่าทางมือแบบใดที่มีปัญหาในการระบุ
tr: Hangi el pozlarını tanımada zorluk çekiyor?
vi: Mô hình gặp khó khăn khi nhận dạng tư thế bàn tay nào?
zh_cn: 哪个手势识别起来有困难？
zh_tw: 它最不擅長辨識哪一個手勢呢？

source: Next, you’ll learn how to improve and debug your ML model.
de: Als Nächstes lernst du, wie du das ML-Modell optimieren und debuggen kannst.
es: A continuación, aprenderás a mejorar y depurar tu modelo de ML.
es_419: A continuación, aprenderás a mejorar y depurar tu modelo de ML.
fr: Ensuite, tu découvriras comment améliorer et déboguer ton modèle d’apprentissage automatique.
it: Nella prossima attività, scoprirai come migliorare il tuo modello di apprendimento automatico e come eseguirne il debug.
ja: 次は、機械学習モデルを改善してデバッグする方法を学びます。
ko: 이제 ML 모델을 향상하고 디버깅하는 방법을 배울 거예요.
nl: Nu ga je leren hoe je het ML-model kunt verbeteren en er fouten in kunt opsporen.
no: Nå skal du lære hvordan du forbedrer og feilsøker maskinlæringsmodellen din.
pt: A seguir, você aprenderá a melhorar e depurar o modelo de AM.
sv: Härnäst lär du dig att förbättra och felsöka din maskininlärningsmodell.
th: ถัดไป คุณจะได้เรียนรู้วิธีปรับปรุงและแก้บั๊กโมเดล ML ของคุณ
tr: Sonra, makine öğrenimi modelini iyileştirmeyi ve modelindeki hataları ayıklamayı öğreneceksin.
vi: Tiếp theo, bạn sẽ tìm hiểu cách cải thiện và gỡ lỗi mô hình ML của mình.
zh_cn: 下一步，你将了解如何改进和调试你的机器学习模型。
zh_tw: 下一步，你將學習如何改進並為你的 ML 模型除錯。

# GuideBook..Guide0..StepGet Started with Machine Learning..TaskGroup2..title
source: Debugging your machine learning model
de: Dein Modell für maschinelles Lernen debuggen
es: Depurar el modelo de aprendizaje automático
es_419: Depurar el modelo de aprendizaje automático
fr: Débogage de ton modèle d’apprentissage automatique
it: Eseguire il debug del modello di apprendimento automatico
ja: 機械学習モデルをデバッグする
ko: 기계 학습 모델 디버깅
nl: Fouten opsporen in je ML-model
no: Feilsøke maskinlæringsmodellen
pt: Depurando o modelo de aprendizado de máquina
sv: Felsöka maskininlärningsmodellen
th: การแก้บั๊กโมเดลการเรียนรู้ของเครื่องของคุณ
tr: Makine öğrenimi modelindeki hataları ayıklama
vi: Gỡ lỗi mô hình học máy của bạn
zh_cn: 调试你的机器学习模型
zh_tw: 為你的機器學習模型除錯

source: See what your camera sees by drawing an overlay of nodes
de: Mit einer Überlagerung aus Knoten anzeigen lassen, was die Kamera sieht
es: Ver lo mismo que la cámara dibujando nodos superpuestos
es_419: Visualizar lo que detecta la cámara mediante una sobreposición de nodos
fr: Voir ce que voit ton appareil photo en dessinant une superposition de nœuds
it: Visualizzare ciò che vede la fotocamera disegnando una sovrapposizione di nodi
ja: ノードをオーバーレイで表示してカメラが見ているものを確認する
ko: 노드 오버레이를 그려서 카메라에 보여지는 내용 보기
nl: Zien wat je camera ziet door een overlay met nodes te tekenen
no: Tegn et overlegg med noder for å se hva kameraet ser
pt: Desenhe uma sobreposição de nós para ver o que a câmera vê
sv: Se det kameran ser genom att rita upp ett överlägg med noder
th: ดูว่ากล้องของคุณเห็นอะไรด้วยการวาดโหนดซ้อนกัน
tr: Düğümlerden oluşan bir katman çizerek kameranın gördüğünü görme
vi: Xem camera của bạn nhìn thấy gì bằng cách vẽ một lớp phủ gồm các node
zh_cn: 通过绘制节点叠层来查看摄像头看到的内容
zh_tw: 透過繪製節點的覆疊來檢視相機看到的內容

source: Visualize the 2D array of nodes extracted by the [Vision framework](doc://com.apple.documentation/documentation/vision).
de: Visualisiere das 2D-Array der Knoten, das von dem [Vision-Framework](doc://com.apple.documentation/documentation/vision) extrahiert wurde.
es: Visualiza un vector en 2D de los nodos extraídos por la [estructura de Vision](doc://com.apple.documentation/documentation/vision).
es_419: Visualiza el arreglo 2D de nodos extraído por la [estructura Vision](doc://com.apple.documentation/documentation/vision).
fr: Visualise le tableau 2D de nœuds extrait par le [framework Vision](doc://com.apple.documentation/documentation/vision).
it: Visualizza l’array 2D dei nodi estratti dal framework [Vision](doc://com.apple.documentation/documentation/vision).
ja: [Vision framework](doc://com.apple.documentation/documentation/vision)で抽出されたノードの2次元配列を視覚化します。
ko: [Vision framework](doc://com.apple.documentation/documentation/vision)에서 추출한 노드의 2D 배열을 시각화합니다.
nl: Visualiseer de 2D-array met nodes die zijn geëxtraheerd door het [Vision framework](doc://com.apple.documentation/documentation/vision).
no: Visualiser den todimensjonale matrisen av noder som [Vision-rammeverket](doc://com.apple.documentation/documentation/vision) henter.
pt: Visualize o vetor 2D dos nós extraídos pelo [Vision framework](doc://com.apple.documentation/documentation/vision).
sv: Visualisera 2D-arrayen med noder som har extraherats av [Vision-ramverket](doc://com.apple.documentation/documentation/vision).
th: แสดงภาพอาร์เรย์ของโหนดแบบ 2D ที่ดึงมาจาก[เฟรมเวิร์ค Vision](doc://com.apple.documentation/documentation/vision)
tr: [Vision framework’ün](doc://com.apple.documentation/documentation/vision) seçip çıkardığı düğümlerin 2B dizisini görselleştir.
vi: Trực quan hóa dãy 2D gồm các node được [chương trình khung Vision](doc://com.apple.documentation/documentation/vision) trích xuất.
zh_cn: 可视化 [Vision 框架](doc://com.apple.documentation/documentation/vision)提取的二维节点数组。
zh_tw: 視覺化由 [Vision Framework](doc://com.apple.documentation/documentation/vision) 擷取的 2D 節點陣列。

source: Before you start debugging your model, it’s helpful to get more insight into the data your model uses to generate its predictions.
de: Bevor du mit dem Debuggen deines Modells beginnst, ist es hilfreich, dir die Daten genauer anzuschauen, die das Modell zum Erstellen seiner Vorhersagen verwendet.
es: Antes de empezar a depurar el modelo, te será de utilidad tener más información sobre los datos que usa el modelo para hacer las predicciones.
es_419: Antes de empezar a depurar tu modelo, sería de utilidad obtener más detalles sobre los datos que usa el modelo para generar las predicciones.
fr: Avant de commencer à déboguer ton modèle, il est utile d’obtenir plus d’informations sur les données que ton modèle utilise pour générer ses prédictions.
it: Prima di iniziare il debug del modello, è utile farsi un’idea più approfondita dei dati che esso utilizza per generare le proprie previsioni.
ja: モデルのデバッグを始める前に、モデルが予測の生成に使用するデータをもっと深く知っておくとよいでしょう。
ko: 모델 디버깅을 시작하기 전에 모델이 예측을 생성하는 데 사용하는 데이터에 관해 더 많은 통찰력을 얻는 것이 좋습니다.
nl: Voordat je begint met het opsporen van fouten in je model, is het nuttig om meer inzicht te krijgen in de gegevens die je model gebruikt om voorspellingen te genereren.
no: Før du begynner å feilsøke modellen, er det nyttig å få mer innsikt om dataene som modellen bruker til å generere prediksjonene.
pt: Antes de começar a depurar o modelo, é útil obter mais informações sobre os dados que o modelo usa para gerar previsões.
sv: Innan du börjar felsöka modellen är det bra om du skaffar dig en större insikt om de data som modellen använder till att skapa sina förutsägelser.
th: ก่อนที่คุณจะเริ่มแก้บั๊กโมเดลของคุณ การรับข้อมูลเชิงลึกเกี่ยวกับข้อมูลที่โมเดลของคุณใช้เพื่อสร้างการคาดคะเนเป็นสิ่งที่มีประโยชน์มาก
tr: Modelindeki hataları ayıklamaya başlamadan önce modelinin tahminlerini oluşturmak için kullandığı verilerle ilgili daha fazla ayrıntı öğrenmek yararlı olur.
vi: Trước khi bắt đầu gỡ lỗi mô hình của mình, sẽ hữu ích nếu bạn tìm hiểu sâu hơn về dữ liệu mà mô hình của bạn sử dụng để đưa ra các dự đoán.
zh_cn: 在你开始调试模型前，深入了解模型用于生成预测的数据是很有帮助的。
zh_tw: 在你開始為模型除錯之前，深入瞭解模型用來產生預測的資料會很有幫助。

source: To do this, you’ll visualize the 2D array of nodes generated by the [Vision framework](doc://com.apple.documentation/documentation/vision) when it interprets image data. The nodes you visualize map to the joints on your hand. ✋
de: Dafür visualisierst du das 2D-Knoten-Array, das von dem [Vision-Framework](doc://com.apple.documentation/documentation/vision) beim Interpretieren der Bilddaten erstellt wird. Die von dir visualisierten Knoten sind den Gelenken in deiner Hand zugeordnet. ✋
es: Para hacerlo, visualiza el vector en 2D de los nodos generados por la [estructura de Vision framework](doc://com.apple.documentation/documentation/vision) cuando interpreta los datos de las imágenes. Los nodos que visualices se asignan a las articulaciones de la mano. ✋
es_419: Para hacerlo, visualiza el arreglo 2D de nodos que genera la [estructura Vision](doc://com.apple.documentation/documentation/vision) cuando interpreta los datos de las imágenes. Los nodos que visualices se mapean a las articulaciones de la mano. ✋
fr: Pour ce faire, tu visualiseras le tableau 2D de nœuds généré par le [framework Vision](doc://com.apple.documentation/documentation/vision) lorsqu’il interprète les données d’image. Les nœuds que tu visualises correspondent aux articulations de ta main. ✋
it: Per farlo, visualizzerai l’array 2D dei nodi generati dal framework [Vision](doc://com.apple.documentation/documentation/vision) quando interpreta i dati immagine. I nodi che visualizzi corrispondono alle articolazioni della tua mano. ✋
ja: そのためには、[Vision framework](doc://com.apple.documentation/documentation/vision)がイメージデータを解釈するときに生成されるノードの2次元配列を視覚化します。視覚化されたノードは手の関節に対応します。✋
ko: 이를 위해 이미지 데이터를 해석할 때 [Vision framework](doc://com.apple.documentation/documentation/vision)에서 생성된 노드의 2D 배열을 시각화합니다. 시각화된 노드는 손의 관절에 매핑됩니다. ✋
nl: Om dit te doen, visualiseer je een 2D-array met nodes die zijn aangemaakt door het [Vision framework](doc://com.apple.documentation/documentation/vision) tijdens het interpreteren van afbeeldingsgegevens. De nodes die je visualiseert, corresponderen met de gewrichten van je hand. ✋
no: Det gjør du ved å visualisere den todimensjonale matrisen med noder som genereres av [Vision-rammeverket](doc://com.apple.documentation/documentation/vision) når det tolker bildedata. Nodene som du visualiserer, kobles til leddene i hånden din. ✋
pt: Para fazer isso, você visualizará o vetor 2D dos nós gerados pelo [Vision framework](doc://com.apple.documentation/documentation/vision) quando ele interpreta os dados das imagens. Os nós visualizados mapeiam as articulações da mão. ✋
sv: Du gör det genom att visualisera 2D-arrayen med noder som skapas av [Vision-ramverket](doc://com.apple.documentation/documentation/vision) när den tolkar bilddata. Noderna som visualiseras kopplas till lederna på handen. ✋
th: ในการทำเช่นนี้ คุณจะแสดงภาพอาร์เรย์ของโหนด 2D ที่สร้างโดย[เฟรมเวิร์ค Vision](doc://com.apple.documentation/documentation/vision) เมื่อเฟรมเวิร์คตีความข้อมูลภาพ โหนดที่คุณแสดงภาพจะแมปส่วนเชื่อมต่อบนมือของคุณ ✋
tr: Bunu yapmak için [Vision framework’ün](doc://com.apple.documentation/documentation/vision) görüntü verilerini yorumlarken oluşturduğu düğümlerin 2B dizisini görselleştireceksin. Görselleştirdiğin düğümler elindeki eklemlerle eşlenir. ✋
vi: Để thực hiện việc này, bạn sẽ trực quan hóa dãy 2D gồm các node mà [chương trình khung Vision](doc://com.apple.documentation/documentation/vision) tạo ra khi diễn giải dữ liệu hình ảnh. Các node mà bạn trực quan hóa sẽ ánh xạ các khớp trên bàn tay của bạn. ✋
zh_cn: 如果要这么做，你需要可视化 [Vision 框架](doc://com.apple.documentation/documentation/vision)解译图像数据时生成的二维节点数组。可视化的节点会映射到你手上的关节。✋
zh_tw: 為此，你將在解譯影像資料時視覺化由 [Vision Framework](doc://com.apple.documentation/documentation/vision) 產生的 2D 節點陣列。你所視覺化的節點會對應到你手上的關節。✋

source: To create this visualization you’ll take the `MLMultiArray` that Vision extracts from an image frame and transform it into coordinates overlayed on top of your camera’s viewfinder.
de: Um diese Visualisierung zu erstellen, konvertierst du das mit `MLMultiArray` erstellte Array, das von Vision aus einem Bildrahmen extrahiert wurde, in Koordinaten. Diese werden dann über den Sucher der Kamera gelegt.
es: Para crear esta visualización, tomarás el vector `MLMultiArray` que Vision extrae de un marco de imagen y lo transforma en coordenadas que superpone al visor de la cámara.
es_419: Para crear esta visualización, debes tomar el arreglo `MLMultiArray` que Vision extrae de un cuadro de imagen y transformarlo en coordenadas sobrepuestas en el visor de la cámara.
fr: Pour créer cette visualisation, tu vas prendre le `MLMultiArray` que Vision extrait d’une image et le transformer en coordonnées superposées au-dessus du viseur de ton appareil photo.
it: Per creare la visualizzazione, prenderai l’array `MLMultiArray` che Vision estrae dall’inquadratura di un’immagine e lo trasformerai in coordinate sovrapposte al mirino della fotocamera.
ja: この視覚化を作成するには、Visionがイメージフレームから抽出した`MLMultiArray`を座標に変換し、カメラのファインダーに重ねて（オーバーレイして）表示します。
ko: 이 시각화를 생성하려면 Vision이 이미지 프레임에서 추출한 `MLMultiArray`를 카메라 뷰파인더 위에 겹쳐진 좌표로 변환해야 합니다.
nl: Om deze visualisatie aan te maken, gebruik je de `MLMultiArray` die het Vision-framework uit een afbeelding extraheert en zet je deze array om in coördinaten die als overlay over de zoeker van je camera worden gelegd.
no: For å lage denne visualiseringen tar du `MLMultiArray`, som Vision henter fra et bilde, og forvandler den til koordinater som legges oppå søkeren.
pt: Para criar essa visualização, você usará o `MLMultiArray` que o framework Vision extrai de um quadro de imagem e transforma em coordenadas sobrepostas ao visor da câmera.
sv: För att skapa den här visualiseringen tar du `MLMultiArray` som Vision extraherar från en bildruta och omvandlar den till koordinater som läggs över kamerasökaren.
th: ในการสร้างการแสดงภาพนี้ คุณจะได้นำ `MLMultiArray` ที่ Vision ดึงมาจากเฟรมภาพ และเปลี่ยนให้เป็นพิกัดที่ทับซ้อนอยู่ที่ด้านบนสุดของช่องมองภาพของกล้องของคุณ
tr: Bu görselleştirmeyi yaratmak için Vision’ın bir görüntü karesinden seçip çıkardığı `MLMultiArray`’i alıp kamera vizörünün üstüne yerleştirilmiş bir katmandaki koordinatlara dönüştüreceksin.
vi: Để tạo ra hình ảnh trực quan này, bạn sẽ sử dụng `MLMultiArray` mà Vision trích xuất từ một khung hình ảnh và biến đổi thành các tọa độ được phủ lên trên kính ngắm của camera.
zh_cn: 为了创建这种可视化，你将使用 Vision 从图像帧中提取的 `MLMultiArray`，将它转换为叠加在摄像头取景器上的坐标。
zh_tw: 為了製作這樣的視覺化，你要取用 Vision 從影像影格中擷取的 `MLMultiArray`，並將其轉換為覆蓋在相機觀景窗上方的座標。

source: Add this [overlay](doc://com.apple.documentation/documentation/SwiftUI/View/overlay(alignment:content:)) to your `ViewFinderView` code to show the node visualization when `showNodes` is `true`:
de: Füge diese [Überlagerung](doc://com.apple.documentation/documentation/SwiftUI/View/overlay(alignment:content:)) zum `ViewFinderView`-Code hinzu, um die Visualisierung der Knoten anzuzeigen, wenn `showNodes` (Knoten anzeigen) den Wert `true` (wahr) hat:
es: Añade esta [superposición](doc://com.apple.documentation/documentation/SwiftUI/View/overlay(alignment:content:)) al código de `ViewFinderView` para mostrar la visualización de nodos cuando la propiedad `showNodes` es `true` (verdadera):
es_419: Agrega esta [sobreposición](doc://com.apple.documentation/documentation/SwiftUI/View/overlay(alignment:content:)) al código de `ViewFinderView` para mostrar la visualización de nodos cuando `showNodes` (mostrar nodos) sea `true`:
fr: Ajoute cette [superposition](doc://com.apple.documentation/documentation/SwiftUI/View/overlay(alignment:content:)) à ton code `ViewFinderView` pour afficher la visualisation des nœuds lorsque `showNodes` est `true` :
it: Aggiungi questa [sovrapposizione](doc://com.apple.documentation/documentation/SwiftUI/View/overlay(alignment:content:)) al codice di `ViewFinderView` per mostrare la visualizzazione dei nodi quando `showNodes` è `true`:
ja: この[overlay](doc://com.apple.documentation/documentation/SwiftUI/View/overlay(alignment:content:))（オーバーレイ）を`ViewFinderView`コードに追加して、`showNodes`が`true`の場合にノードの視覚化を表示します:
ko: 이 [overlay](doc://com.apple.documentation/documentation/SwiftUI/View/overlay(alignment:content:))를 `ViewFinderView` 코드에 추가하여 `showNodes`가 `true`일 때 노드 시각화를 표시합니다.
nl: Voeg deze [overlay](doc://com.apple.documentation/documentation/SwiftUI/View/overlay(alignment:content:)) aan je `ViewFinderView`-code toe om de visualisatie van de nodes weer te geven wanneer `showNodes` de waarde `true` heeft:
no: Legg til dette [overlegget](doc://com.apple.documentation/documentation/SwiftUI/View/overlay(alignment:content:)) i `ViewFinderView`-koden for å vise visualiseringen av noden når `showNodes` er `true`:
pt: Adicione esse [overlay](doc://com.apple.documentation/documentation/SwiftUI/View/overlay(alignment:content:)) ao código em `ViewFinderView` para mostrar a visualização do nó quando `showNodes` for `true`:
sv: Lägg till det här [överlägget](doc://com.apple.documentation/documentation/SwiftUI/View/overlay(alignment:content:)) i koden för `ViewFinderView` för att visa nodvisualiseringen när `showNodes` är `true`:
th: เพิ่ม[การซ้อนทับ](doc://com.apple.documentation/documentation/SwiftUI/View/overlay(alignment:content:))นี้ ไปยังโค้ด `ViewFinderView` ของคุณเพื่อแสดงการแสดงภาพโหนดเมื่อ `showNodes` เป็น `true`:
tr: `showNodes` değeri `true` iken düğüm görselleştirmeyi göstermek için bu [katmanı](doc://com.apple.documentation/documentation/SwiftUI/View/overlay(alignment:content:)) `ViewFinderView` koduna ekle:
vi: Thêm [lớp phủ](doc://com.apple.documentation/documentation/SwiftUI/View/overlay(alignment:content:)) này vào mã `ViewFinderView` của bạn để hiển thị hình ảnh trực quan của node khi `showNodes` là `true`:
zh_cn: 将这个[叠层](doc://com.apple.documentation/documentation/SwiftUI/View/overlay(alignment:content:))添加到 `ViewFinderView`（取景器视图）代码中，来在 `showNodes`（显示节点）为 `true`（真）时显示节点可视化：
zh_tw: 將這個 [overlay](doc://com.apple.documentation/documentation/SwiftUI/View/overlay(alignment:content:)) 加入你的 `ViewFinderView` 程式碼中，來在 `showNodes` 為 `true` 時將節點視覺化：

source: After adding the code snippet, try placing your hand in front of the camera and notice how the nodes map onto it:
de: Nachdem du den Codeabschnitt hinzugefügt hast, halte deine Hand vor die Kamera und sieh dir an, wie die Knoten deiner Hand zugeordnet werden:
es: Después de añadir el fragmento de código, prueba a colocar la mano frente a la cámara y observa cómo se asignan los nodos a ella:
es_419: Después de agregar el fragmento de código, intenta colocar tu mano frente a la cámara y observa cómo se le mapean los nodos:
fr: Après avoir ajouté l’extrait de code, essaie de placer ta main devant l’appareil photo et observe de quelle manière les nœuds se représentent sur celle-ci :
it: Dopo aver aggiunto il frammento di codice, prova a posizionare la mano davanti alla fotocamera e osserva in che modo i nodi vengono fatti corrispondere:
ja: コードスニペットを追加したら、カメラの前に手を出して、ノードがそれに合わせて動くのを見てみましょう:
ko: 코드 스니펫을 추가한 후 카메라 앞에 손을 놓고 노드가 그 위로 어떻게 매핑되는지 확인합니다.
nl: Nadat je het codefragment hebt toegevoegd, kun je je hand voor de camera houden om te zien hoe de nodes erop worden weergegeven:
no: Når du har lagt til kodesnutten, kan du prøve å holde hånden foran kameraet. Legg merke til hvordan nodene kobles til den:
pt: Depois de adicionar o fragmento de código, tente colocar a mão na frente da câmera e repare como os nós são mapeados sobre ela:
sv: Prova att placera handen framför kameran när du har lagt till kodsnutten. Lägg märke till hur noderna kopplas till handen:
th: หลังจากเพิ่มส่วนย่อยของโค้ด ให้ลองวางมือของคุณด้านหน้ากล้องแล้วสังเกตวิธีที่โหนดแมปไปยังมือ:
tr: Kod parçacığını ekledikten sonra elini kameranın önüne koymayı dene ve düğümlerin elinle nasıl eşlendiğine dikkat et:
vi: Sau khi thêm đoạn mã, hãy thử đặt bàn tay của bạn ở phía trước camera và lưu ý cách các node ánh xạ lên trên đó:
zh_cn: 添加代码片段后，试着将你的手放在摄像头前，然后注意节点是如何映射到手上的：
zh_tw: 加入程式碼片段後，嘗試將你的手放在相機前並注意節點如何對應到它：

source: Are the nodes accurate? Do they map to the joints in your hand?
de: Sind die Knoten korrekt? Sind sie deinen Gelenken in der Hand zugeordnet?
es: ¿Son precisos los modos? ¿Se asignan correctamente a las articulaciones de la mano?
es_419: ¿Son precisos los nodos? ¿Se mapean a las articulaciones de tu mano?
fr: Les nœuds sont-ils précis ? Correspondent-ils aux articulations de ta main ?
it: I nodi sono accurati? Vengono fatti corrispondere alle articolazioni della mano?
ja: ノードは正確ですか? 手の関節に対応していますか?
ko: 노드가 정확한가요? 손의 관절에 매핑되나요?
nl: Zijn de nodes juist? Corresponderen ze met de gewrichten in je hand?
no: Er nodene nøyaktige? Kobles de til leddene i hånden?
pt: Os nós estão precisos? Eles mapeiam as articulações da mão?
sv: Stämmer noderna? Kopplas de till lederna på handen?
th: โหนดแม่นยำหรือไม่ สามารถแมปส่วนเชื่อมต่อในมือของคุณได้หรือไม่
tr: Düğümler doğru mu? Bunlar elindeki eklemlerle eşleşiyor mu?
vi: Các node có chính xác không? Chúng có ánh xạ đến các khớp trên bàn tay của bạn không?
zh_cn: 这些节点准确吗？它们有映射到你的手关节上吗？
zh_tw: 這些節點準確嗎？它們有對應到你的手部關節嗎？
