Repository: JulioPr0/ml-rock-paper-scissors
Catalog: Rock, Paper, Scissors game with ML.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: During the training session, you’ll see some metrics in the console. Open the console by tapping the button in the bottom-left corner over your source editor and read through the processing metrics to get a better idea of how the model trains itself and tests its accuracy.
de: Während der Trainingssitzung siehst du einige Metriken in der Konsole. Öffne die Konsole, indem du links unten über dem Source Editor auf die Taste tippst, und lies die Prozessmetriken, um besser zu verstehen, wie sich das Modell selbst trainiert und seine Genauigkeit testet.
es: Durante la sesión de entrenamiento, verás algunos datos de medición en la consola. Abre la consola tocando el botón de la esquina inferior izquierda del editor de código y lee las mediciones de procesamiento para tener una idea más precisa de cómo se entrena a sí mismo el modelo y prueba su precisión.
es_419: Durante la sesión de entrenamiento, verás algunas estadísticas en la consola. Toca el botón de la esquina inferior izquierda sobre el editor de código fuente para abrir la consola y consultar las estadísticas de procesamiento; esto te permitirá entender mejor cómo se entrena el modelo y cómo se prueba su precisión.
fr: Pendant la session d’entraînement, tu verras des mesures dans la console. Touche le bouton dans l’angle inférieur gauche au-dessus de ton éditeur de source pour ouvrir la console et lis les mesures de traitement pour avoir une meilleure idée de la manière dont le modèle s’entraîne et teste sa précision.
it: Durante la sessione di addestramento, nella console verranno mostrate alcune metriche. Apri la console toccando il pulsante nell’angolo in basso a sinistra nell’editor della sorgente e leggi le metriche di elaborazione per farti un’idea migliore del modo in cui il modello si addestra e testa la propria accuratezza.
ja: 学習セッション中には、コンソールにいくつかの指標が表示されます。ソースエディタの上の左下隅のボタンをタップしてコンソールを開き、処理指標を一通り読んで、モデルの学習方法と正確性の検証方法をさらに深く理解しましょう。
ko: 훈련 세션 중에 콘솔에 몇 가지 척도가 표시됩니다. 소스 편집기 위의 왼쪽 하단 모서리에 있는 버튼을 탭하여 콘솔을 열고 프로세싱 척도를 읽어 모델이 스스로 학습하고 정확도를 테스트하는 방법에 관한 더 좋은 아이디어를 얻을 수 있습니다.
nl: Tijdens de trainingssessie worden er meetwaarden in de console weergegeven. Open de console door op de knop in de linkerbenedenhoek van de broneditor te tikken en bekijk de verwerkingswaarden om inzicht te krijgen in de manier waarop het model zichzelf traint en de eigen betrouwbaarheid test.
no: Under treningsøkten ser du noen målinger i konsollen. Åpne konsollen ved å trykke på knappen nederst til venstre i kilderedigereren, og les gjennom målingene fra behandlingen for å få en bedre forståelse av hvordan modellen trener seg selv og tester nøyaktigheten.
pt: Durante a sessão de treinamento, você verá algumas métricas no console. Para abri‑lo, toque no botão no canto inferior esquerdo sobre o editor de fonte e leia as métricas de processamento para entender melhor como o modelo se treina e testa sua precisão.
sv: Under träningssessionen ser du några mätningar i konsolen. Öppna konsolen genom att trycka på knappen i det nedre vänstra hörnet ovanpå källredigeraren och läs igenom bearbetningsmätningarna för att få en bättre förståelse av hur modellen tränar sig själv och testar sin träffsäkerhet.
th: ระหว่างเซสชั่นการฝึก คุณจะเห็นการวัดอยู่ในจอคอนโซล ให้เปิดจอคอนโซลโดยแตะปุ่มที่มุมซ้ายล่างสุดเหนือตัวแก้ไขต้นฉบับของคุณ แล้วอ่านการวัดกระบวนการแบบผ่านๆ เพื่อให้ได้แนวคิดที่ดีขึ้นเกี่ยวกับวิธีฝึกตัวเองและทดสอบความแม่นยำของโมเดล
tr: Eğitim oturumu sırasında konsolda bazı ölçümler görürsün. Kaynak düzenleyicinin sol alt köşesindeki düğmeye dokunarak konsolu aç ve modelin kendini nasıl eğittiği ve doğruluğunu test ettiği ile ilgili daha iyi bir fikir sahibi olmak için işlem ölçümlerini gözden geçir.
vi: Trong phiên huấn luyện, bạn sẽ nhìn thấy một vài số liệu trong bảng điều khiển. Mở bảng điều khiển bằng cách chạm vào nút ở góc dưới cùng bên trái phía trên trình sửa nguồn của bạn và đọc qua các số liệu xử lý để hiểu rõ hơn về cách mô hình tự huấn luyện và kiểm tra độ chính xác của mô hình.
zh_cn: 训练会话期间，控制台会显示一些指标。轻点源编辑器左下角的按钮来打开控制台，通读处理指标，来更好地了解模型如何自我训练并测试自己的准确性。
zh_tw: 在訓練階段期間，你將在主控台中看到一些指標。點按資源編輯器左下角的按鈕來打開主控台，並且透過讀取處理指標，更進一步地瞭解模型如何自我訓練和測試其準確性。

source: After the training session finishes, and you’ve saved the model, it’s time to test your model as part of a real Rock, Paper, Scissors game!
de: Nachdem die Trainingssitzung abgeschlossen ist und du das Modell gesichert hast, ist es an der Zeit, dein Modell als Bestandteil eines echten „Schere, Stein, Papier“-Spiels zu testen!
es: Una vez terminada la sesión de entrenamiento y después de haber guardado el modelo, es el momento de probarlo como parte de un juego de verdad de “Piedra, papel o tijera“.
es_419: Una vez que termine la sesión de entrenamiento y que guardes el modelo, será momento de probarlo como parte de un juego real de Piedra, papel o tijeras.
fr: Lorsque la session d’entraînement est terminée et que tu as enregistré le modèle, il est temps de tester ce dernier dans le cadre d’un vrai jeu Pierre, papier, ciseaux !
it: Una volta che la sessione di addestramento sarà finita e dopo aver salvato il modello, è il momento di testarlo in una vera partita di Sasso, carta, forbici!
ja: 学習セッションが終わってモデルを保存したら、実際のじゃんけんゲームの一部としてモデルを検証してみましょう!
ko: 훈련 세션이 끝나고 모델을 저장하고 나면 실제 가위, 바위, 보 게임의 일부로 모델을 테스트해 볼 차례입니다!
nl: Als de trainingssessie is afgelopen en je het model hebt bewaard, is het tijd om je model te testen als onderdeel van een echte Steen, papier, schaar-game!
no: Når treningsøkten er fullført og du har arkivert modellen, er det på tide å teste modellen i en ekte runde med stein, saks, papir!
pt: Depois que a sessão de treinamento terminar e você salvar o modelo, será hora de testá‑lo como parte de um jogo de Pedra, Papel e Tesoura de verdade!
sv: När träningssessionen avslutas, och du har sparat modellen, är det dags att testa modellen som en del av ett riktigt Sten, sax, påse-spel!
th: หลังจากเซสชั่นการฝึกเสร็จสิ้นและคุณบันทึกโมเดลแล้ว ก็ถึงเวลาทดสอบโมเดลของคุณในฐานะส่วนหนึ่งของเกมเป่ายิ้งฉุบที่แท้จริง!
tr: Eğitim oturumu bittikten ve siz modeli kaydettikten sonra sıra modelini gerçek bir Taş, Kâğıt, Makas oyununda test etmeye geldi!
vi: Sau khi phiên huấn luyện kết thúc và bạn đã lưu mô hình, đã đến lúc kiểm tra mô hình của bạn như một phần của trò chơi Kéo Búa Bao thực sự!
zh_cn: 训练会话完成并存储模型后，是时候把它放在真正的“石头剪刀布”游戏中进行测试了！
zh_tw: 訓練階段結束並保存模型後，就可以做為真正的「剪刀、石頭、布」遊戲的一部分來測試你的模型了！

source: Integrate your ML model into the game
de: ML-Modell in das Spiel integrieren
es: Integrar en el juego el modelo de ML
es_419: Integrar el modelo de ML en el juego
fr: Intégrer ton modèle d’apprentissage automatique au jeu
it: Integrare il modello di apprendimento automatico nel gioco
ja: 機械学習モデルをゲームに統合する
ko: ML 모델을 게임으로 통합하기
nl: Het ML-model in de game integreren
no: Integrer maskinlæringsmodellen din i spillet
pt: Integre o modelo de AM ao jogo
sv: Integrera maskininlärningsmodellen i spelet
th: รวมโมเดล ML ของคุณเข้าในเกม
tr: Makine öğrenimi modelini oyuna entegre etme
vi: Tích hợp mô hình ML của bạn vào trò chơi
zh_cn: 将你的机器学习模型整合到游戏中
zh_tw: 將你的 ML 模型整合到遊戲中

source: Test your model in real time!
de: Teste dein Modell in Echtzeit!
es: Prueba el modelo en tiempo real.
es_419: Prueba tu modelo en tiempo real.
fr: Teste ton modèle en temps réel !
it: Testa il tuo modello in tempo reale!
ja: モデルをリアルタイムで検証しましょう!
ko: 모델을 실시간으로 테스트해 보세요!
nl: Test je model in realtime!
no: Prøv modellen din i sanntid!
pt: Teste o modelo em tempo real!
sv: Testa modellen i realtid!
th: ทดสอบโมเดลของคุณแบบเรียลไทม์!
tr: Modelini gerçek zamanlı olarak test et!
vi: Kiểm tra mô hình của bạn trong thời gian thực!
zh_cn: 实时测试你的模型！
zh_tw: 即時測試你的模型！

source: To test your ML model, swap out your regular game of Rock, Paper, Scissors with one that uses machine learning to identify the hand pose you use.
de: Ersetze zum Testen deines ML-Modells dein reguläres „Schere, Stein, Papier“-Spiel durch eines, das maschinelles Lernen nutzt, um die gezeigte Handgeste zu identifizieren.
es: Para probar el modelo de ML, cambia tu manera normal de jugar a “Piedra, papel o tijera” por otra que use el aprendizaje automático para identificar las posturas de las manos que sueles poner.
es_419: Para probar tu modelo de ML, cambia tu juego normal de Piedra, papel o tijeras por uno que use aprendizaje automático para identificar la pose de mano que uses.
fr: Pour tester ton modèle d’apprentissage automatique, remplace ton jeu Pierre, papier, ciseaux ordinaire par un autre qui utilise l’apprentissage automatique pour identifier la position de ta main.
it: Per testare il tuo modello di apprendimento automatico, scambia il tuo regolare gioco Sasso, carta, fobici con uno che usa l’apprendimento automatico per identificare la posa che usi nella mano.
ja: 機械学習モデルを検証するために、通常のじゃんけんゲームから、あなたの手の形を識別する機械学習を使ったゲームに替えてみましょう。
ko: ML 모델을 테스트하려면 보편화된 가위, 바위, 보 게임을 기계 학습을 사용하여 손 포즈를 식별하는 게임으로 바꿔보세요.
nl: Om je ML-model te testen, vervang je de normale Steen, papier, schaar-game door een versie die machinelearning gebruikt om het handgebaar te herkennen dat je gebruikt.
no: Du kan teste maskinlæringsmodellen din ved å bytte ut det vanlige stein, saks, papir-spillet med et som bruker maskinlæring til å identifisere tegnet du viser.
pt: Para testar o modelo de AM, troque o jogo normal de Pedra, Papel e Tesoura pela versão que usa aprendizado de máquina para identificar o sinal que você faz com a mão.
sv: Du kan testa maskininlärningsmodellen genom att byta ut ditt vanliga Sten, sax, påse-spel mot ett som använder maskininlärning till att identifiera de handgester du använder.
th: ในการทดสอบโมเดล ML ของคุณ ให้สลับเกมเป่ายิ้งฉุบปกติกับเกมที่ใช้การเรียนรู้ของเครื่องเพื่อระบุท่าทางมือที่คุณใช้
tr: Makine öğrenimi modelini test etmek için normal Taş, Kâğıt, Makas oyununu, kullandığın el pozunu belirlemek için makine öğrenimini kullanan oyunla değiştir.
vi: Để kiểm tra mô hình ML của bạn, hãy hoán đổi trò chơi Kéo Búa Bao thông thường của bạn với một trò chơi sử dụng công nghệ học máy để nhận dạng tư thế bàn tay mà bạn sử dụng.
zh_cn: 如果要测试你的机器学习模型，可以将常规的“石头剪刀布”游戏换成使用机器学习识别所用手势的版本。
zh_tw: 若要測試你的 ML 模型，請將正常的「剪刀、石頭、布」遊戲替換為使用機器學習來辨識你使用手勢的遊戲。

source: Replace the existing `GameView.environmentObject(appModel)` with the following code:
de: Ersetze die vorhandene Instanz von `GameView.environmentObject(appModel)` durch den folgenden Code:
es: Sustituye `GameView.environmentObject(appModel)` por el código siguiente:
es_419: Reemplaza `GameView.environmentObject(appModel)` con el siguiente código:
fr: Remplace le `GameView.environmentObject(appModel)` existant par le code suivant :
it: Sostituisci la porzione `GameView.environmentObject(appModel)` con il seguente codice:
ja: 既存の`GameView.environmentObject(appModel)`を以下のコードと置き換えます:
ko: 기존 `GameView.environmentObject(appModel)`를 다음 코드로 대치하세요.
nl: Vervang de bestaande `GameView.environmentObject(appModel)` door de volgende code:
no: Bytt ut `GameView.environmentObject(appModel)` med denne koden:
pt: Substitua o `GameView.environmentObject(appModel)` existente pelo seguinte código:
sv: Ersätt befintlig `GameView.environmentObject(appModel)` med följande kod:
th: แทนที่`GameView.environmentObject(appModel)`ที่มีอยู่ด้วยโค้ดต่อไปนี้:
tr: Var olan `GameView.environmentObject(appModel)` kodunu şu kodla değiştir:
vi: Thay thế `GameView.environmentObject(appModel)` hiện có bằng mã sau đây:
zh_cn: 使用下面的代码替换现有的 `GameView.environmentObject(appModel)`：
zh_tw: 使用下方程式碼來取代現有的 `GameView.environmentObject(appModel)`：

source: Make sure you delete the existing highlighted `GameView()` code, or you’ll see more than one window showing the game.
de: Stelle sicher, dass du den bereits vorhandenen und hervorgehobenen `GameView()`-Code löschst. Ansonsten siehst du mehrere Fenster, die das Spiel anzeigen.
es: Asegúrate de eliminar el código resaltado `GameView()` porque, de lo contrario, aparecerá más de una ventana de juego.
es_419: Asegúrate de eliminar el código de `GameView()` resaltado, o terminarás con más de una ventana mostrando el juego.
fr: N’oublie pas de supprimer le code `GameView()` existant en surbrillance. Sinon, tu verras plusieurs fenêtres affichant le jeu.
it: Assicurati di eliminare il codice `GameView()` esistente evidenziato, altrimenti vedrai più di una finestra che mostra il gioco.
ja: 強調表示された既存の`GameView()`コードは必ず削除してください。削除しないと、ゲームを表示するウインドウが複数表示されてしまいます。
ko: 하이라이트된 기존 `GameView()` 코드를 삭제해야 합니다. 그렇지 않으면 게임을 표시하는 윈도우가 두 개 이상 나타납니다.
nl: Zorg dat je de bestaande gemarkeerde `GameView()`-code verwijdert, anders zie je meer dan één gamevenster.
no: Du må slette den markerte `GameView()`-koden. Hvis ikke vil det vises flere vinduer med spillet.
pt: Lembre‑se de apagar o código `GameView()` existente em destaque para não ver mais de uma janela do jogo.
sv: Se till att du raderar den befintliga markerade `GameView()`-koden, annars får du se fler än ett fönster som visar spelet.
th: ตรวจสอบให้แน่ใจว่าคุณลบโค้ด `GameView()` ที่ไฮไลท์ที่มีอยู่ ไม่เช่นนั้นคุณจะเห็นมากกว่าหนึ่งหน้าต่างที่แสดงเกม
tr: Var olan, vurgulanmış `GameView()` kodunu sildiğinden emin ol; aksi takdirde oyunu gösteren birden fazla pencere görürsün.
vi: Đảm bảo rằng bạn xóa mã `GameView()` được tô sáng hiện có hoặc bạn sẽ nhìn thấy nhiều cửa sổ hiển thị trò chơi.
zh_cn: 确保删除了高亮标记的现有 `GameView()`（游戏视图）代码，否则你会看到多个显示游戏的窗口。
zh_tw: 確定你刪除了目前反白顯示的 `GameView()` 程式碼，否則你會看到多個顯示遊戲的視窗。

source: Currently, the Rock, Paper, Scissors game uses the built-in default ML model as its model. To use the one you just created, add this code:
de: Als Modell verwendet das „Schere, Stein, Papier“-Spiel aktuell das integrierte Standard-ML-Modell. Füge den folgenden Code ein, um das gerade von dir erstellte Modell zu verwenden:
es: En este momento, el juego “Piedra, papel o tijera” utiliza como modelo por omisión el modelo de ML integrado. Para usar el que acabas de crear, añade este código:
es_419: De momento, el juego Piedra, papel o tijeras usa el modelo de ML predeterminado que viene integrado. Para usar el que acabas de crear, agrega este código:
fr: Actuellement, le jeu Pierre, papier, ciseaux utilise par défaut le modèle d’apprentissage automatique intégré. Pour utiliser celui que tu viens de créer, ajoute ce code :
it: Attualmente, il gioco Sasso, carta, forbici utilizza il modello di apprendimento automatico integrato di default. Per utilizzare quello appena creato, aggiungi questo codice:
ja: 今は、じゃんけんゲームでは内蔵されたデフォルトの機械学習モデルが使用されています。たった今作成したものを使用するには、以下のコードを追加します:
ko: 현재 가위, 바위, 보 게임은 내장된 기본 ML 모델을 해당 모델로 사용하고 있습니다. 방금 작성한 코드를 사용하려면 다음 코드를 추가하세요.
nl: Momenteel gebruikt de Steen, papier, schaar-game het ingebouwde ML-standaardmodel als model. Om het model te gebruiken dat je zojuist hebt gemaakt, voeg je deze code toe:
no: Stein, saks, papir-spillet bruker den innebygde maskinlæringsmodellen. Legg til denne koden for å bruke maskinlæringsmodellen du nettopp lagde i stedet:
pt: No momento, o jogo Pedra, Papel e Tesoura usa o modelo de AM padrão integrado. Para usar o que você acabou de criar, adicione este código:
sv: För närvarande använder Sten, sax, påse-spelet den inbyggda förvalda maskininlärningsmodellen som sin modell. Lägg till den här koden om du vill använda den du precis skapade:
th: ตอนนี้ เกมเป่ายิ้งฉุบจะใช้โมเดล ML เริ่มต้นเป็นโมเดลของเกม ในการใช้โมเดลที่คุณเพิ่งสร้าง ให้เพิ่มโค้ดนี้:
tr: Şu anda Taş, Kâğıt, Makas oyunu yerleşik, saptanmış makine öğrenimi modelini kendi modeli olarak kullanır. Az önce yarattığını kullanmak için şu kodu ekle:
vi: Hiện tại, trò chơi Kéo Búa Bao sử dụng mô hình ML mặc định tích hợp làm mô hình của trò chơi. Để sử dụng mô hình mà bạn vừa tạo ra, hãy thêm mã này:
zh_cn: “石头剪刀布”游戏当前将内建的默认机器学习模型用作它的模型。如果要使用刚刚创建的模型，你可以添加这些代码：
zh_tw: 目前「剪刀、石頭、布」遊戲使用內建的預設 ML 模型作為其模型。若要使用你剛剛建立的模型，請加入以下程式碼：

source: To activate the Play button, show a hand pose to the camera. If you look in the bottom-right corner of the camera, you’ll see a view where the ML model predicts your move in real time as you move your hand.
de: Zeige eine Handgeste in die Kamera, um die Taste zum Spielen zu aktivieren. Wenn du rechts unten in die Ecke der Kamera schaust, siehst du eine Ansicht, in der das ML-Modell deine Geste in Echtzeit vorhersagt, während du deine Hand bewegst.
es: Para activar el botón y poder jugar, muestra a la cámara una postura de mano. Si miras en la esquina inferior derecha de la cámara, tendrás una vista en la que el modelo de ML predice tu jugada en tiempo real a medida que mueves la mano.
es_419: Para activar el botón Play (jugar), muéstrale una pose de mano a la cámara. Si buscas en la esquina inferior derecha de la cámara, verás una visualización en donde el modelo de ML predice tu movimiento en tiempo real conforme mueves la mano.
fr: Pour activer le bouton Play, montre une position de la main à l’appareil photo. Si tu regardes dans l’angle inférieur droit de l’appareil photo, tu vois une vue dans laquelle le modèle d’apprentissage automatique prédit ton coup en temps réel tandis que tu bouges la main.
it: Per attivare il pulsante Gioca, mostra una posa della mano alla fotocamera. Se guardi nell’angolo in basso a destra della fotocamera, noterai una vista in cui il modello di apprendimento automatico prevede in tempo reale la tua mossa mentre muovi la mano.
ja: “プレイ”ボタンを有効にするには、カメラに手の形を映します。カメラの右下隅を見ると、機械学習モデルがあなたの手の動きに合わせてリアルタイムであなたが出した手を予測します。
ko: 재생 버튼을 활성화하려면 카메라에 손 포즈를 보여주세요. 카메라 오른쪽 하단 모서리에 ML 모델이 손의 움직임에 따라 실시간으로 동작을 예측하는 보기가 나타납니다.
nl: Om de knop 'Play' te activeren, toon je een handgebaar voor de camera. Als je in de rechterbenedenhoek van de camera kijkt, zie je een weergave waarin het ML-model in realtime je zet voorspelt als je je hand beweegt.
no: Aktiver Spill-knappen ved å vise et håndtegn til kameraet. Nederst til høyre i kameraet ser du en visning der maskinlæringsmodellen forutser håndtegnet ditt i sanntid mens du beveger hånden din.
pt: Para ativar o botão Jogar, mostre um sinal com a mão à câmera. Se você olhar no canto inferior direito da câmera, você verá uma visualização onde o modelo de AM prevê o gesto em tempo real conforme você move a mão.
sv: Aktivera knappen Spela genom att visa en handgest för kameran. Om du tittar i det nedre högra hörnet av kameran ser du en vy där maskininlärningsmodellen förutsäger ditt drag i realtid när du rör på handen.
th: ในการเปิดใช้งานปุ่มเล่น ให้แสดงท่าทางมือให้กล้องเห็น ถ้าคุณดูที่มุมขวาล่างสุดของกล้อง คุณจะเห็นมุมมองที่โมเดล ML คาดคะเนท่าของคุณแบบเรียลไทม์ในขณะที่คุณเคลื่อนไหวมือ
tr: Oynat düğmesini etkinleştirmek için kameraya bir el pozu göster. Kameranın sağ alt köşesine bakarsan makine öğrenimi modelinin sen elini hareket ettirdikçe gerçek zamanlı olarak hareketini tahmin ettiği bir görüntü göreceksin.
vi: Để kích hoạt nút Chơi, hãy thể hiện một cử chỉ bàn tay trước camera. Nếu bạn nhìn vào góc dưới cùng bên phải của camera thì bạn sẽ thấy một chế độ xem mà mô hình ML dự đoán nước đi của bạn trong thời gian thực khi bạn di chuyển bàn tay của mình.
zh_cn: 如果要激活“开始”按钮，请对着摄像头做一个手势。如果往摄像头右下角看，你会看到一个视图，其中的机器学习模型在你挥手时实时预测你的动作。
zh_tw: 若要啟用「啟動」按鈕，請向相機展示一個手部姿勢。如果查看相機的右下角，你會看到一個顯示區，其中 ML 模型會在你移動手部的時候，即時預測你的移動。

source: When you’re ready to play, tap Play to lock in your move and the computer generates a move. Have fun and try playing a few games!
de: Wenn du bereit zum Spielen bist, tippe auf „Spielen“, um deinen Spielzug einzuloggen, und der Computer erzeugt ebenfalls einen Spielzug. Viel Spaß beim Ausprobieren!
es: Cuando sea el momento de jugar, toca el botón de reproducción para bloquear el movimiento y el ordenador generará una jugada. Diviértete haciendo unas cuantas jugadas.
es_419: Cuando tengas todo listo, toca Jugar para bloquear el movimiento y que la computadora genere el suyo. Diviértete jugando algunas rondas.
fr: Lorsque tu es prêt à jouer, touche Play pour verrouiller ton coup et l’ordinateur en génère un également. Amuse-toi bien et essaie de faire plusieurs parties !
it: Quando è tutto pronto, tocca Gioca per bloccare la tua mossa e il computer genererà una mossa. Divertiti e prova a fare qualche partita!
ja: プレイする準備ができたら、“プレイ”をタップしてあなたの手を確定すると、コンピュータが手を生成します。何ゲームかプレイして楽しんでみましょう!
ko: 플레이할 준비가 되었을 때 재생을 탭하여 동작을 고정하면 컴퓨터는 하나의 동작을 생성합니다. 재미있게 놀면서 몇 가지 게임을 해보세요!
nl: Wanneer je klaar bent om te spelen, tik je op 'Play' om je zet te selecteren. Vervolgens voert de computer een zet uit. Speel de game een paar keer. Veel plezier!
no: Når du er klar til å spille, trykker du på Spill for å låse tegnet ditt, og deretter velger datamaskinen et tegn. Prøv å spille noen omganger. God fornøyelse!
pt: Quando quiser jogar, toque em Jogar para fixar o seu gesto e o computador gerar outro. Divirta‑se e tente jogar algumas vezes!
sv: När du är redo att spela låser du in ditt drag genom att trycka på Spela så skapar datorn ett drag. Ha det kul och spela några spel!
th: เมื่อคุณพร้อมจะเล่นแล้ว ให้แตะเล่นเพื่อกำหนดท่าของคุณและคอมพิวเตอร์จะสร้างท่า ขอให้สนุกกับการเล่นเกมสองสามรอบนี้!
tr: Oynamaya hazır olduğunda Oyna’ya dokunarak hareketini kilitle; bilgisayar da bir hareket oluşturur. İyi eğlenceler, birkaç oyun oynamayı dene!
vi: Khi bạn đã sẵn sàng chơi, hãy chạm vào Chơi để khóa nước đi của bạn và máy tính tạo ra một nước đi. Chúc bạn vui vẻ và thử chơi một vài ván!
zh_cn: 准备开始游戏时，轻点“开始”来锁定你的动作，电脑将生成一个动作。祝你玩得开心，试着多玩几次游戏！
zh_tw: 當你準備玩遊戲時，點一下「啟動」來鎖定你的動作，電腦就會產生動作。玩得開心點，嘗試玩一些遊戲吧！

source: After you’ve played your ML-based Rock, Paper, Scissors game a few times, try answering the following questions:
de: Nachdem du ein paar Runden deine ML-basierte „Schere, Stein, Papier“-Version gespielt hast, beantworte die folgenden Fragen:
es: Cuando hayas jugado unas partidas con tu juego de “Piedra, papel o tijera” basado en aprendizaje automático, intenta contestar estas preguntas:
es_419: Después de haber jugado tu juego de Piedra, papel o tijeras basado en aprendizaje automático unas cuantas veces, intenta responder estas preguntas:
fr: Lorsque tu as joué plusieurs fois à ton jeu Pierre, papier, ciseaux basé sur l’apprentissage automatique, essaie de répondre aux questions suivantes :
it: Dopo aver provato qualche volta il gioco Sasso, carta, forbici, prova a rispondere alle seguenti domande:
ja: 機械学習ベースのじゃんけんゲームを数回プレイしたら、以下の質問に答えてみましょう:
ko: ML 기반의 가위, 바위, 보 게임을 몇 번 해본 후 다음 질문에 답해 보세요.
nl: Probeer de volgende vragen te beantwoorden nadat je de op machinelearning gebaseerde Steen, papier, schaar-game een paar keer hebt gespeeld:
no: Når du har spilt det maskinlæringsbaserte stein, saks, papir-spillet noen ganger, kan du prøve å svare på disse spørsmålene:
pt: Depois de jogar algumas vezes a versão baseada em AM de Pedra, Papel e Tesoura, tente responder às seguintes perguntas:
sv: Försök att besvara följande frågor när du har spelat ditt maskininlärningsbaserade Sten, sax, påse-spel några gånger:
th: หลังจากคุณเล่นเกมเป่ายิ้งฉุบที่ใช้ ML สองสามรอบ ให้ลองตอบคำถามต่อไปนี้:
tr: Makine Öğrenimi bazlı Taş, Kâğıt, Makas oyununu birkaç kez oynadıktan sonra şu soruları yanıtlamaya çalış:
vi: Sau khi bạn đã chơi trò chơi Kéo Búa Bao dựa trên ML của mình một vài lần, hãy cố gắng trả lời các câu hỏi sau đây:
zh_cn: 玩过几次基于机器学习的“石头剪刀布”游戏后，尝试回答以下问题：
zh_tw: 在你玩了幾次基於機器學習的「剪刀、石頭、布」遊戲後，請嘗試回答以下問題：
