Repository: JulioPr0/ml-rock-paper-scissors
Catalog: Rock, Paper, Scissors game with ML.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: A [data model](glossary://data%20model), called `GameModel`, powers the `RPSGameView`, your Rock, Paper, Scissors game [view](glossary://view) that keeps track of game state, results, your move, and the computer’s move.
de: Ein [Datenmodell](glossary://data%20model) mit dem Namen `GameModel` (Spielmodell) treibt die Spiel[ansicht](glossary://view) `RPSGameView` an. Sie erfasst Spielstatus, Ergebnisse, deine Spielzüge und die des Computers für dein „Schere, Stein, Papier“-Spiel.
es: Un [modelo de datos](glossary://data%20model) llamado `GameModel` es la base de `RPSGameView`, tu [vista](glossary://view) de juego “Piedra, papel o tijera”, que mantiene un seguimiento del estado del juego, de los resultados, de tus jugadas y de las del ordenador.
es_419: El [modelo de datos](glossary://data%20model) `GameModel` (modelo del juego) permite el funcionamiento de la [visualización](glossary://view) `RPSGameView` del juego Piedra, papel o tijeras, en donde se lleva un control del estado del juego, de los resultados y de los movimientos que hacen tú y la computadora.
fr: Un [modèle de données](glossary://data%20model), appelé `GameModel`, alimente le `RPSGameView`, ta [vue](glossary://view) du jeu Pierre, papier, ciseaux qui suit l’état du jeu, les résultats, ton coup et celui de l’ordinateur.
it: Alla base di `RPSGameView`, la [vista](glossary://view) del tuo gioco Sasso, carta, forbici, c’è un [modello di dati](glossary://data%20model), chiamato `GameModel`. Esso tiene traccia dello stato del gioco, dei risultati, della tua mossa e della mossa del computer.
ja: `GameModel`という名前の[データモデル](glossary://data%20model)が`RPSGameView`を動かしています。これはじゃんけんゲームの[ビュー](glossary://view)であり、ゲームの状態、結果、あなたの手、コンピュータの手を管理しています。
ko: `GameModel`이라는 [데이터 모델](glossary://data%20model)은 게임 상태, 결과, 사용자 및 컴퓨터의 동작을 추적하는 가위바위보 게임 [보기](glossary://view)인 `RPSGameView`를 구동합니다.
nl: Een [gegevensmodel](glossary://data%20model) met de naam `GameModel` vormt de basis van `RPSGameView`. Dit is de [weergave](glossary://view) van je Steen, papier, schaar-game waarin de status en de resultaten van de game, plus jouw zet en de zet van de computer worden bijgehouden.
no: [Datamodellen](glossary://data%20model) `GameModel` driver `RPSGameView`, som er [visningen](glossary://view) som holder oversikt over statusen for spillet, resultatene, trekket ditt og datamaskinens trekk når du spiller stein, saks, papir.
pt: Um [modelo de dados](glossary://data%20model), chamado `GameModel`, sustenta `RPSGameView`, a [visualização](glossary://view) do jogo Pedra, Papel e Tesoura que acompanha o estado do jogo, os resultados, o seu movimento e o movimento do computador.
sv: En [datamodell](glossary://data%20model) med namnet `GameModel` driver `RPSGameView` – det är [vyn](glossary://view) som håller reda på spelstatus, resultat, ditt drag och datorns drag för Sten, sax, påse-spelet.
th: [โมเดลข้อมูล](glossary://data%20model)ที่เรียกว่า `GameModel` ทำให้`RPSGameView` ทำงาน ซึ่งเป็น[มุมมอง](glossary://view)เกมเป่ายิ้งฉุบที่คอยติดตามสถานะเกม ผลคะแนน ท่าของคุณ และท่าของคอมพิวเตอร์
tr: Taş, Kâğıt, Makas oyun [görüntün](glossary://view) olan ve oyun durumunu, sonuçları, hareketini ve bilgisayarın hareketini takip eden `RPSGameView`, `GameModel` adında bir [veri modeli](glossary://data%20model) kullanıyor.
vi: Một [mô hình dữ liệu](glossary://data%20model), được gọi là `GameModel`, cung cấp `RPSGameView`, [chế độ xem](glossary://view) trò chơi Kéo Búa Bao có nhiệm vụ theo dõi trạng thái trò chơi, kết quả, nước đi của bạn và nước đi của máy tính.
zh_cn: 名为 `GameModel`（游戏模型）的[数据模型](glossary://data%20model)为 `RPSGameView`（石头剪刀布游戏视图）提供支持，后者是跟踪游戏状态、结果、你的动作和电脑动作的“石头剪刀布”游戏[视图](glossary://view)。
zh_tw: [資料模型](glossary://data%20model)也稱為 `GameModel`，它能為 `RPSGameView` 提供動力，你的「剪刀、石頭、布」遊戲[顯示區](glossary://view)會追蹤遊戲狀態、結果、你的動作和電腦的動作。

source: Next, you’ll set up the logic of the game in `GameModel`.
de: Als Nächstes konfigurierst du in `GameModel` die Spiellogik.
es: Ahora vas a configurar la lógica del juego en `GameModel`.
es_419: A continuación, debes configurar la lógica del juego en `GameModel`.
fr: Ensuite, tu configureras la logique du jeu dans `GameModel`.
it: Nella prossima attività, configurerai la logica del gioco in `GameModel`.
ja: 次に、ゲームのロジックを`GameModel`で設定します。
ko: 이제 `GameModel`에서 게임 로직을 설정하겠습니다.
nl: Je gaat nu de logica van de game in `GameModel` configureren.
no: Nå skal du konfigurere logikken for spillet i `GameModel`.
pt: A seguir, você configurará a lógica do jogo em `GameModel`.
sv: Härnäst ställer du in logiken för spelet i `GameModel`.
th: ถัดไป คุณจะได้ตั้งค่าตรรกะเกมใน `GameModel`
tr: Sonra, oyunun mantığını `GameModel`’da kuracaksın.
vi: Tiếp theo, bạn sẽ thiết lập logic của trò chơi trong `GameModel`.
zh_cn: 下一步，你将在 `GameModel` 中设置游戏的逻辑。
zh_tw: 接下來，你將在 `GameModel` 中設定遊戲的邏輯。

source: The game rules are set inside the `GameModel` [initalizer](glossary://initialization).
de: Die Spielregeln sind in der [Initialisierung](glossary://initialization) von `GameModel` festgelegt.
es: Las reglas del juego se establecen dentro del [inicializador](glossary://initialization) `GameModel`.
es_419: Las reglas del juego se establecen dentro del [inicializador](glossary://initialization) de `GameModel`.
fr: Les règles du jeu sont définies dans l’[initialiseur](glossary://initialization) `GameModel`.
it: Le regole del gioco sono impostate all’interno dell’[inizializzatore](glossary://initialization) di `GameModel`.
ja: ゲームのルールは`GameModel` [初期化子](glossary://initialization)内で設定します。
ko: 게임 규칙은 `GameModel` [이니셜라이저](glossary://initialization) 안에 설정됩니다.
nl: De regels van de game zijn vastgelegd in de [initalizer](glossary://initialization) van `GameModel`.
no: Reglene for spillet konfigureres i `GameModel`-[initialisereren](glossary://initialization).
pt: As regras do jogo são definidas dentro do [inicializador](glossary://initialization) `GameModel`.
sv: Spelreglerna ställs in inuti [initieraren](glossary://initialization) för `GameModel`.
th: กฎของเกมตั้งอยู่ภายใน[ตัวเริ่มต้น](glossary://initialization) `GameModel`
tr: Oyun kuralları, `GameModel` [ilk değer atayıcısının](glossary://initialization) içinde belirlenir.
vi: Các quy tắc trò chơi được đặt bên trong [trình khởi tạo](glossary://initialization) `GameModel`.
zh_cn: 游戏规则在 `GameModel` [构造器](glossary://initialization)内设定。
zh_tw: 遊戲的規則是在 `GameModel` [初始化程式](glossary://initialization)中設定的。

source: Take a second to look through this code. Can you predict what each line of code does?
de: Nimm dir einen Moment Zeit und schau dir den Code an. Hast du eine Idee, was die jeweiligen Codezeilen bewirken?
es: Dedica un momento a repasar este código. ¿Puedes predecir qué hace cada línea del código?
es_419: Tómate un momento para revisar este código. ¿Puedes predecir qué hace cada línea de código?
fr: Prends une seconde pour regarder ce code. Peux-tu prévoir ce que fait chaque ligne de code ?
it: Prenditi un minuto per osservare il codice. Riesci a prevedere cosa fa ciascuna riga di codice?
ja: 少し時間を取ってコードを読み通してみましょう。それぞれの行が何をするか予測できますか?
ko: 잠시 이 코드를 살펴보세요. 각 코드가 어떤 일을 하는지 예측할 수 있나요?
nl: Neem even de tijd om deze code te bekijken. Kun je voorspelen wat elke regel code doet?
no: Bruk litt tid til å se gjennom denne koden. Kan du forutse hva hver linje av koden gjør?
pt: Examine este código com calma. Você consegue prever o que cada linha de código faz?
sv: Ta dig en stund att gå igenom den här koden. Kan du förutse vad varje kodrad gör?
th: ใช้เวลาสักครู่ตรวจสอบโค้ดนี้ คุณสามารถคาดคะเนได้ไหมว่าโค้ดแต่ละบรรทัดทำหน้าที่อะไร
tr: Bu koda göz atmak için biraz zaman ayır. Her kod satırının ne yaptığını tahmin edebilir misin?
vi: Hãy dành giây lát để xem qua mã này. Bạn có thể dự đoán được chức năng của từng dòng mã không?
zh_cn: 花点时间看一下这些代码。你能预测每行代码所执行的操作吗？
zh_tw: 花點時間看一下這段程式碼。你能預測每一行程式碼的作用嗎？

source: First, the code creates three different `GameMove` [instances](glossary://instance) for Rock ✊, Paper ✋, and Scissors ✌️.
de: Zunächst erstellt der Code drei verschiedene `GameMove`-[Instanzen](glossary://instance) für Schere ✌️, Stein ✊ und Papier ✋.
es: En primer lugar, el código crea tres [instancias](glossary://instance) distintas de `GameMove`, una para Piedra ✊, una para Papel ✋ y otra para Tijera ✌️.
es_419: Primero, el código crea tres [instancias](glossary://instance) distintas de `GameMove` (movimiento del juego) para la piedra ✊, el papel ✋ y las tijeras ✌️.
fr: D’abord, le code crée trois [instances](glossary://instance) `GameMove` différentes pour la pierre ✊, le papier ✋ et les ciseaux ✌️.
it: Per iniziare, il codice crea tre diverse [istanze](glossary://instance) di `GameMove` (mossa di gioco) per Sasso ✊, Carta ✋ e Forbici ✌️.
ja: まず、コードは`GameMove`の3つの[インスタンス](glossary://instance)（グー✊、パー✋、チョキ✌️）を作成します。
ko: 우선, 해당 코드는 가위 ✌️, 바위 ✊, 보 ✋에 관한 세 가지 서로 다른 `GameMove` [인스턴스](glossary://instance)를 생성합니다.
nl: Allereerst maakt de code drie verschillende [instanties](glossary://instance) van `GameMove` aan voor steen ✊, papier ✋ en schaar ✌️.
no: Først lager koden tre forskjellige `GameMove`-[instanser](glossary://instance) for stein ✊, saks ✌️og papir ✋.
pt: Primeiro, o código cria três [instâncias](glossary://instance) diferentes de `GameMove` para Pedra ✊, Papel ✋ e Tesoura ✌️
sv: Först skapar koden tre olika [instanser](glossary://instance) av `GameMove` för sten ✊, sax ✌️ och påse ✋.
th: อันดับแรก โค้ดได้สร้าง[ชื่อแทนประเภท](glossary://instance) `GameMove` ที่ต่างกันสามรายการสำหรับค้อน ✊, กระดาษ ✋ และกรรไกร ✌️
tr: Öncelikle kod, Taş ✊, Kâğıt ✋ ve Makas ✌️ için üç farklı `GameMove` [örneği](glossary://instance) yaratır.
vi: Đầu tiên, mã tạo ra ba [thể hiện](glossary://instance) `GameMove` khác nhau cho Búa ✊, Bao ✋ và Kéo ✌️.
zh_cn: 首先，代码为石头 ✊、布 ✋ 和剪刀 ✌️ 创建了三个不同的 `GameMove`（游戏动作）[实例](glossary://instance)。
zh_tw: 首先，程式碼會為剪刀 ✌️、石頭 ✊ 和布 ✋ 建立三個不同的 `GameMove` [實例](glossary://instance)。

source: A `GameMove` contains a name, icon, and an array of other moves that it can beat. This allows you to figure out if one `GameMove` beats another `GameMove` and returns a result that’s `.win`, `.lose`, or `.tie`.
de: `GameMove` (Spielzug) enthält einen Namen, ein Symbol und ein Array mit anderen Spielzügen, die von diesem Spielzug geschlagen werden können. So kannst du herausfinden, ob eine Instanz von `GameMove` eine andere Instanz von `GameMove` schlagen kann und das Ergebnis `.win` (gewonnen), `.lose` (verloren) oder `.tie` (unentschieden) zurückgibt.
es: Una jugada o `GameMove` contiene un nombre, un icono y un vector de otros movimientos a los que puede ganar. Esto permite calcular si una `GameMove` gana a otra `GameMove` y devuelve un resultado que es `.win` (gana), `.lose` (pierde) o `.tie` (empata).
es_419: Cada `GameMove` contiene un nombre, un ícono y un arreglo de los otros movimientos a los que puede vencer. Esto te permite averiguar si un `GameMove` determinado vence a otro, ya que se devuelve un resultado que puede ser `.win` (ganar), `.lose` (perder) o `.tie` (empatar).
fr: Un `GameMove` contient un nom, une icône et un tableau des autres coups qu’il peut battre. Cela te permet de savoir si un `GameMove` bat un autre `GameMove` et renvoie un résultat qui est `.win`, `.lose` ou `.tie`.
it: Ogni `GameMove` contiene un nome, un’icona e un array di altre mosse che può battere. Questo ti consente di capire se una `GameMove` batte un’altra `GameMove` e restituisce un risultato `.win` (vittoria), `.lose` (sconfitta) oppure `.tie` (pareggio).
ja: `GameMove`には、名前、アイコン、その手が勝てるほかの手の配列が含まれます。これによって、ある`GameMove`がほかの`GameMove`に勝つかどうかを判定し、`.win`（勝ち）、`.lose`（負け）、または`.tie`（引き分け）の結果を返します。
ko: `GameMove`에는 이름, 아이콘 및 이길 수 있는 다른 동작의 배열이 들어 있습니다. 이를 통해 하나의 `GameMove`가 다른 `GameMove`를 이길 경우 `.win`, `.lose`, `.tie` 중 어떤 결과를 반환하는지 알려줍니다.
nl: Een `GameMove` bevat een naam, een symbool en een array met andere zetten die deze zet kan verslaan. Zo kun je achterhalen of een bepaalde `GameMove` een andere `GameMove` kan verslaan. `GameMove` retourneert een van de volgende resultaten: `.win`, `.lose` of `.tie`.
no: En `GameMove` består av et navn, et symbol og en matrise med andre trekk som den kan slå. Det gjør at du kan finne ut om én `GameMove` slår en annen `GameMove`, og resultatet returneres som `.win`, `.lose` eller `.tie`.
pt: Um `GameMove` contém um nome, um ícone e um vetor dos outros movimentos dos quais ele ganha. Isso permite que você descubra se um `GameMove` ganha de outro `GameMove` e retorna um resultado que é `.win`, `.lose` ou `.tie`.
sv: En `GameMove` innehåller ett namn, en symbol och en array med andra drag som den kan slå. Det gör att du kan se om en `GameMove` slår en annan `GameMove` och returnerar ett resultat som är `.win`, `.lose` eller `.tie` (vinst, förlust eller oavgjort).
th: `GameMove` ประกอบด้วยชื่อ ไอคอน และอาร์เรย์ของท่าอื่นๆ ที่ท่านั้นสามารถเอาได้ ซึ่งทำให้คุณเข้าใจว่า `GameMove` ชนะ `GameMove` หรือไม่ และคืนค่าผลลัพธ์ ซึ่งก็คือ `.win`, `.lose` หรือ `.tie`
tr: `GameMove` bir ad, simge ve yenebileceği diğer hareketlerden oluşan bir dizi içerir. Bu, bir `GameMove`’un başka bir `GameMove`’u yenip yenemeyeceğini bulmanı sağlar ve `.win`, `.lose` veya `.tie` sonucunu döndürür.
vi: Một `GameMove` chứa tên, biểu tượng và một dãy các nước đi khác có thể thắng. Việc này cho phép bạn chỉ ra liệu một `GameMove` có thắng một `GameMove` khác không và trả về một kết quả là `.win`, `.lose` hoặc `.tie`.
zh_cn: `GameMove` 包含一个名称、图标和一组它能打败的其他动作。这可让你知道某个 `GameMove` 是否打败了另一个 `GameMove`，并返回 `.win`（赢）、`.lose`（输）或 `.tie`（打平）的结果。
zh_tw: `GameMove` 包含一個名稱、圖像和它可以打敗的其他動作陣列。這讓你能確定一個 `GameMove` 是否贏過了另一個 `GameMove` 並傳回 `.win`、`.lose` 或 `.tie` 的結果。

source: Try changing the icon for your `rock`, `paper`, and `scissors` moves and play the game again to see how it changes.
de: Ändere das Symbol für die Spielzüge `scissors` (Schere), `rock` (Stein) und `paper` (Papier) und spiele das Spiel erneut, um zu sehen, wie es sich verändert.
es: Prueba a cambiar el icono de las jugadas `rock` (piedra), `paper` (papel) y `scissors` (tijera) e intenta jugar de nuevo para ver cómo cambia.
es_419: Intenta cambiar el ícono de `rock` (piedra), `paper` (papel) y `scissors` (tijeras) y vuelve a jugar para ver la diferencia.
fr: Essaie de modifier l’icône de tes coups `rock`, `paper` et `scissors`, puis joue à nouveau au jeu pour voir les changements.
it: Prova a modificare le icone per le mosse `rock` (sasso), `paper` (carta) e `scissors` (forbici) e prova di nuovo il gioco per vedere come cambia.
ja: `rock`（グー）、`paper`（パー）、`scissors`（チョキ）の手のアイコンを変えてからもう一度ゲームをプレイして、どう変わるか確かめてみましょう。
ko: `rock`, `paper` 및 `scissors` 동작 아이콘을 변경해 보고 게임을 다시 플레이하여 어떻게 변화하는지 확인해 보세요.
nl: Wijzig het symbool voor je `rock`-, `paper`- en `scissors`-zetten en speel de game opnieuw om te zien hoe de game is veranderd.
no: Prøv å endre symbolet for trekkene `rock` (stein), `scissors` (saks) og `paper` (papir), og spill spillet igjen for å se hvordan det har blitt endret.
pt: Tente mudar os ícones dos movimentos `rock`, `paper` e `scissors`, e jogue novamente para ver como o jogo muda.
sv: Prova att ändra symbolerna för dragen `rock`, `paper` och `scissors` (sten, påse och sax) och sedan spela spelet igen för att se hur det förändras.
th: ลองเปลี่ยนไอคอนของท่า `rock`, `paper` และ `scissors` แล้วเล่นเกมอีกครั้งเพื่อดูว่าเกมเปลี่ยนไปอย่างไร
tr: `rock`, `paper` ve `scissors` hareketlerinin simgelerini değiştirmeyi dene ve nasıl değiştiğini görmek için oyunu yeniden oyna.
vi: Thử thay đổi biểu tượng cho các nước đi `rock`, `paper` và `scissors` và chơi lại trò chơi để xem những sự thay đổi.
zh_cn: 试着更改 `rock`（石头）、`paper`（布）和 `scissors`（剪刀）动作的图标，然后再玩一次游戏来看看变化。
zh_tw: 試著更改你的 `rock`、`paper` 和 `scissors` 動作的圖像，並且再玩一次遊戲來看看它有什麼變化。

source: Next, the game sets its rules for which move beats another.
de: Als Nächstes legt das Spiel fest, welcher Spielzug einen anderen Spielzug schlägt.
es: A continuación, el juego establece las reglas por las que una jugada gana a otra.
es_419: A continuación, el juego establece sus reglas sobre qué movimiento vence a otro.
fr: Ensuite, le jeu établit ses règles pour savoir quel coup en bat un autre.
it: Successivamente, il codice imposta le regole per stabilire quale mossa batte un’altra.
ja: 次に、どの手がどの手に勝つかというルールをゲームが設定します。
ko: 다음으로, 게임에서 어떤 동작이 다른 동작을 이기는지에 관한 규칙을 정할 거예요.
nl: Vervolgens configureert de game de regels voor welke zet een andere zet verslaat.
no: Deretter konfigurerer spillet reglene for hvilke trekk som slår andre trekk.
pt: Depois, o jogo define as regras de qual movimento ganha do outro.
sv: Härnäst ställer spelet in sina regler för vilka drag som slår andra.
th: ถัดไป เกมได้ตั้งกฎสำหรับท่าที่ชนะท่าอื่นไว้
tr: Sonra, oyunun kuralları hangi hareketin hangi hareketi yeneceğini belirler.
vi: Tiếp theo, trò chơi đặt các quy tắc cho nước đi nào thắng một nước đi khác.
zh_cn: 下一步，游戏将设定它的规则，用来确定动作之间哪个可以打败哪个。
zh_tw: 下一步，遊戲會設定哪一個動作可以贏過另一個動作的規則。

source: If you look at the code, it only has the logic for Rock beating Scissors. This is why the game is so broken. 🤪
de: Wenn du dir den Code genauer anschaust, wirst du feststellen, dass es nur Logik für „Stein schlägt Schere“ gibt. Das ist auch der Grund, warum das Spiel kaputt ist. 🤪
es: Si miras bien el código, solo tiene definida la lógica de que la piedra gana a las tijeras. Por eso está tan estropeado el juego. 🤪
es_419: Si te fijas en el código, solamente indica la lógica de que la piedra vence a las tijeras. Es por esto que el juego no sirve. 🤪
fr: Si tu regardes le code, il ne contient que la logique pour la pierre qui bat les ciseaux. C’est pour ça que le jeu ne fonctionne pas ! 🤪
it: Se osservi il codice, contiene solo la logica per Sasso batte Forbici. Ecco perché il gioco non funziona come ti aspetteresti. 🤪
ja: コードを見てみると、Rock（グー）がScissors（チョキ）に勝つというロジックしかありません。ゲームがおかしかったのはそのせいです。🤪
ko: 코드를 보면 바위가 가위를 이기는 로직만 있네요. 이것이 게임이 그와 같이 작동하지 않았던 원인입니다. 🤪
nl: Als je de code bekijkt, zie je dat die alleen de logica bevat voor steen die schaar verslaat. Dat is waarom de game niet goed werkt. 🤪
no: Hvis du tar en titt på koden, ser du at den bare inneholder logikk for at stein slår saks. Det er derfor spillet ikke fungerer. 🤪
pt: Ao observar o código, você vê que ele só tem a lógica da Pedra ganhando da Tesoura. É por isso que as regras do jogo estão erradas. 🤪
sv: Om du tar en titt på koden så innehåller den bara logiken för ”sten slår sax”. Det är därför spelet är så svajigt. 🤪
th: ถ้าคุณดูที่โค้ด จะมีเพียงตรรกะสำหรับทำให้ค้อนชนะกรรไกร ซึ่งเป็นสาเหตุที่ทำให้เกมมีปัญหา 🤪
tr: Koda bakarsan kodda yalnızca taşın makası yenme mantığı olduğunu göreceksin. Oyunun bu kadar bozuk olmasının nedeni budur. 🤪
vi: Nếu bạn nhìn vào mã thì mã chỉ có logic cho Búa thắng Kéo. Đó là lý do tại sao trò chơi bị phá vỡ. 🤪
zh_cn: 看过代码后，你会发现它只有石头打败剪刀的逻辑。这就是游戏的问题所在。🤪
zh_tw: 如果你看一下程式碼，它只有石頭贏了剪刀的邏輯。這就是為什麼遊戲如此不順暢的原因。🤪

source: Insert this code snippet to add the rules for `paper` and `scissors`:
de: Setze diesen Codeabschnitt ein, um die Regeln für `paper` und `scissors` hinzuzufügen:
es: Inserta este fragmento de código para añadir las reglas de `paper` (papel) y `scissors` (tijeras):
es_419: Inserta este fragmento de código para agregar reglas para `paper` y `scissors`:
fr: Insère cet extrait de code pour ajouter les règles pour `paper` et `scissors` :
it: Inserisci questo frammento di codice per aggiungere le regole per `paper` e `scissors`:
ja: このコードスニペットを挿入して、`paper`（パー）と`scissors`（チョキ）のルールを追加します:
ko: 다음 코드 스니펫을 삽입하여 `paper`와 `scissors`에 대한 규칙을 추가합니다.
nl: Voeg dit codefragment in om de regels voor `paper` en `scissors` toe te voegen:
no: Sett inn denne kodesnutten for å inkludere reglene for `paper` og `scissors`:
pt: Insira este fragmento de código para adicionar regras para `paper` e `scissors`:
sv: Lägg till reglerna för `paper` och `scissors` genom att infoga den här kodsnutten:
th: แทรกส่วนย่อยของโค้ดนี้เพื่อเพิ่มกฎสำหรับ `paper` และ `scissors`:
tr: `paper` ve `scissors` kurallarını eklemek için bu kod parçacığını ekle:
vi: Hãy chèn đoạn mã này để thêm các quy tắc cho `paper` và `scissors`:
zh_cn: 插入这个代码片段，来为 `paper` 和 `scissors` 添加规则：
zh_tw: 插入此程式碼片段來加入 `paper` 和 `scissors` 的規則：

source: Try playing the game again and see if that fixed your game logic.
de: Spiele das Spiel erneut und überprüfe, ob das Problem behoben wurde.
es: Prueba a jugar de nuevo para ver si ya se ha corregido la lógica del juego.
es_419: Intenta volver a jugar para comprobar que se haya corregido la lógica del juego.
fr: Essaie de jouer à nouveau au jeu pour voir si sa logique a été corrigée.
it: Prova di nuovo a giocare e controlla se la logica del gioco adesso è corretta.
ja: もう一度ゲームをプレイしてみて、これでゲームのロジックが直ったかどうか確認しましょう。
ko: 게임을 다시 플레이해 보고 게임 로직이 해결되었는지 확인해 보세요.
nl: Speel de game opnieuw om te zien of de gamelogica nu goed werkt.
no: Prøv å spille spillet igjen for å se om logikken stemmer nå.
pt: Experimente jogar novamente e veja se isso corrige a lógica do jogo.
sv: Prova att spela spelet igen och se om det fixade spellogiken.
th: ลองเล่นเกมอีกครั้งและดูว่าตรรกะเกมของคุณได้รับการแก้ไขแล้วหรือไม่
tr: Oyunu yeniden oynamayı dene ve bunun oyunun mantığını düzeltip düzeltmediğine bak.
vi: Thử chơi lại trò chơi và xem việc đó có khắc phục được logic trò chơi của bạn không.
zh_cn: 试着再玩一次游戏，看看游戏逻辑是否已修复。
zh_tw: 嘗試再玩一次遊戲，看看是否修正了你的遊戲邏輯。

source: You have full creative freedom to customize these rules! Do you want Rock ✊ to be the superior move and make it so that it beats paper and scissors?
de: Du kannst die Regeln aber anpassen, wie du willst! Soll Stein ✊ der beste Spielzug sein und Papier und Schere schlagen?
es: ¡Tienes libertad creativa total para personalizar estas reglas! ¿Quieres hacer que Piedra ✊ sea la jugada más poderosa y que le gane al papel y a las tijeras?
es_419: ¡Ahora tienes total libertad para personalizar estas reglas! ¿Te gustaría hacer que la piedra ✊ sea el movimiento superior y que pueda vencer tanto al papel como a las tijeras?
fr: Tu disposes d’une liberté créative totale pour personnaliser ces règles ! Veux-tu que la pierre ✊ soit le coup le plus fort et faire en sorte qu’il batte le papier et les ciseaux ?
it: Hai piena libertà creativa per personalizzare le regole! Vuoi che Sasso ✊ sia la mossa suprema e fare in modo che batta sia Carta che Forbici?
ja: これらのルールは本当に自由にカスタマイズできます! グー✊を最強の手にして、パーとチョキに勝つようにしたいですか?
ko: 이러한 규칙을 사용자화할 수 있는 모든 창작의 자유는 여러분에게 있습니다! 바위✊가 우세한 동작으로 보와 가위를 이겼으면 하나요?
nl: Je hebt volledige creatieve vrijheid om deze regels aan te passen! Wil je dat steen ✊ de dominante zet is die zowel papier als schaar verslaat?
no: Du kan fritt endre disse reglene! Vil du at stein ✊ skal være et supertrekk som slår både saks og papir?
pt: Você tem liberdade total de criação para personalizar as regras! Você quer que a Pedra ✊ seja o movimento mais forte e ganhe do papel e da tesoura?
sv: Du har full kreativ frihet att anpassa de här reglerna! Vill du att sten ✊ ska vara det överlägsna draget och göra så att det slår papper och sax?
th: คุณมีอิสระในเชิงสร้างสรรค์อย่างเต็มที่ที่จะกำหนดกฎเหล่านี้เอง! คุณต้องการให้ค้อน ✊ เป็นท่าที่เหนือกว่าและต้องการทำให้เป็นเช่นนั้นเพื่อให้ชนะกระดาษและกรรไกรหรือไม่
tr: Bu kuralları özelleştirme konusunda yaratıcılığını gösterirken tamamen özgürsün! Taşın ✊ en iyi hareket olmasını ve kâğıdı ve makası yenmesini ister misin?
vi: Bạn hoàn toàn tự do sáng tạo trong việc tùy chỉnh những quy tắc này! Bạn có muốn Búa ✊ trở thành nước đi cao cấp và thắng bao và kéo không?
zh_cn: 你可以完全按照自己的想法来自定这些规则！想要让石头 ✊ 变成最厉害的动作，然后打败布和剪刀吗？
zh_tw: 你擁有完全的創作自由來自訂這些規則！你是否希望石頭 ✊ 成為最佳動作並讓它贏過布和剪刀？
