Repository: JulioPr0/ml-rock-paper-scissors
Catalog: Rock, Paper, Scissors game with ML.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Remember, an ML model’s prediction accuracy depends on the training data you give it. Take a second to look back through the training data you used. Are there any examples of those types of images? If not, the model might not be able to accurately predict what they are.
de: Denk dran: Die Genauigkeit der Vorhersagen des ML-Modells hängen von den bereitgestellten Trainingsdaten ab. Nimm dir einen Moment Zeit und sieh dir noch mal die verwendeten Trainingsdaten an. Gibt es Beispiele für diesen Bildertyp? Falls nicht, kann das Modell sie möglicherweise nicht korrekt vorhersagen.
es: Recuerda que la precisión de las predicciones de un modelo de aprendizaje automático depende de los datos de entrenamiento que le proporciones. Dedica unos momentos a mirar los datos de entrenamiento que has usado. ¿Tienes algún ejemplo de este tipo de imágenes? Si no tienes, el modelo podría no ser capaz de predecir de manera precisa de qué son las imágenes.
es_419: Recuerda que la precisión de las predicciones de un modelo de ML depende de los datos de entrenamiento que se le hayan proporcionado. Tómate un segundo para revisar los datos de entrenamiento usados. ¿Encuentras ejemplos de esos tipos de imágenes? Si no, es posible que el modelo no pueda detectar de manera precisa qué son.
fr: N’oublie pas que la précision de la prédiction d’un modèle d’apprentissage automatique dépend des données d’entraînement que tu lui donnes. Prends un moment pour revoir les données d’entraînement que tu as utilisées. Vois-tu des exemples de ces types d’images ? Si ce n’est pas le cas, il est possible que le modèle ne puisse pas prédire avec précision ce qui est représenté.
it: Ricorda, l’accuratezza di un modello di apprendimento automatico dipende dai dati di addestramento che gli fornisci. Prenditi un minuto per ricontrollare i dati di addestramento che hai usato. Ci sono esempi di quei tipi di immagine? Se non ci sono, il modello potrebbe non essere in grado di prevedere accuratamente cosa sono.
ja: 機械学習モデルの予測の正確性は、与えた学習データに左右されることを思い出してください。少し時間を取って、使用した学習データを見返してみましょう。そのタイプのイメージは含まれていますか? 含まれていなければ、モデルではそのイメージが何なのかを正確に予測することはできません。
ko: ML 모델의 예측 정확도는 사용자가 제공한 훈련 데이터에 따라 달라집니다. 잠시 시간을 내어 사용한 훈련 데이터를 다시 살펴보세요. 이러한 유형의 이미지 예가 있나요? 그렇지 않으면 모델이 정확하게 예측하지 못할 수 있습니다.
nl: Onthoud dat de nauwkeurigheid van de voorspellingen van een ML-model afhankelijk is van de trainingsgegevens die je het geeft. Neem even de tijd om de trainingsgegevens opnieuw door te kijken. Zijn er voorbeelden van die typen afbeeldingen? Zo niet, dan kan het model mogelijk niet goed voorspellen wat ze zijn.
no: Husk at treffsikkerheten for maskinlæringsmodellens prediksjoner avhenger av hvilke treningsdata du gir den. Bruk litt tid til å gå gjennom treningsdataene du brukte. Finnes det eksempler på slike bilder? Hvis det ikke gjør det, er det ikke sikkert at modellen kan forutse hva de er.
pt: Lembre‑se: a precisão das previsões de um modelo de AM depende dos dados de treinamento que você fornece. Analise com calma os dados de treinamento que você usou lá atrás. Existe algum exemplo desses tipos de imagens? Caso não exista, o modelo pode não ser capaz de prever com precisão o que eles são.
sv: Kom ihåg att träffsäkerheten för en maskininlärningsmodells förutsägelser varierar beroende på vilka träningsdata du ger den. Ägna ett ögonblick åt att gå igenom de träningsdata du använde. Finns det några exempel på de typerna av bilder? Om de saknas kanske modellen inte kan förutsäga vad de är med träffsäkerhet.
th: อย่าลืมว่าความแม่นยำในการคาดคะเนของโมเดล ML ขึ้นอยู่กับข้อมูลการฝึกที่คุณให้ ลองใช้เวลาสักครู่เพื่อนึกย้อนกลับไปถึงชุดข้อมูลการฝึกที่คุณใช้ มีตัวอย่างของภาพเหล่านี้หรือไม่ ถ้าไม่มี โมเดลอาจไม่สามารถคาดคะเนได้อย่างแม่นยำว่าสิ่งเหล่านั้นคืออะไร
tr: Makine öğrenimi modelinin tahmin doğruluğunun ona verdiğin eğitim verilerine bağlı olduğunu unutma. Bir saniye dur ve kullandığın eğitim verilerine dönüp bak. Bu tür görüntülerin örnekleri var mı? Yoksa model bunların ne olduğunu doğru bir şekilde tahmin edemeyebilir.
vi: Hãy nhớ rằng độ chính xác dự đoán của mô hình ML phụ thuộc vào dữ liệu huấn luyện mà bạn cung cấp. Hãy dành giây lát để nhìn lại dữ liệu huấn luyện mà bạn đã sử dụng. Có bất kỳ ví dụ nào về những loại hình ảnh này không? Nếu không có thì nghĩa là mô hình đó có thể không có khả năng dự đoán chính xác chúng là gì.
zh_cn: 要记住，机器学习模型的预测准确度取决于你给它的训练数据。花点时间回顾一下你使用的训练数据，里面有这类图像的例子吗？如果没有，那么模型可能无法准确预测它们是什么。
zh_tw: 請記住，ML 模型的預測準確性取決於你提供的訓練資料。花點時間回顧一下你使用的訓練資料。有這些類型影像的任何範例嗎？如果沒有，模型可能就無法準確地預測它們是什麼。

source: One way to catch these issues even before you start using your model is providing these [edge cases](glossary://edge%20case) as part of your validation dataset.
de: Du kannst diese Probleme schon vor der Nutzung des Modells angehen, indem du zum Beispiel diese [Grenzfälle](glossary://edge%20case) als Teil deines Prüfungsdatensatzes bereitstellst.
es: Una manera de atajar estos problemas incluso antes de arrancar el modelo es proporcionar estos [casos extremos](glossary://edge%20case) como parte del conjunto de datos de validación.
es_419: Una forma de encargarse de estos problemas incluso antes de empezar a usar el modelo es proporcionar estos [casos extremos](glossary://edge%20case) como parte del conjunto de datos de validación.
fr: Une façon de détecter ces problèmes avant même de commencer à utiliser ton modèle est de fournir ces [cas limites](glossary://edge%20case) dans ton ensemble de données de validation.
it: Un modo per risolvere questi problemi ancor prima di iniziare a usare il modello è fornire questi [casi limite](glossary://edge%20case) come parte dell’insieme di dati di convalida.
ja: モデルを使い始める前にこういった問題を見つける方法の1つは、このような[エッジケース](glossary://edge%20case)を検証データセットの一部として提供することです。
ko: 이러한 문제를 파악하려면 모델을 사용하기 전에 이 [엣지 케이스](glossary://edge%20case)를 유효성 확인 데이터 세트의 일부로 제공하세요.
nl: Een van de manieren waarop je deze problemen kunt opsporen voordat je je model gaat gebruiken, is door deze [randgevallen](glossary://edge%20case) aan je validatiegegevensset toe te voegen.
no: Én måte å avdekke disse problemene på før du begynner å bruke modellen, er å inkludere disse [hjørnetilfellene](glossary://edge%20case) i valideringsdatasettet.
pt: Uma maneira de identificar esses problemas antes mesmo de começar a usar o modelo é fornecer esses [casos extremos](glossary://edge%20case) como parte do conjunto de dados de validação.
sv: Ett sätt att hitta de här problemen, innan du ens har börjat använda modellen, är att inkludera de här [kantfallen](glossary://edge%20case) som en del av valideringsdatauppsättningen.
th: วิธีหนึ่งในการพบปัญหาเหล่านี้ก่อนที่คุณจะเริ่มใช้โมเดลของคุณคือการให้ [edge case](glossary://edge%20case) เหล่านี้เป็นส่วนหนึ่งของชุดข้อมูลการทดสอบของคุณ
tr: Modelini kullanmaya bile başlamadan önce bu sorunları yakalamanın bir yolu, doğrulama veri kümesinin bir parçası olarak bu [uç durumları](glossary://edge%20case) sağlamaktır.
vi: Một cách để nắm bắt những vấn đề này ngay cả trước khi bạn bắt đầu sử dụng mô hình của mình là cung cấp những [trường hợp hóc búa](glossary://edge%20case) này như một phần của tập dữ liệu xác thực.
zh_cn: 捕捉这些问题的方法之一（甚至是在开始使用模型之前），是在验证数据集中提供这些[边界情况](glossary://edge%20case)。
zh_tw: 甚至在你開始使用模型之前就發現這些問題的一種方法是，提供這些[邊緣案例](glossary://edge%20case)做為驗證資料集的一部分。

source: This is a great way to find mislabeled data early in your machine learning process. It ensures that your model isn’t just memorizing training examples, but accurately predicting the hand signs you display.
de: Dies ist eine gute Methode, um falsch etikettierte Daten schon früh im Prozess des maschinellen Lernens zu finden. Auf diese Weise ist sichergestellt, dass dein Modell die Trainingsbeispiele nicht einfach nur auswendig lernt, sondern die von dir ausgeführten Handgesten korrekt vorhersagt.
es: Esta es una manera estupenda de encontrar precozmente en el proceso de aprendizaje automático datos mal etiquetados. Garantiza que el modelo no se limita a memorizar los ejemplos de entrenamiento, sino que predice con precisión los signos de la mano que muestres.
es_419: Esta es una excelente manera de encontrar datos que están mal etiquetados desde el principio del proceso de aprendizaje automático, y garantiza que el modelo no sólo memorice ejemplos de entrenamiento, sino que pueda predecir los signos de mano que muestras de manera precisa.
fr: C’est un excellent moyen de détecter des données mal étiquetées dès le début de ton processus d’apprentissage automatique. Cela garantit que ton modèle ne se contente pas de mémoriser des exemples d’entraînement, mais prédit avec précision les signes de la main que tu présentes.
it: Questa è un’ottima maniera per trovare dati con etichette errate nelle fasi iniziali del processo di apprendimento automatico. Ciò garantisce che il modello non stia semplicemente memorizzando esempi di addestramento, ma stia prevedendo in modo accurato le pose della mano che gli mostri.
ja: この方法は、誤ったラベルが付いたデータを機械学習プロセスの早期で発見するのにとても役立ちます。これによって、モデルが単に学習用の例を記憶しているのではなく、見せる手の形を正確に予測していることが分かります。
ko: 기계 학습 프로세스 초기에 레이블이 잘못 지정된 데이터를 발견할 수 있는 아주 유용한 방법입니다. 이를 통해 모델이 단순히 훈련 예제를 암기하는 것이 아니라 사용자가 표시하는 손짓을 정확하게 예측할 수 있도록 합니다.
nl: Dit is een goede manier om vroeg in het machinelearningproces verkeerd gelabelde gegevens op te sporen. Zo zorg je dat je model niet alleen trainingsvoorbeelden onthoudt, maar ook de handgebaren die je de toont goed voorspelt.
no: Dette er en god måte å finne feilmerkede data på tidlig i maskinlæringsprosessen. Det sørger for at modellen ikke bare memorerer eksemplene som brukes under trening, men at den kan forutse hvilke håndtegn du viser.
pt: Essa é uma ótima maneira de identificar dados etiquetados incorretamente ainda cedo no processo de aprendizado de máquina. Isso garante que o modelo não esteja apenas memorizando os exemplos de treinamento, e sim prevendo com precisão os sinais que você mostra.
sv: Det här är ett bra sätt att hitta feletiketterade data tidigt i maskininlärningsprocessen. Det ser till att modellen inte bara memorerar träningsexempel utan träffsäkert kan förutsäga vilka handgester du visar.
th: นี่เป็นวิธีที่ดีในการค้นหาข้อมูลที่ติดป้ายผิดตั้งแต่เนิ่นๆ ในกระบวนการเรียนรู้ของเครื่องของคุณ ซึ่งจะช่วยให้แน่ใจว่าโมเดลของคุณไม่เพียงจดจำตัวอย่างการฝึก แต่ยังคาดคะเนสัญลักษณ์มือที่คุณแสดงได้อย่างแม่นยำอีกด้วย
tr: Bu, yanlış etiketlenmiş verileri makine öğrenimi sürecinin erken aşamalarında bulmanın harika bir yoludur. Modelinin eğitim örneklerini sadece ezberlemeyip aynı zamanda görüntülediğin el işaretlerini doğru bir şekilde tahmin edebilmesini de sağlar.
vi: Đây là cách tuyệt vời để sớm tìm ra dữ liệu được gắn nhãn sai trong quy trình học máy của bạn. Việc đó đảm bảo rằng mô hình của bạn không chỉ ghi nhớ các mẫu huấn luyện mà còn dự đoán chính xác các ký hiệu bàn tay mà bạn biểu thị.
zh_cn: 这是在机器学习过程中及时发现错误标记数据的好方法。它可确保你的模型不仅仅是记住训练样本，同时还能准确地预测你展示的手势。
zh_tw: 這是在機器學習過程中早期找出錯誤標記資料的好方法。它能確保你的模型不僅記住訓練範例，還能準確地預測你顯示的手部姿勢。

source: Consider these edge cases when you create your own datasets for future ML model development.
de: Berücksichtige diese Grenzfälle beim Erstellen eines eigenen Datensatzes für zukünftige ML-Modelle.
es: Ten en cuenta estos casos extremos cuando crees tus conjuntos de datos para futuros desarrollos de modelos de ML.
es_419: Toma en cuenta estos casos extremos al crear tus propios conjuntos de datos para futuros desarrollos de modelos de ML.
fr: Prends en compte ces cas limites lorsque tu crées tes propres ensembles de données pour le développement de futurs modèles d’apprentissage automatique.
it: Considera questi casi limite quando crei un insieme di dati tutto tuo per lo sviluppo di modelli di apprendimento automatico in futuro.
ja: 今後の機械学習モデルの開発に使える自分だけのデータセットを作成するときには、これらのエッジケースを含めることを検討してください。
ko: 향후 ML 모델 개발을 위한 나만의 데이터 세트를 만들 때 이러한 엣지 케이스를 고려해 보세요.
nl: Houd rekening met deze randgevallen als je in de toekomst je eigen gegevenssets gaat samenstellen voor de ontwikkeling van ML-modellen.
no: Tenk gjennom disse hjørnetilfellene når du lager dine egne datasett for fremtidig utvikling av maskinlæringsmodeller.
pt: Considere esses casos extremos quando você criar os seus próprios conjuntos de dados para o desenvolvimento futuro do modelo de AM.
sv: Tänk på de här kantfallen när du skapar egna datauppsättningar för framtida utveckling av maskininlärningsmodeller.
th: โปรดคำนึงถึง edge case เหล่านี้เมื่อคุณสร้างชุดข้อมูลของคุณเองสำหรับการพัฒนาโมเดล ML ในอนาคต
tr: Gelecekteki makine öğrenimi modeli geliştirmeleri için kendi veri kümelerini yaratırken bu uç durumları düşün.
vi: Hãy cân nhắc những trường hợp hóc búa này khi bạn tạo ra tập dữ liệu của riêng mình để phát triển mô hình ML trong tương lai.
zh_cn: 为后续的机器学习模型开发创建自己的数据集时，你应考虑这些边界情况。
zh_tw: 當你為未來的 ML 模型開發建立自己的資料集時，請考慮這些邊緣案例。

source: As you debug your model, you’ll discover that some camera conditions — like lighting, angle, or focus — also influence your model’s predictions.
de: Beim Debuggen deines Modells wirst du feststellen, dass einige Kameraeinstellungen wie Belichtung, Winkel und Fokus ebenfalls die Vorhersagen deines Modells beeinflussen.
es: Cuando depures el modelo, descubrirás que también influyen en las predicciones algunas de las condiciones de la cámara, como la iluminación, el ángulo o el enfoque.
es_419: Conforme depures tu modelo, descubrirás que hay algunas condiciones, como la luz, el ángulo y el enfoque, que también influyen en las predicciones de tu modelo.
fr: Lors du débogage de ton modèle, tu découvriras que certaines conditions de l’appareil photo, telles que l’éclairage, l’angle ou la mise au point, influencent également les prédictions de ton modèle.
it: Mentre esegui il debug del modello, scoprirai che anche determinate condizioni della fotocamera (come illuminazione, angolazione e messa a fuoco) influenzano le sue previsioni.
ja: モデルをデバッグしていると、一部のカメラ状態（照明、アングル、焦点など）も、モデルの予測に影響することが分かるでしょう。
ko: 모델을 디버깅하면 조명, 각도 또는 초점과 같은 카메라 조건도 모델의 예측에 영향을 미칩니다.
nl: Als je fouten opspoort in je model, zul je ontdekken dat sommige cameraomstandigheden, zoals belichting, hoek of scherpstelling, ook van invloed zijn op de voorspellingen van je model.
no: Når du feilsøker modellen din, vil du se at enkelte kameraforhold også påvirker modellens prediksjoner, for eksempel lys, vinkel eller fokus.
pt: Conforme depura o modelo, você descobrirá que algumas condições da câmera (como iluminação, ângulo ou foco) também influenciam nas previsões do modelo.
sv: Medan du felsöker modellen kan du se att en del kameraförhållanden, som ljus, vinkel eller fokus, också påverkar modellens förutsägelser.
th: เมื่อคุณแก้บั๊กโมเดล คุณจะค้นพบว่าสภาวะบางอย่างของกล้อง เช่น การจัดแสง มุม หรือโฟกัส ยังมีผลต่อการคาดคะเนของโมเดลของคุณอีกด้วย
tr: Modelinle ilgili hataları ayıklarken bazı kamera koşullarının da (ışık, açı veya odak gibi) modelinin tahminlerini etkilediğini keşfedeceksin.
vi: Khi gỡ lỗi mô hình của mình, bạn sẽ phát hiện ra rằng một số điều kiện của camera — như chiếu sáng, góc hoặc lấy nét — cũng ảnh hưởng đến các dự đoán của mô hình.
zh_cn: 调试模型时，你会发现一些摄像头的条件（如光线、角度或焦点）也会影响模型的预测。
zh_tw: 當你為模型除錯時，你會發現某些相機條件（例如光線、角度或焦點）也會影響模型的預測。

source: Think back to your training dataset: Is there a variety of lighting, camera angles, and focus settings? If not, your model may have [overfitted](glossary://overfitting) to the specific setup of one environment.
de: Denk an deinen Trainingsdatensatz: Gibt es verschiedene Belichtungen, Kamerawinkel und Fokuseinstellungen? Falls nicht, könnte dein Modell für eine bestimmte Konfiguration [überangepasst](glossary://overfitting) sein.
es: Piensa de nuevo en tu conjunto de datos de entrenamiento: ¿tiene diversas condiciones de iluminación, ángulos de toma y ajustes de enfoque? Si no es así, el modelo podría estar [sobreajustado](glossary://overfitting) a la configuración específica de un entorno.
es_419: Piensa nuevamente en tu conjunto de datos de entrenamiento. ¿Tenía diversas condiciones de iluminación, ángulos y enfoques? Si no es así, es posible que el modelo esté [sobreajustado](glossary://overfitting) a las condiciones específicas de un solo entorno.
fr: Repense à ton ensemble de données d’entraînement : comporte-t-il différents types d’éclairage, d’angles de l’appareil photo et de réglages de la mise au point ? Si ce n’est pas le cas, il est possible que ton modèle ait fait un [surapprentissage](glossary://overfitting) de la configuration propre à un environnement unique.
it: Ripensa all’insieme di dati per l’addestramento: contiene esempi con una vasta gamma di illuminazioni, angolazioni e messe a fuoco? Se la risposta è no, il modello potrebbe presentare un [sovradattamento](glossary://overfitting) alla configurazione specifica di un solo ambiente.
ja: 学習データセットに戻って考えてみましょう。さまざまな照明、カメラアングル、焦点の設定のデータが含まれていますか? そうでない場合は、モデルが特定の1つの環境に[過適合](glossary://overfitting)してしまったのかもしれません。
ko: 훈련 데이터 세트를 다시 생각해 보세요. 조명, 카메라 각도, 초점 설정이 다양한가요? 그렇지 않으면 모델이 한 환경의 특정 설정에 [과적합](glossary://overfitting)되어 있을 수 있습니다.
nl: Denk nog eens aan je trainingsgegevensset: bevat deze verschillende belichtingsomstandigheden, camerahoeken en scherpstellingsopties? Zo niet, dan is je model misschien [overgespecialiseerd](glossary://overfitting) voor één specifieke omgeving.
no: Tenk på treningsdatasettet. Inneholder det variasjoner i lys, kameravinkler og fokus? Hvis det ikke gjør det, kan det hende at modellen har [overtilpasset](glossary://overfitting) seg etter forutsetningene i ett miljø.
pt: Pense no conjunto de dados de treinamento lá atrás: existe uma variação de iluminação, dos ângulos da câmera e dos ajustes de foco? Caso não exista, o modelo pode ter sido [sobreajustado](glossary://overfitting) para as condições específicas de um ambiente.
sv: Fundera över träningsdatauppsättningen: Finns det olika ljussättningar, kameravinklar och fokusinställningar? Om det inte gör det kan modellen ha [överpassats](glossary://overfitting) till de specifika förutsättningarna i en miljö.
th: ลองนึกย้อนไปถึงชุดข้อมูลการฝึกของคุณ: มีความหลากหลายของการจัดแสง มุมกล้อง และการตั้งค่าโฟกัสหรือไม่ หากยังไม่มี โมเดลของคุณอาจจะ [overfit](glossary://overfitting) กับการตั้งค่าเฉพาะของหนึ่งสภาพแวดล้อม
tr: Eğitim veri kümeni yeniden düşün: Işık, kamera açıları ve odak ayarları konusunda bir çeşitlilik var mı? Yoksa modelin, bir ortamın belirli bir kurulumuna [aşırı uyum](glossary://overfitting) göstermiş olabilir.
vi: Hãy nhớ lại tập dữ liệu huấn luyện của bạn: Có nhiều cài đặt chiếu sáng, góc và lấy nét khác nhau không? Nếu không có thì nghĩa là mô hình của bạn có thể đã [quá khớp](glossary://overfitting) với cách thiết lập của một môi trường cụ thể.
zh_cn: 回想一下你的训练数据集：是否有不同的光线、摄像头角度和焦点设置？如果没有，那么模型可能已对某个特定的环境设定[过拟合](glossary://overfitting)。
zh_tw: 回想一下你的訓練資料集：是否有各種光線、相機角度和焦點的設定？如果沒有，你的模型可能已經[過度擬合](glossary://overfitting)到某個環境的特殊設定。

source: Your model also might work well for you, but not as well for a friend. This can also be the result of [overfitting](glossary://overfitting).
de: Es könnte auch sein, dass das Modell bei dir gut funktioniert, aber bei einer anderen Person nicht. Das kann auch ein Ergebnis von [Überanpassung](glossary://overfitting) sein.
es: Tu modelo podría funcionarte muy bien para ti, pero puede que no tanto para tus amistades. Esto también se puede deber al [sobreajuste](glossary://overfitting).
es_419: También es posible que tu modelo te funcione muy bien a ti, pero que no le sirva a alguien más. Esto también puede deberse al [sobreajuste](glossary://overfitting).
fr: Il est également possible que ton modèle fonctionne bien pour toi, mais pas si bien pour un ami. Cela peut également être le résultat d’un [surapprentissage](glossary://overfitting).
it: Inoltre, il modello potrebbe funzionare bene per te, ma non altrettanto bene per una persona amica. Anche questo potrebbe essere il risultato di un [sovradattamento](glossary://overfitting).
ja: また、あなたが使った場合はモデルがうまく動作しても、友達が使った場合にはそうならないかもしれません。これも[過適合](glossary://overfitting)が原因である可能性があります。
ko: 해당 모델은 여러분에게 잘 돌아가지만, 친구에게는 그렇지 않을 수 있습니다. [과적합](glossary://overfitting)의 결과일 수도 있습니다.
nl: Het kan ook zijn dat je model goed werkt voor jou, maar niet voor anderen. Dit kan ook worden veroorzaakt door [overspecialisatie](glossary://overfitting).
no: Det kan også hende at modellen fungerer bra for deg, men ikke like bra for andre. Det kan også skyldes [overtilpasning](glossary://overfitting).
pt: O modelo pode funcionar bem para você, mas não tão bem para outra pessoa. Isso também pode ser o resultado de um [sobreajuste](glossary://overfitting).
sv: Din modell kanske också fungerar bra för dig, men inte lika bra för en vän. Det kan också bero på [överpassning](glossary://overfitting).
th: โมเดลของคุณอาจทำงานได้ดีสำหรับคุณ แต่อาจไม่ดีเท่ากันสำหรับเพื่อนของคุณ ซึ่งเป็นผลมาจาก [overfitting](glossary://overfitting)
tr: Modelin senin için iyi çalışıyor ama bir arkadaşın için iyi çalışmıyor olabilir. Bu da [aşırı uyumun](glossary://overfitting) bir sonucu olabilir.
vi: Mô hình của bạn cũng có thể hoạt động tốt đối với bạn nhưng không tốt đối với bạn bè của bạn. Việc này cũng có thể là kết quả của việc [quá khớp](glossary://overfitting).
zh_cn: 你的模型还可能适用于你，但不适用于你的朋友。这也可能是[过拟合](glossary://overfitting)的结果。
zh_tw: 你的模型也可能適用你，但不適用於你的朋友。這也可能是[過度擬合](glossary://overfitting)的結果。
