Repository: JulioPr0/ml-rock-paper-scissors
Catalog: Rock, Paper, Scissors game with ML.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: If you don’t plan to use a lot of images to train the model, that’s OK. One way you can increase your training dataset is by using [image augmentation options](doc://com.apple.documentation/documentation/createml/mlimageclassifier/imageaugmentationoptions). Adding in these options, such as `.rotate`, `.translate`, and `.horizontallyFlip`, before a training session creates four new images per option you use. For example, using the `.rotate` option generates four new images and applies a random rotation angle to the new images.
de: Es ist okay, wenn du nicht geplant hast, viele Bilder zum Trainieren deines Modells zu verwenden. Du kannst den Trainingsdatensatz zum Beispiel mit [Optionen zum Erweitern der Bilder (Augmentation)](doc://com.apple.documentation/documentation/createml/mlimageclassifier/imageaugmentationoptions) erhöhen. Durch Hinzufügen von Optionen wie `.rotate` (drehen), `.translate` (übersetzen) oder `.horizontallyFlip` (horizontal spiegeln) vor einer Trainingssitzung werden vier neue Bilder für jede verwendete Option erstellt. Mit der `.rotate`-Option werden beispielsweise vier neue Bilder erstellt und ein zufälliger Drehwinkel auf die neuen Bilder angewendet.
es: Si no tienes previsto usar muchas imágenes para entrenar el modelo, no es problema. Una forma de aumentar el conjunto de datos es usando [opciones de aumento de la imagen](doc://com.apple.documentation/documentation/createml/mlimageclassifier/imageaugmentationoptions). Añadiendo estas opciones, como `.rotate`, `.translate` y `.horizontallyFlip`, antes de una sesión de entrenamiento se crean cuatro nuevas imágenes por opción que uses. Por ejemplo, al usar la opción `.rotate` se generan cuatro nuevas imágenes y se aplica a las nuevas imágenes un ángulo de giro aleatorio.
es_419: Está bien si no planeas usar muchas imágenes para entrenar tu modelo. Una forma de incrementar el conjunto de datos es usando [opciones de aumento para imágenes](doc://com.apple.documentation/documentation/createml/mlimageclassifier/imageaugmentationoptions). Agregar estas opciones, tales como `.rotate` (girar), `.translate` (traducir) u `.horizontallyFlip` (voltear horizontalmente), antes de una sesión de entrenamiento crea cuatro imágenes nuevas por cada opción utilizada. Por ejemplo, usar `.rotate` genera cuatro imágenes nuevas y les aplica un ángulo de rotación aleatorio.
fr: Si tu ne prévois pas d’utiliser beaucoup d’images pour entraîner ton modèle, ce n’est pas grave. Tu peux accroître ton ensemble de données d’apprentissage en utilisant des [options d’augmentation d’image](doc://com.apple.documentation/documentation/createml/mlimageclassifier/imageaugmentationoptions). L’ajout de ces options, telles que `.rotate`, `.translate` et `.horizontallyFlip`, avant une session d’entraînement crée quatre nouvelles images par option utilisée. Par exemple, l’utilisation de l’option `.rotate` génère quatre nouvelles images et applique un angle de rotation aléatoire aux nouvelles images.
it: Se non intendi utilizzare molte immagini per addestrare il modello, non c’è problema. Un modo per aumentare l’insieme di dati di addestramento è utilizzare [opzioni di trasformazione delle immagini](doc://com.apple.documentation/documentation/createml/mlimageclassifier/imageaugmentationoptions). Aggiungere tali opzioni, come `.rotate` (ruota), `.translate` (trasla) e `.horizontallyFlip` (capovolgi orizzontalmente), prima di una sessione di addestramento, crea quattro nuove immagini per opzione utilizzata. Ad esempio, se utilizzi l’opzione `.rotate`, vengono generate quattro nuove immagini con un angolo di rotazione casuale applicato a ognuna di esse.
ja: モデルの学習に多くのイメージを使用しないつもりでもOKです。学習データセットを増やす方法の1つは、[画像増加オプション](doc://com.apple.documentation/documentation/createml/mlimageclassifier/imageaugmentationoptions)を使用することです。そのオプションとして`.rotate`、`.translate`、`.horizontallyFlip`などを学習セッションの前に追加することで、使用した1つのオプションごとに4枚の新しいイメージが作成されます。例えば、`.rotate`オプションでは4枚の新しいイメージが生成され、新しいイメージにはランダムな回転角度が適用されます。
ko: 모델 훈련에 대량의 이미지를 사용할 계획이 아니라면 문제 없습니다. [image augmentation options](doc://com.apple.documentation/documentation/createml/mlimageclassifier/imageaugmentationoptions)을 사용하여 훈련 데이터 세트를 늘릴 수 있습니다. 훈련 세션 전에 `.rotate`, `.translate` 및 `.horizontallyFlip` 등의 옵션을 추가하면 사용하는 옵션당 4개의 새로운 이미지가 생성됩니다. 예를 들어, `.rotate` 옵션을 사용하여 4개의 새로운 이미지를 생성하고 여기에 임의의 회전각을 적용합니다.
nl: Het is geen probleem als je maar weinig afbeeldingen gebruikt voor het trainen van het model. Een van de manieren om je trainingsgegevensset te vergroten, is door [image augmentation options](doc://com.apple.documentation/documentation/createml/mlimageclassifier/imageaugmentationoptions) te gebruiken. Als je de opties `.rotate`, `.translate` of `.horizontallyFlip` toevoegt voorafgaand aan een trainingssessie, worden er vier nieuwe afbeeldingen aangemaakt voor elke optie die je gebruikt. Als je bijvoorbeeld de optie `.rotate` toepast, worden er vier nieuwe afbeeldingen aangemaakt waarop een willekeurige rotatiehoek wordt toegepast.
no: Du trenger ikke å bruke veldig mange bilder for å trene modellen. Én måte å utvide treningsdatasettet på er å bruke [bildeforbedringsvalg](doc://com.apple.documentation/documentation/createml/mlimageclassifier/imageaugmentationoptions). Hvis du legger til disse valgene, for eksempel `.rotate`, `.translate` og `.horizontallyFlip`, før en treningsøkt, lages det fire nye bilder per valg. Hvis du for eksempel bruker valget`.rotate`, lages det fire nye bilder, og det velges en tilfeldig rotasjonsvinkel for de nye bildene.
pt: Caso não planeje usar muitas imagens para treinar o modelo, tudo bem. Uma maneira de aumentar o conjunto de dados de treinamento é com [image augmentation options](doc://com.apple.documentation/documentation/createml/mlimageclassifier/imageaugmentationoptions). Ao adicionar essas opções, como `.rotate`, `.translate` e `.horizontallyFlip`, antes de uma sessão de treinamento, quatro novas imagens são criadas para cada opção usada. Por exemplo, se você usar a opção `.rotate`, quatro novas imagens serão geradas e um ângulo de rotação aleatório será aplicado às novas imagens.
sv: Det är OK om du inte tänker använda massor av bilder till att träna modellen. Ett sätt att öka träningens datauppsättning är att använda [bildförbättringsalternativ](doc://com.apple.documentation/documentation/createml/mlimageclassifier/imageaugmentationoptions). Om du lägger till de här alternativen, som `.rotate`, `.translate`, och `.horizontallyFlip`, före en träningssession skapas fyra nya bilder för varje alternativ du använder. När du exempelvis använder alternativet `.rotate` skapas fyra nya bilder och en slumpmässig rotationsvinkel används i de nya bilderna.
th: ถ้าคุณไม่ได้วางแผนจะใช้ภาพจำนวนมากเพื่อฝึกโมเดลก็ไม่เป็นไร วิธีหนึ่งที่คุณจะสามารถเพิ่มชุดข้อมูลการฝึกได้ก็คือการใช้[ตัวเลือกการเพิ่มภาพ](doc://com.apple.documentation/documentation/createml/mlimageclassifier/imageaugmentationoptions) การเพิ่มในตัวเลือกเหล่านี้ เช่น `.rotate`, `.translate` และ `.horizontallyFlip` ก่อนเซสชั่นการฝึก จะสร้างภาพใหม่สี่ภาพต่อตัวเลือกที่คุณใช้ ตัวอย่างเช่น การใช้ตัวเลือก `.rotate` จะสร้างภาพใหม่สี่ภาพและปรับใช้มุมการหมุนแบบสุ่มกับภาพใหม่เหล่านั้น
tr: Modeli eğitmek için çok fazla görüntü kullanmayı planlamıyorsan sorun değil. Eğitim veri kümeni artırmanın bir yolu, [görüntü artırma seçeneklerini](doc://com.apple.documentation/documentation/createml/mlimageclassifier/imageaugmentationoptions) kullanmaktır. Eğitim oturumundan önce bu seçenekler (`.rotate`, `.translate` ve `.horizontallyFlip` gibi) eklendiğinde kullandığın her bir seçenek için dört yeni görüntü yaratılır. Örneğin `.rotate` seçeneği kullanıldığında dört yeni görüntü oluşturulur ve yeni görüntülere rasgele döndürme açısı uygulanır.
vi: Nếu bạn không dự định sử dụng nhiều hình ảnh để huấn luyện một mô hình thì cũng không sao. Một cách mà bạn có thể gia tăng tập dữ liệu huấn luyện là sử dụng các [tùy chọn tăng cường hình ảnh](doc://com.apple.documentation/documentation/createml/mlimageclassifier/imageaugmentationoptions). Việc thêm những tùy chọn này, như `.rotate`, `.translate` và `.horizontallyFlip`, trước phiên huấn luyện sẽ tạo ra bốn hình ảnh mới cho mỗi tùy chọn mà bạn sử dụng. Ví dụ: sử dụng tùy chọn `.rotate` sẽ tạo ra bốn hình ảnh mới và áp dụng một góc xoay ngẫu nhiên cho các hình ảnh mới.
zh_cn: 如果你不打算使用大量的图像来训练模型，问题也不大。增加训练数据集的一种方法是使用[图像扩充选项](doc://com.apple.documentation/documentation/createml/mlimageclassifier/imageaugmentationoptions)。加入这些选项，如 `.rotate`（旋转）、`.translate`（转换）和 `.horizontallyFlip`（水平翻转），在训练之前为你使用的每个选项创建四个新图像。例如，使用 `.rotate` 选项会生成四个新图像，并为新图像应用随机的旋转角度。
zh_tw: 如果你不打算使用大量影像來訓練模型，那也沒關係。增加訓練資料集的一種方法是使用[影像增強選項](doc://com.apple.documentation/documentation/createml/mlimageclassifier/imageaugmentationoptions)。加入這些選項，如 `.rotate`、`.translate` 和 `.horizontallyFlip`，在訓練階段之前為你使用的每個選項製作四個新的影像。例如，使用 `.rotate` 選項會產生四個新影像，並將隨機旋轉角度套用到新的影像上。

source: You can augment your training data by adding these three options: `.rotate`, `.translate`, `.horizontallyFlip`.
de: Du kannst deine Trainingsdaten durch Hinzufügen von diesen drei Optionen erweitern: `.rotate` (drehen), `.translate` (übersetzen), `.horizontallyFlip` (horizontal spiegeln).
es: Puedes aumentar la cantidad de datos de aprendizaje añadiendo estas tres opciones: `.rotate`, `.translate`, `.horizontallyFlip`.
es_419: Puedes aumentar los datos de entrenamiento si agregas estas tres opciones: `.rotate`, `.translate` y `.horizontallyFlip`.
fr: Tu peux accroître tes données d’apprentissage en ajoutant ces trois options : `.rotate`, `.translate`, `.horizontallyFlip`.
it: Puoi aumentare i dati di addestramento aggiungendo queste tre opzioni: `.rotate`, `.translate`, `.horizontallyFlip`.
ja: 次の3つのオプションを追加して学習データを増やすことができます: `.rotate`、`.translate`、`.horizontallyFlip`。
ko: `.rotate`, `.translate`, `.horizontallyFlip`의 세 가지 옵션을 추가하여 훈련 데이터를 증강할 수 있습니다.
nl: Je kunt je trainingsgegevens uitbreiden door deze drie opties toe te voegen: `.rotate`, `.translate`, `.horizontallyFlip`.
no: Du kan forbedre treningsdataene ved å legge til disse tre valgene: `.rotate`, `.translate` og `.horizontallyFlip`.
pt: Para aumentar os dados de treinamento, você pode adicionar estas três opções: `.rotate`, `.translate`, `.horizontallyFlip`.
sv: Du kan förbättra träningsdata genom att lägga till de här tre alternativen: `.rotate`, `.translate` och `.horizontallyFlip`.
th: คุณสามารถเพิ่มข้อมูลการฝึกได้โดยเพิ่มตัวเลือกเหล่านี้: `.rotate`, `.translate`, `.horizontallyFlip`
tr: Eğitim verilerini bu üç seçeneği ekleyerek artırabilirsin: `.rotate`, `.translate`, `.horizontallyFlip`.
vi: Bạn có thể tăng cường dữ liệu huấn luyện của mình bằng cách thêm ba tùy chọn này: `.rotate`, `.translate`, `.horizontallyFlip`.
zh_cn: 你可以添加这三个选项来扩充训练数据：`.rotate`、`.translate`、`.horizontallyFlip`。
zh_tw: 你可以藉由加入這三個選項來擴充你的訓練資料：`.rotate`、`.translate` 和 `.horizontallyFlip`。

source: Now, when you train a new ML model, your training session automatically uses these augmentations to improve the model’s predictions.
de: Wenn du jetzt ein neues ML-Modell trainierst, verwendet deine Trainingssitzung automatisch die Erweiterungen, um die Vorhersagen des Modells zu verbessern.
es: Ahora, cuando entrenes un nuevo modelo ML, la sesión de entrenamiento utiliza automáticamente tres tipos de aumento para mejorar las predicciones del modelo.
es_419: Ahora, cuando entrenes un modelo de ML nuevo, tu sesión de entrenamiento usará automáticamente estas opciones de aumento para mejorar las predicciones del modelo.
fr: Désormais, lorsque tu entraînes un nouveau modèle d’apprentissage automatique, ta session d’entraînement utilise automatiquement ces augmentations pour améliorer les prédictions du modèle.
it: Adesso, quando addestri un nuovo modello di apprendimento automatico, la sessione di addestramento utilizza automaticamente queste trasformazioni per migliorare le previsioni.
ja: すると、新しい機械学習モデルを学習させるときに、学習セッションでこれらの増やしたイメージが自動的に使用され、モデルの予測が改善されます。
ko: 이제 새로운 ML 모델을 훈련할 때 훈련 세션에서 자동으로 이러한 증강을 사용하여 모델의 예측을 향상합니다.
nl: Als je nu een nieuw ML-model traint, worden deze uitbreidingen automatisch gebruikt tijdens een trainingssessie om de voorspellingen van het model te verbeteren.
no: Når du trener en ny maskinlæringsmodell, vil treningsøkten automatisk bruke disse forbedringene for å gjøre modellen mer treffsikker.
pt: Agora, quando você treinar um novo modelo de AM, a sessão de treinamento usará automaticamente esses aumentos para melhorar as previsões do modelo.
sv: Nu när du tränar en ny maskininlärningsmodell använder träningssessionen automatiskt de här förbättringarna till att öka träffsäkerheten i modellens förutsägelser.
th: ตอนนี้ เมื่อคุณฝึกโมเดล ML ใหม่ เซสชั่นการฝึกของคุณจะใช้การเพิ่มข้อมูลเหล่านี้โดยอัตโนมัติเพื่อปรับปรุงการคาดคะเนของโมเดล
tr: Artık yeni bir makine öğrenimi modeli eğittiğinde eğitim oturumun, modelin tahminlerini iyileştirmek için bu artırmaları otomatik olarak kullanır.
vi: Bây giờ, khi bạn huấn luyện một mô hình ML mới, phiên huấn luyện tự động sử dụng những phương pháp tăng cường này để cải thiện các dự đoán của mô hình.
zh_cn: 现在，当你训练新的机器学习模型时，训练会话将自动使用这些扩充选项来改善模型的预测。
zh_tw: 現在，當你訓練一個新的 ML 模型時，你的訓練階段會自動使用這些擴充內容來改進模型的預測。

source: Collect your own dataset
de: Eigenen Datensatz zusammenstellen
es: Recopilar tu conjunto de datos
es_419: Recopilar el conjunto de datos
fr: Collecter ton propre ensemble de données
it: Raccogliere un insieme di dati personalizzato
ja: 自分だけのデータセットを収集する
ko: 나만의 데이터 세트 수집하기
nl: Een eigen gegevensset samenstellen
no: Samle ditt eget datasett
pt: Colete o seu próprio conjunto de dados
sv: Samla in en egen datauppsättning
th: เก็บรวบรวมชุดข้อมูลของคุณเอง
tr: Kendi veri kümeni toplama
vi: Thu thập tập dữ liệu của chính bạn
zh_cn: 收集你自己的数据集
zh_tw: 收集你自己的資料集

source: Personalize a machine learning model by using your own hand pose images.
de: Personalisiere ein Modell für maschinelles Lernen mit Bildern deiner eigenen Handgesten.
es: Personaliza un modelo de aprendizaje automático usando tus propias imágenes de postura de manos.
es_419: Personaliza un modelo de aprendizaje automático usando tus propias imágenes de poses de mano.
fr: Personnalise un modèle d’apprentissage automatique en utilisant tes propres images de positions de la main.
it: Personalizza un modello di apprendimento automatico utilizzando immagini di pose delle mani tutte tue.
ja: 自分だけの手の形のイメージを使って機械学習モデルをパーソナライズします。
ko: 나만의 손 포즈 이미지를 사용하여 기계 학습 모델을 개인 맞춤화합니다.
nl: Personaliseer een model voor machinelearning door afbeeldingen van je eigen handgebaren te gebruiken.
no: Tilpass en maskinlæringsmodell ved å bruke dine egne bilder av håndtegn.
pt: Use imagens da sua própria mão para personalizar um modelo de aprendizado de máquina.
sv: Gör en maskininlärningsmodell personligare genom att använda dina egna bilder av handgester.
th: ปรับโมเดลการเรียนรู้ของเครื่องให้เหมาะกับคุณโดยใช้ภาพท่าทางมือของคุณเอง
tr: Kendi el pozu görüntülerini kullanarak bir makine öğrenimi modelini kişiselleştir.
vi: Cá nhân hóa mô hình học máy bằng cách sử dụng hình ảnh tư thế bàn tay của chính bạn.
zh_cn: 使用你自己的手势图像来个性化机器学习模型。
zh_tw: 使用你自己的手部姿勢影像來個人化機器學習模型。

source: In the preview, tap the Add (+) button in the top-right corner to create a new dataset. This opens a new training view.
de: Tippe rechts oben in der Vorschau auf die Taste zum Hinzufügen (+), um einen neuen Datensatz zu erstellen. Dadurch wird eine neue Trainingsansicht geöffnet.
es: En la previsualización, toca el botón Añadir (+) en la esquina superior derecha para crear un nuevo conjunto de datos. Esta acción abre una nueva vista de entrenamiento.
es_419: En la vista previa, toca el botón Agregar (+) en la esquina superior derecha para crear un nuevo conjunto de datos. Esto abrirá una nueva visualización de entrenamiento.
fr: Dans l’aperçu, touche le bouton d’ajout (+) situé en haut à droite pour créer un nouvel ensemble de données. Cela ouvre une nouvelle vue d’entraînement.
it: Nell’anteprima, tocca il pulsante Aggiungi (+) nell’angolo in alto a destra per creare un nuovo insieme di dati. Si aprirà una nuova vista di addestramento.
ja: プレビューで、右上隅の追加（+）ボタンをタップして新規データセットを作成します。新しい学習ビューが開きます。
ko: 미리보기에서 오른쪽 상단 모서리에 있는 추가(+) 버튼을 탭하여 새로운 데이터 세트를 만듭니다. 이렇게 하면 새로운 훈련 보기가 열립니다.
nl: Tik op de plusknop (+) in de rechterbovenhoek van de voorvertoning om een nieuwe gegevensset aan te maken. Hiermee open je een nieuwe trainingsweergave.
no: Trykk på Legg til-knappen (+) øverst til høyre i forhåndsvisningen for å opprette et nytt datasett. Dette åpner en ny treningsvisning.
pt: Na pré‑visualização, toque no botão Adicionar (+) no canto superior direito para criar um novo conjunto de dados. Isso abre uma nova visualização de treinamento.
sv: I den här förhandsvisningen skapar du en ny datauppsättning genom att trycka på lägg till-knappen (+) i det övre högra hörnet. Det här öppnar en ny träningsvy.
th: ในการแสดงตัวอย่าง ให้แตะปุ่มเพิ่ม (+) ที่มุมขวาบนสุดเพื่อสร้างชุดข้อมูลใหม่ การทำเช่นนี้จะเปิดมุมมองการฝึกใหม่
tr: Önizlemede, yeni bir veri kümesi yaratmak için sağ üst köşedeki Ekle (+) düğmesine dokun. Bu, yeni bir eğitim görüntüsü açar.
vi: Trong bản xem trước này, chạm vào nút Thêm (+) ở góc trên cùng bên phải để tạo ra một tập dữ liệu mới. Thao tác này mở một chế độ xem huấn luyện mới.
zh_cn: 在预览中，轻点右上角的“添加” (+) 按钮来创建新的数据集。这会打开新的训练视图。
zh_tw: 在預覽中，點一下右上角的加入（+）按鈕來建立新的資料集。這樣會打開一個新的訓練顯示區。

source: You can add new images to the new dataset by clicking into each category. Tap the Add button to open a [PhotosPicker view](doc://com.apple.documentation/documentation/photokit/photospicker) so you can access the images in your photo library.
de: Du kannst neue Bilder zum neuen Datensatz hinzufügen, indem du in die jeweilige Kategorie klickst. Tippe auf die Taste zum Hinzufügen, um eine [PhotosPicker-Ansicht](doc://com.apple.documentation/documentation/photokit/photospicker) zu öffnen, damit du auf die Bilder in deiner Fotomediathek zugreifen kannst.
es: Puedes añadir nuevas imágenes al nuevo conjunto de datos haciendo clic en cada categoría. Toca el botón Añadir para abrir la [visualización PhotosPicker](doc://com.apple.documentation/documentation/photokit/photospicker) para poder acceder a las imágenes de la fototeca.
es_419: Puedes agregar imágenes al nuevo conjunto de datos haciendo clic en cada categoría. Toca el botón Agregar para abrir la [visualización PhotosPicker](doc://com.apple.documentation/documentation/photokit/photospicker) y poder acceder a las imágenes de tu fototeca.
fr: Tu peux ajouter de nouvelles images à ton nouvel ensemble de données en cliquant dans chaque catégorie. Touche le bouton d’ajout pour ouvrir une [vue PhotosPicker](doc://com.apple.documentation/documentation/photokit/photospicker) afin d’accéder aux images de ta photothèque.
it: Puoi aggiungere nuove immagini all’insieme di dati facendo clic su ogni categoria. Tocca il pulsante Aggiungi per aprire una vista [PhotosPicker](doc://com.apple.documentation/documentation/photokit/photospicker) e accedere alle immagini nella libreria fotografica.
ja: それぞれのカテゴリをクリックすることで新しいイメージを新規データセットに追加できます。“追加”ボタンをタップして[PhotosPickerビュー](doc://com.apple.documentation/documentation/photokit/photospicker)を開くと、写真ライブラリのイメージにアクセスできます。
ko: 각 카테고리를 클릭하여 새로운 이미지를 새로운 데이터 세트에 추가할 수 있습니다. 추가 버튼을 탭하여 [PhotosPicker 보기](doc://com.apple.documentation/documentation/photokit/photospicker)를 열면 사진 보관함의 이미지에 접근할 수 있습니다.
nl: Je kunt nieuwe afbeeldingen aan de nieuwe gegevensset toevoegen door op de verschillende categorieën te klikken. Tik op de knop 'Voeg toe' om een [PhotosPicker view](doc://com.apple.documentation/documentation/photokit/photospicker) te openen waarmee je toegang hebt tot de foto's in je fotobibliotheek.
no: Du kan legge til nye bilder i det nye datasettet ved å klikke i hver kategori. Trykk på Legg til-knappen for å åpne en [PhotosPicker-visning](doc://com.apple.documentation/documentation/photokit/photospicker), slik at du får tilgang til bildene i bildebiblioteket ditt.
pt: Você pode clicar em cada categoria para adicionar novas imagens ao conjunto de dados. Toque no botão Adicionar para abrir uma [PhotosPicker view](doc://com.apple.documentation/documentation/photokit/photospicker) e acessar as imagens na fototeca.
sv: Du kan lägga till nya bilder i den nya datauppsättningen genom att klicka i varje kategori. Tryck på knappen Lägg till för att öppna en [PhotosPicker-vy](doc://com.apple.documentation/documentation/photokit/photospicker) där du kommer åt bilderna i ditt bildbibliotek.
th: คุณสามารถเพิ่มภาพใหม่ไปยังชุดข้อมูลได้โดยคลิกในแต่ละหมวดหมู่ แตะปุ่มเพิ่มเพื่อเปิด[มุมมอง PhotosPicker](doc://com.apple.documentation/photokit/photospicker) เพื่อให้คุณสามารถเข้าถึงภาพในคลังรูปภาพของคุณได้
tr: Her bir kategoriyi tıklayarak yeni veri kümesine yeni görüntü ekleyebilirsin. Fotoğraf arşivindeki görüntülere erişebilmek amacıyla bir fotoğraf seçici ([PhotosPicker](doc://com.apple.documentation/documentation/photokit/photospicker)) görüntüsü açmak için Ekle düğmesine dokun.
vi: Bạn có thể thêm các hình ảnh mới vào tập dữ liệu mới bằng cách bấm vào từng danh mục. Chạm vào nút Thêm để mở một [chế độ xem PhotosPicker](doc://com.apple.documentation/documentation/photokit/photospicker) để bạn có thể truy cập các hình ảnh trong thư viện ảnh của mình.
zh_cn: 你可以点按进入每个类别来给新数据集添加新图像。轻点“添加”按钮来打开 [PhotosPicker 视图](doc://com.apple.documentation/documentation/photokit/photospicker)（照片选择器视图），这样你就可以访问照片图库中的图像了。
zh_tw: 你可以透過點按每個類別來將新的影像加入新資料集中。點按加入按鈕來打開 [PhotosPicker 顯示區](doc://com.apple.documentation/documentation/photokit/photospicker)，以便你可以取用照片圖庫中的影像。

source: Choose at least seven images for each category.
de: Wähle mindestens sieben Bilder für jede Kategorie aus.
es: Selecciona al menos siete imágenes de cada categoría.
es_419: Selecciona al menos siete imágenes de cada categoría.
fr: Choisis au moins sept images pour chaque catégorie.
it: Scegli almeno sette immagini per ciascuna categoria.
ja: それぞれのカテゴリに少なくとも7枚のイメージを選択します。
ko: 각 카테고리에 대해 최소 7개의 이미지를 선택합니다.
nl: Kies minimaal zeven afbeeldingen uit elke categorie.
no: Velg minst syv bilder for hver kategori.
pt: Escolha ao menos sete imagens para cada categoria.
sv: Välj minst sju bilder för varje kategori.
th: เลือกอย่างน้อยเจ็ดภาพสำหรับแต่ละหมวดหมู่
tr: Her bir kategori için en az yedi görüntü seçin.
vi: Chọn tối thiểu 7 hình ảnh cho mỗi danh mục.
zh_cn: 每个类别至少选取七张图像。
zh_tw: 每一個類別選擇至少七個影像。
