Repository: JulioPr0/ml-rock-paper-scissors
Catalog: Rock, Paper, Scissors game with ML.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Take a moment to go through your dataset and recall the tips from the previous walkthrough on how to clean your data. Can you find any images that you need to remove from the training set? You can remove images in each category’s dataset by tapping the Edit button in the top-right corner.
de: Nimm dir einen Moment Zeit, um deinen Datensatz durchzuschauen und dich an die Tipps aus der letzten Anleitung zu erinnern, in der es um das Bereinigen deiner Daten ging. Findest du Bilder, die du aus deinem Trainingsdatensatz entfernen musst? Du kannst Bilder aus den jeweiligen Kategorien eines Datensatzes löschen, indem du rechts oben auf die Taste „Bearbeiten“ tippst.
es: Tómate unos momentos para repasar el conjunto de datos y recuerda los consejos del recorrido anterior para limpiar los datos. ¿Ves alguna imagen que haya que eliminar del conjunto de datos? Para eliminar imágenes del conjunto de cada categoría, toca el botón Edit en la esquina superior derecha.
es_419: Tómate un momento para revisar tu conjunto de datos y recuerda los consejos del tutorial anterior sobre cómo limpiar los datos. ¿Ves alguna imagen que debas eliminar del conjunto? Puedes eliminar imágenes del conjunto de cada categoría; para esto, toca el botón Edit (editar) en la esquina superior derecha.
fr: Prends un moment pour étudier ton ensemble de données et te souvenir des astuces des explications précédentes sur le nettoyage de tes données. Peux-tu trouver des images que tu dois supprimer de ton ensemble d’entraînement ? Tu peux supprimer des images dans l’ensemble de données de chaque catégorie en touchant le bouton de modification dans l’angle supérieur droit.
it: Prenditi un momento per ricontrollare l’insieme di dati e ricordati i consigli della guida dettagliata precedente su come perfezionare i tuoi dati. Ci sono immagini che devono essere rimosse dai dati di addestramento? Puoi rimuovere immagini nell’insieme di dati di ciascuna categoria toccando il pulsante Modifica nell’angolo in alto a destra.
ja: 少し時間を取ってデータセットを一通り見ながら、データクリーニングに関する以前のガイドで教わったヒントを思い出してください。学習セットから削除する必要があるイメージはありますか? それぞれのカテゴリのデータセットでイメージを削除するには、右上隅の“編集”ボタンをタップします。
ko: 잠시 시간을 내어 데이터 세트를 살펴보고 데이터를 정리하는 방법에 대한 이전 설명의 팁을 생각해 보세요. 훈련 세트에서 제거해야 할 이미지가 있나요? 오른쪽 상단 모서리의 편집 버튼을 탭하여 각 카테고리의 데이터 세트에서 이미지를 제거할 수 있습니다.
nl: Neem even de tijd om je gegevensset te bekijken en denk hierbij aan de tips uit de vorige walkthrough over het opschonen van je gegevens. Kun je afbeeldingen vinden die uit de trainingsset moeten worden verwijderd? Je kunt afbeeldingen uit de gegevensset van elke categorie verwijderen door in de rechterbovenhoek op de knop 'Wijzig' te tikken.
no: Bruk litt tid til å gå gjennom datasettet. Husk tipsene om hvordan du kan rydde i dataene. Finner du bilder som må fjernes fra treningssettet? Du kan fjerne bilder fra datasettet for hver kategori ved å trykke på Rediger-knappen øverst til høyre.
pt: Analise com calma o conjunto de dados e lembre‑se das dicas do passo a passo anterior sobre como limpar os dados. Você consegue encontrar imagens que precisam ser removidas do conjunto de treinamento? Para remover imagens do conjunto de dados de cada categoria, toque no botão Editar no canto superior direito.
sv: Ägna ett ögonblick åt att gå igenom din datauppsättning och tänk på tipsen från den tidigare genomgången om hur du rensar data. Kan du hitta några bilder som du behöver ta bort från träningsuppsättningen? Du kan ta bort bilder i varje kategoris datauppsättning genom att klicka på knappen Ändra i det övre högra hörnet.
th: ใช้เวลาสักครู่เพื่อตรวจสอบชุดข้อมูลของคุณและนึกถึงเคล็ดลับจากการสาธิตที่ผ่านมาเกี่ยวกับวิธีทำความสะอาดข้อมูล คุณพบภาพที่คุณต้องเอาออกจากชุดการฝึกหรือไม่ คุณสามารถเอาภาพในแต่ละหมวดหมู่ของชุดข้อมูลออกได้โดยแตะที่ปุ่มแก้ไขที่มุมขวาบนสุด
tr: Biraz zaman ayırıp veri kümeni gözden geçir ve verilerini temizleme konusunda bir önceki kılavuzda verilen ipuçlarını anımsa. Eğitim kümesinden silmen gereken bir görüntü bulabilecek misin? Sağ üst köşedeki Düzenle düğmesine dokunarak her bir kategorinin veri kümesindeki görüntüleri silebilirsin.
vi: Hãy dành giây lát để xem xét kỹ lưỡng tập dữ liệu và nhớ lại các mẹo từ phần hướng dẫn trước đó về cách làm sạch dữ liệu của bạn. Bạn có tìm thấy bất kỳ hình ảnh nào cần xóa khỏi tập dữ liệu huấn luyện không? Bạn có thể xóa hình ảnh trong tập dữ liệu của từng danh mục bằng cách chạm vào nút Sửa ở góc trên cùng bên phải.
zh_cn: 花点时间浏览一下数据集，回想一下前面的演示中关于如何清理数据的提示。你能找到需要从训练集中移除的图像吗？你可以通过轻点右上角的“编辑”按钮，来移除每个类别数据集中的图像。
zh_tw: 花一點時間瀏覽你的資料集，並回憶上一個演練中有關如何清理資料的提示。你能找出任何需要從訓練集中刪除的影像嗎？你可以點按右上角的「編輯」按鈕來刪除每個類別的資料集中的影像。

source: When you’re happy with your dataset, give your machine learning model a name in the training view’s text field.
de: Wenn du mit deinem Datensatz zufrieden bist, gib im Textfeld der Trainingsansicht einen Namen für dein ML-Modell ein.
es: Cuando te parezca que el conjunto de datos es satisfactorio, da un nombre al modelo de aprendizaje automático en el campo de texto de la visualización de entrenamiento.
es_419: Cuando estés conforme con el conjunto de datos, asígnale un nombre a tu modelo de aprendizaje automático en el campo de texto de la visualización de entrenamiento.
fr: Lorsque ton ensemble de données te convient, donne un nom à ton modèle d’apprentissage automatique dans le champ de texte de la vue d’entraînement.
it: Quando l’insieme di dati ti soddisfa, assegna un nome al modello di apprendimento automatico nel campo di testo della vista di addestramento.
ja: データセットが満足のいくものになったら、学習ビューのテキストフィールドで機械学習モデルに名前をつけます。
ko: 데이터 세트가 마음에 들면 기계 학습 모델의 이름을 훈련 보기의 텍스트 필드에 지정하세요.
nl: Wanneer je tevreden bent met je gegevensset, geef je je model voor machinelearning een naam in het tekstveld van de trainingsweergave.
no: Når du er fornøyd med datasettet, gir du maskinlæringsmodellen et navn i tekstfeltet i treningsvisningen.
pt: Quando você estiver contente com o conjunto de dados, dê um nome ao modelo de aprendizado de máquina no campo de texto da visualização de treinamento.
sv: När du är nöjd med datauppsättningen namnger du maskininlärningsmodellen i träningsvyns textfält.
th: เมื่อคุณพอใจกับชุดข้อมูลของคุณแล้ว ให้ตั้งชื่อโมเดลการเรียนรู้ของเครื่องของคุณในช่องป้อนข้อความของมุมมองการฝึก
tr: Veri kümenden memnunsan eğitim görüntüsünün metin alanında makine öğrenimi modeline bir ad ver.
vi: Khi bạn hài lòng với tập dữ liệu của mình, hãy đặt tên cho mô hình học máy của bạn trong trường văn bản của chế độ xem huấn luyện.
zh_cn: 当你对数据集满意时，在训练视图的文本栏中，给你的机器学习模型起个名字。
zh_tw: 如果你對資料集感到滿意，請在訓練顯示區的文字欄位中為你的機器學習模型命名。

source: Now, tap the Train button to train a new ML model!
de: Tippe dann auf die Taste „Trainieren“, um ein neues ML-Modell zu trainieren!
es: Ahora, toca el botón Train para entrenar un nuevo modelo de ML.
es_419: Ahora, toca el botón Train (entrenar) para entrenar un modelo de ML nuevo.
fr: Maintenant, touche le bouton Train pour entraîner un nouveau modèle d’apprentissage automatique !
it: Adesso tocca il pulsante Addestra per addestrare un nuovo modello di apprendimento automatico!
ja: それでは、“学習”ボタンをタップして新しい機械学習モデルを学習させましょう!
ko: 이제 훈련 버튼을 탭하여 새로운 ML 모델을 훈련하세요!
nl: Tik nu op de knop 'Train' om je nieuwe ML-model te trainen!
no: Trykk på Tren-knappen for å trene en ny maskinlæringsmodell.
pt: Agora, toque no botão Treinar para treinar um novo modelo de AM!
sv: Tryck nu på knappen Träna för att träna en ny maskininlärningsmodell!
th: ตอนนี้ ให้แตะปุ่มฝึกเพื่อฝึกโมเดล ML ใหม่!
tr: Şimdi yeni bir makine öğrenimi modelini eğitmek için Eğit düğmesine dokun!
vi: Bây giờ, hãy chạm vào nút Huấn luyện để huấn luyện một mô hình ML mới!
zh_cn: 现在，轻点“训练”按钮来训练新的机器学习模型！
zh_tw: 現在，點一下「訓練」按鈕來訓練新的 ML 模型！

source: Compare your machine learning models
de: Modelle für maschinelles Lernen vergleichen
es: Comparar los modelos de aprendizaje automático
es_419: Comparar los modelos de ML
fr: Comparer tes modèles d’apprentissage automatique
it: Confrontare i modelli di apprendimento automatico
ja: 機械学習モデルを比較する
ko: 기계 학습 모델 비교하기
nl: De ML-modellen vergelijken
no: Sammenlign maskinlæringsmodellene dine
pt: Compare os modelos de aprendizado de máquina
sv: Jämför dina maskininlärningsmodeller
th: เปรียบเทียบโมเดลการเรียนรู้ของเครื่องของคุณ
tr: Makine öğrenimi modellerini karşılaştırma
vi: So sánh các mô hình học máy của bạn
zh_cn: 对比你的机器学习模型
zh_tw: 比較你的機器學習模型

source: You now have three machine learning models available to you. Test them individually and observe their similarities and differences.
de: Du hast jetzt drei Modelle für maschinelles Lernen zur Auswahl. Teste sie einzeln und beobachte, welche Ähnlichkeiten und Unterschiede es gibt.
es: Ahora tienes tres modelos de aprendizaje automático a tu disposición. Pruébalos por separado y fíjate en sus similitudes y diferencias.
es_419: Ahora tienes tres modelos a tu disposición. Pruébalos por separado y observa sus similitudes y sus diferencias.
fr: Tu as désormais trois modèles d’apprentissage automatique à ta disposition. Teste-les individuellement et observe leurs similarités et leurs différences.
it: Adesso hai a disposizione tre modelli di apprendimento automatico. Testali individualmente e osserva le loro similarità e differenze.
ja: 今は3つの機械学習モデルが使用できます。個別にテストして、共通点と相違点を観察してみましょう。
ko: 이제 세 가지 기계 학습 모델을 사용할 수 있습니다. 개별적으로 테스트하고 유사점과 차이점을 관찰합니다.
nl: Er zijn nu drie modellen voor machinelearning beschikbaar. Test ze één voor één om te zien welke overeenkomsten en verschillen er zijn.
no: Nå har du tilgang til tre maskinlæringsmodeller. Test hver av dem, og legg merke til likhetene og forskjellene.
pt: Agora você tem três modelos de aprendizado de máquina à sua disposição. Teste‑os individualmente e observe suas similaridades e diferenças.
sv: Nu har du tre tillgängliga maskininlärningsmodeller. Testa dem enskilt och lägg märke till deras likheter och skillnader.
th: ตอนนี้คุณมีสามโมเดลการเรียนรู้ของเครื่องที่สามารถใช้ได้ ให้ทดสอบทีละโมเดลและสังเกตความเหมือนและความแตกต่างของโมเดลเหล่านั้น
tr: Artık kullanabileceğin üç makine öğrenimi modeli var. Bunları tek tek test et ve aralarındaki benzerlikleri ve farklılıkları gözlemle.
vi: Bây giờ, bạn có ba mô hình học máy khả dụng. Hãy kiểm tra chúng riêng lẻ và quan sát những điểm giống nhau và khác nhau của chúng.
zh_cn: 现在，你有三个机器学习模型可以使用。分别测试一下它们，观察它们的相似点和不同点。
zh_tw: 你現在可以使用三個機器學習模型。請單獨測試它們並觀察它們的相似之處和差異。

source: Tap the “ML Models” button to see which models are available to you. If you have multiple ML models listed, tap one that isn’t selected and go back to the debug view to see how it performs.
de: Tippe auf die Taste „ML-Modelle“, um die verfügbaren Modelle anzuzeigen. Wenn mehrere ML-Modelle aufgelistet werden, tippe auf eines, das noch nicht ausgewählt ist, und gehe dann zurück zur Debugging-Ansicht. Dort kannst du dir dann anschauen, wie es arbeitet.
es: Toca el botón “ML Models” (Modelos de ML) para ver qué modelos tienes a tu disposición. Si tienes varios modelos de ML, toca uno que no esté seleccionado y vuelve a la visualización de depuración para ver qué tal funciona.
es_419: Toca el botón ML Models (modelos de ML) para ver cuáles están disponibles. Si tienes varios, toca uno que no esté seleccionado y regresa a la visualización de depuración para ver su funcionamiento.
fr: Touche le bouton « ML Models » pour voir les modèles à ta disposition. Si la liste contient plusieurs modèles d’apprentissage automatique, touches-en un qui n’est pas sélectionné et retourne à la vue de débogage pour voir ses performances.
it: Tocca il pulsante “Modelli apprendimento automatico” (ML Models) per visualizzare i modelli disponibili. Se nell’elenco sono presenti più modelli, toccane uno non selezionato e torna alla vista di debug per visualizzarne le prestazioni.
ja: “機械学習モデル”ボタンをタップして、どのモデルが使用可能か確認します。複数の機械学習モデルが表示されたら、選択されていないものをタップし、デバッグビューに戻って性能を確認します。
ko: ‘ML 모델’ 버튼을 탭하여 사용 가능한 모델을 확인하세요. 나열된 ML 모델이 여러 개인 경우 선택하지 않은 모델을 누르고 디버깅 보기로 돌아가 어떻게 작동되는지 확인합니다.
nl: Tik op de knop 'ML-modellen' om te zien welke modellen beschikbaar zijn. Als er meerdere ML-modellen worden weergegeven, tik je op een model dat nog niet geselecteerd is. Vervolgens ga je terug naar de foutopsporingsweergave om te zien hoe het model presteert.
no: Trykk på Maskinlæringsmodeller-knappen for å se hvilke modeller som er tilgjengelige for deg. Hvis det er flere maskinlæringsmodeller i listen, trykker du på en som ikke er markert, og deretter går du tilbake til feilsøkingsvisningen for å se hvordan den fungerer.
pt: Toque no botão “Modelos de AM” para ver quais modelos estão disponíveis. Se houver vários modelos de AM na lista, toque em um que não esteja selecionado e volte à visualização de depuração para ver como ele funciona.
sv: Tryck på knappen Maskininlärningsmodeller för att se vilka modeller som är tillgängliga för dig. Om det finns flera maskininlärningsmodeller i listan trycker du på en som inte är vald och återgår till felsökningsvyn för att se hur den presterar.
th: แตะปุ่ม “โมเดล ML” เพื่อดูว่าโมเดลใดที่คุณสามารถใช้ได้ ถ้าคุณมีหลายโมเดล ML แสดงอยู่ ให้แตะโมเดลที่ไม่ถูกเลือกอยู่แล้วย้อนกลับไปยังมุมมองแก้บั๊กเพื่อดูว่าโมเดลทำงานอย่างไร
tr: Hangi modelleri kullanabileceğini görmek için “Makine Öğrenimi Modelleri” düğmesine dokun. Birden fazla makine öğrenimi modeli listeleniyorsa seçili olmayan birine dokun ve modelin performansını görmek için hata ayıklama görüntüsüne dön.
vi: Chạm vào nút “Mô hình ML” để xem những mô hình nào khả dụng với bạn. Nếu bạn có nhiều mô hình ML được liệt kê, hãy chạm vào mô hình không được chọn và quay lại chế độ xem gỡ lỗi để xem cách hoạt động.
zh_cn: 轻点“机器学习模型”按钮，看看哪些模型可以使用。如果列出了多个机器学习模型，你可以轻点一个未选中的模型，然后回到调试视图看看它的表现如何。
zh_tw: 點按「ML 模型」按鈕來檢視你可以使用哪些模型。如果列出了多個 ML 模型，請點按未選取的模型並返回除錯顯示區來查看它的執行狀況。
