Repository: JulioPr0/ml-rock-paper-scissors
Catalog: Rock, Paper, Scissors game with ML.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: In your preview, choose an existing [training dataset](glossary://training%20dataset). A training dataset is a dataset that the model trains on to generate its predictions. In this case, the dataset is a collection of images showing various hand poses.
de: Wähle in der Vorschau einen vorhandenen [Trainingsdatensatz](glossary://training%20dataset) aus. Ein Trainingsdatensatz ist ein Datensatz, mit dem ein Modell trainiert, um Vorhersagen erstellen zu können. In diesem Fall ist der Datensatz eine Sammlung von Bildern mit verschiedenen Handgesten.
es: En la previsualización, selecciona un [conjunto de datos de aprendizaje](glossary://training%20dataset). Un conjunto de datos de aprendizaje es un conjunto que usa el modelo para entrenarse y generar sus predicciones. En este caso, el conjunto de datos es una colección de imágenes de distintas posturas de manos.
es_419: En la vista previa, elige un [conjunto de datos de entrenamiento](glossary://training%20dataset) existente. El modelo usará este conjunto para realizar el proceso de entrenamiento para generar predicciones. En este caso, el conjunto de datos es una colección de imágenes con varias poses de mano.
fr: Dans ton aperçu, choisis un [ensemble de données d’apprentissage](glossary://training%20dataset) existant. Il s’agit d’un ensemble de données sur lequel le modèle s’entraîne pour générer ses prédictions. Dans notre cas, l’ensemble de données est une collection d’images montrant plusieurs positions de la main.
it: Nell’anteprima, scegli un [insieme di dati di addestramento](glossary://training%20dataset) (Training Dataset) esistente. Un insieme di dati di addestramento è un insieme di dati su cui il modello si addestra per generare le proprie previsioni. In questo caso, l’insieme di dati è una raccolta di immagini che mostra varie pose di mani.
ja: プレビューで、既存の[学習データセット](glossary://training%20dataset)を選択します。学習データセットとは、モデルが予測を生成するための学習に使用するデータセットです。今回の場合、データセットはさまざまな手の形を写したイメージを集めたものです。
ko: 미리보기에서 기존 [훈련 데이터 세트](glossary://training%20dataset)를 선택합니다. 훈련 데이터 세트는 모델이 예측을 생성하기 위해 훈련하는 데이터 세트입니다. 여기서, 데이터 세트는 다양한 손 포즈를 보여주는 이미지의 모음입니다.
nl: Kies een bestaande [trainingsgegevensset](glossary://training%20dataset) in de voorvertoning. Een trainingsgegevensset is een gegevensset waarmee het model traint om voorspellingen te genereren. In dit geval is de gegevensset een verzameling met afbeeldingen van verschillende handgebaren.
no: Velg et eksisterende [treningsdatasett](glossary://training%20dataset) i forhåndsvisningen. Et treningsdatasett er et datasett som modellen trener med for å generere prediksjoner. I dette tilfellet er datasettet en samling av bilder som viser forskjellige håndtegn.
pt: Na pré‑visualização, escolha um [conjunto de dados de treinamento](glossary://training%20dataset) existente. Um conjunto de dados de treinamento é um conjunto de dados com o qual o modelo treina para gerar as previsões. Neste caso, o conjunto de dados é uma coleção de imagens que mostram vários sinais com a mão.
sv: Välj en befintlig [träningsdatauppsättning](glossary://training%20dataset) i förhandsvisningen. En träningsdatauppsättning är en datauppsättning som modellen tränar på för att skapa sina förutsägelser. I det här fallet är datauppsättningen en samling med bilder som visar olika handgester.
th: ในการแสดงตัวอย่างของคุณ ให้เลือก[ชุดข้อมูลการฝึก](glossary://training%20dataset)ที่มีอยู่ ชุดข้อมูลการฝึกคือชุดข้อมูลที่โมเดลใช้ฝึกเพื่อสร้างการคาดคะเน ในกรณีนี้ ชุดข้อมูลคือคอลเลกชั่นของภาพที่แสดงหลากหลายท่าทางมือ
tr: Önizlemende, var olan bir [eğitim veri kümesini](glossary://training%20dataset) seç. Eğitim veri kümesi, modelin, tahminlerini oluşturmak için eğitildiği veri kümesidir. Bu durumda veri kümesi, çeşitli el pozlarını gösteren görüntülerin bir koleksiyonudur.
vi: Trong bản xem trước của bạn, hãy chọn một [tập dữ liệu huấn luyện](glossary://training%20dataset) hiện có. Tập dữ liệu huấn luyện là tập dữ liệu mà mô hình sử dụng để huấn luyện nhằm tạo ra các dự đoán. Trong trường hợp này, tập dữ liệu là một tập hợp các hình ảnh cho thấy các tư thế bàn tay khác nhau.
zh_cn: 在预览中，选取一个现有的[训练数据集](glossary://training%20dataset)。训练数据集是模型用来训练以生成预测结果的数据集。在本例中，数据集是显示各种手势的图像集合。
zh_tw: 在預覽中選擇現有的[訓練資料集](glossary://training%20dataset)。訓練資料集是模型進行訓練以產生其預測結果的資料集。在這個例子中，資料集是顯示各種手部姿勢的影像集合。

source: Give your machine learning model a name; for example, `firstMLModel`.
de: Gib deinem Modell für maschinelles Lernen einen Namen, zum Beispiel `firstMLModel` (erstes ML-Modell).
es: Ponle un nombre al modelo de aprendizaje automático; por ejemplo, `firstMLModel`.
es_419: Asígnale un nombre a tu modelo de aprendizaje automático, como `firstMLModel`.
fr: Donne un nom à ton modèle d’apprentissage automatique, par exemple : `firstMLModel`.
it: Dai al tuo modello di apprendimento automatico un nome, ad asempio, `firstMLModel`.
ja: 機械学習に、`firstMLModel`といった名前をつけます。
ko: 기계 학습 모델의 이름을 지정합니다(예: `firstMLModel`).
nl: Geef je model voor machinelearning een naam, bijvoorbeeld `eersteMLModel`.
no: Gi maskinlæringsmodellen et navn, for eksempel `firstMLModel`.
pt: Dê um nome ao modelo de aprendizado de máquina; por exemplo, `firstMLModel`.
sv: Ge maskininlärningsmodellen ett namn, till exempel `firstMLModel`.
th: ตั้งชื่อให้โมเดลการเรียนรู้ของเครื่องของคุณ ตัวอย่างเช่น `firstMLModel`
tr: Makine öğrenimi modeline bir ad ver (örneğin `firstMLModel`).
vi: Đặt tên cho mô hình học máy của bạn; ví dụ như `firstMLModel`.
zh_cn: 给你的机器学习模型起个名字；例如，`firstMLModel`（第一个机器学习模型）。
zh_tw: 為你的機器學習模型命名，例如 `firstMLModel`。

source: Optionally, choose an existing [validation dataset](glossary://validation%20dataset) using the picker below your training dataset. The validation dataset isn’t used to train the model. Instead, the validation dataset’s used to give an estimate of how good its predictions are.
de: Als Alternative kannst du einen bestehenden [Prüfungsdatensatz](glossary://validation%20dataset) über die Auswahloption auswählen, die sich unter deinem Trainingsdatensatz befindet. Der Prüfungsdatensatz wird nicht dazu verwendet, das Modell zu trainieren, sondern um einzuschätzen, wie gut die Vorhersagen sind.
es: Como opción, selecciona un [conjunto de datos de validación](glossary://validation%20dataset) usando el selector que aparece debajo del conjunto de datos de entrenamiento. El conjunto de datos de validación no se utiliza para entrenar el modelo, sino para dar una estimación del grado de acierto de sus predicciones.
es_419: De forma opcional, puedes elegir un [conjunto de datos de validación](glossary://validation%20dataset) usando el selector que está debajo de tu conjunto de datos de entrenamiento. Este conjunto de validación no se usa para entrenar el modelo, sino que se usa para calcular qué tan precisas son sus predicciones.
fr: Si tu le souhaites, choisis un [ensemble de données de validation](glossary://validation%20dataset) existant à l’aide du sélecteur situé sous ton ensemble de données d’apprentissage. L’ensemble de données de validation n’est pas utilisé pour entraîner le modèle, mais pour donner une estimation de la qualité de ses prédictions.
it: Facoltativamente, scegli un [insieme di dati di convalida](glossary://validation%20dataset) (Validation Dataset) esistente utilizzando il selettore sotto l’insieme di dati di addestramento. L’insieme di dati di convalida non è usato per addestrare il modello, bensì per fornire una stima di quanto sono corrette le sue previsioni.
ja: オプションとして、学習データセットの下のピッカーを使って既存の[検証データセット](glossary://validation%20dataset)を選択します。検証データセットはモデルの学習には使用されず、モデルの予測の良さを推定するのに使用されます。
ko: 또는 훈련 데이터 세트 아래의 선택기를 사용하여 기존 [유효성 확인 데이터 세트](glossary://validation%20dataset)를 선택해 보세요. 유효성 확인 데이터 세트는 모델을 훈련하는 데 사용되지 않습니다. 대신, 예측의 정확도를 추정하는 데 사용됩니다.
nl: Als je wilt, kun je een bestaande [validatiegegevensset](glossary://validation%20dataset) selecteren met de kiezer onder de trainingsgegevensset. De validatiegegevensset wordt niet gebruikt om het model te trainen, maar om in te schatten hoe goed de voorspellingen van het model zijn.
no: Du kan også velge et eksisterende [valideringsdatasett](glossary://validation%20dataset) med velgeren under treningsdatasettet. Valideringsdatasettet brukes ikke til å trene modellen, men til å vurdere hvor gode modellens prediksjoner er.
pt: Opcionalmente, use o seletor abaixo do conjunto de dados de treinamento para escolher um [conjunto de dados de validação](glossary://validation%20dataset) existente. O conjunto de dados de validação não é usado para treinar o modelo, e sim para dar uma estimativa do quão boas as previsões são.
sv: Du kan också välja en befintlig [valideringsdatauppsättning](glossary://validation%20dataset) med väljaren nedanför träningsdatauppsättningen. Valideringsdatauppsättningen används inte till att träna modellen. Istället används valideringsdatauppsättningen till att ge en uppskattning av hur bra dess förutsägelser är.
th: หรือเลือก[ชุดข้อมูลการตรวจสอบ](glossary://validation%20dataset)ที่มีอยู่โดยใช้ตัวเลือกด้านล่างชุดข้อมูลการฝึกของคุณ ชุดข้อมูลการตรวจสอบจะไม่ถูกใช้เพื่อฝึกโมเดล แต่ชุดข้อมูลการฝึกจะใช้เพื่อประมาณการว่าการคาดคะเนของโมเดลดีเพียงใดแทน
tr: İsteğe bağlı olarak, eğitim veri kümesinin altındaki seçiciyi kullanarak var olan bir [doğrulama veri kümesini](glossary://validation%20dataset) seç. Doğrulama veri kümesi, modeli eğitmek için kullanılmaz. Bunun yerine, modelin tahminlerinin ne kadar iyi olduğununa dair tahminde bulunmak için kullanılır.
vi: Tùy ý chọn một [tập dữ liệu xác thực](glossary://validation%20dataset) hiện có bằng cách sử dụng bộ chọn bên dưới tập dữ liệu huấn luyện của bạn. Tập dữ liệu xác thực không được sử dụng để huấn luyện mô hình. Thay vào đó, tập dữ liệu xác thực được sử dụng để cung cấp ước tính về độ chính xác của các dự đoán.
zh_cn: 你也可以使用训练数据集下方的选择器，选取一个现有的[验证数据集](glossary://validation%20dataset)。验证数据集不用于训练模型，而是用于估计模型预测的准确度。
zh_tw: 或者，使用訓練資料集下方的選擇器來選取現有的[驗證資料集](glossary://validation%20dataset)。驗證資料集不會用來訓練模型。相反的，驗證資料集是用來評估其預測的好壞。

source: If you want to take a look at the dataset’s images, tap on each individual dataset cell. This navigates you to a grid of images for that particular hand pose dataset.
de: Wenn du einen Blick auf die Bilder im Datensatz werfen willst, tippe auf die jeweilige Datensatzzelle. Auf diese Weise gelangst du zu einem Bilderraster für den entsprechenden Handgesten-Datensatz.
es: Si quieres echar un vistazo a las imágenes del conjunto de datos, toca en cada una de las celdas. De esta manera irás a una cuadrícula de imágenes de ese conjunto de datos de posturas de manos concreto.
es_419: Si quieres ver de cerca las imágenes del conjunto de datos, toca cada celda individual del conjunto de datos. Esto te llevará a la cuadrícula de imágenes de ese conjunto de datos en particular.
fr: Si tu veux jeter un œil aux images de l’ensemble de données, touche chaque cellule individuelle de celui-ci. Cela te permet de naviguer vers une grille d’images pour cet ensemble de données particulier de positions de la main.
it: Se vuoi dare un’occhiata alle immagini dell’insieme di dati, tocca ciascuna cella. Questo ti porterà su una griglia di immagini per l’insieme di dati di quella particolare posa della mano.
ja: データセットのイメージを見たい場合は、データセットの個々のセルをタップします。すると、その特定の手の形のデータセットのイメージがグリッド表示されます。
ko: 데이터 세트의 이미지를 보려면 각 데이터 세트 셀을 탭하세요. 그러면 특정 손 포즈 데이터 세트에 대한 이미지 격자로 이동합니다.
nl: Als je de afbeeldingen in de gegevensset wilt bekijken, kun je op de afzonderlijke cellen van de gegevensset tikken. Vervolgens wordt een raster met afbeeldingen geopend voor de gegevensset van het betreffende handgebaar.
no: Hvis du vil ta en titt på bildene i datasettet, kan du trykke på hver celle i datasettet. Da vises et rutenett med bilder for det aktuelle datasettet med håndtegn.
pt: Caso queira ver as imagens no conjunto de dados, toque em cada célula do conjunto de dados. Isso leva você a uma grade de imagens desse conjunto de dados de sinais com a mão.
sv: Om du vill ta en titt på datauppsättningens bilder trycker du på varje enskild datauppsättningscell. Detta navigerar dig till ett rutnät med bilder för den särskilda uppsättningen med handgester.
th: ถ้าคุณต้องการตรวจดูภาพของชุดข้อมูล ให้แตะที่แต่ละเซลล์ชุดข้อมูล การทำเช่นนี้จะนำทางคุณไปยังตารางของภาพสำหรับชุดข้อมูลท่าทางมือเฉพาะชุดนั้น
tr: Veri kümesindeki görüntülere bakmak istersen her bir veri kümesi hücresine dokun. Bu, o el pozu veri kümesindeki görüntü ızgarasında dolaşmanı sağlar.
vi: Nếu bạn muốn xem xét hình ảnh của tập dữ liệu, hãy chạm vào từng ô tập dữ liệu riêng lẻ. Thao tác này điều hướng bạn đến một lưới hình ảnh cho tập dữ liệu tư thế bàn tay cụ thể đó.
zh_cn: 如果想查看数据集的图像，你可以轻点每个单独的数据集单元格。这将跳转到这个特定手势数据集的图像网格。
zh_tw: 如果你想看一下資料集的影像，請點按每個單獨的資料集輸入格。這會將你導覽到該特定手勢資料集的影像網格。

source: Now that you’ve selected your training dataset and named your machine learning model, tap Train in the top-right corner of the preview.
de: Da du nun deinen Trainingsdatensatz ausgewählt und dein Modell für maschinelles Lernen benannt hast, tippe rechts oben in der Vorschau auf „Trainieren“.
es: Ahora que has seleccionado el conjunto de datos de entrenamiento y le has dado un nombre al modelo de aprendizaje automático, toca Train (Entrenar) en la esquina superior derecha de la previsualización.
es_419: Ahora que seleccionaste tu conjunto de datos de entrenamiento y asignaste un nombre al modelo, toca Train (entrenar) en la esquina superior derecha de la vista previa.
fr: Maintenant que tu as sélectionné ton ensemble de données d’apprentissage et que tu as donné un nom à ton modèle d’apprentissage automatique, touche Train dans l’angle supérieur droit de l’aperçu.
it: Adesso che hai selezionato l’insieme di dati di addestramento e hai dato un nome al modello di apprendimento automatico, tocca Train (addestra) nell’angolo in alto a destra dell’anteprima.
ja: 学習データセットを選択して機械学習モデルに名前をつけたので、プレビューの右上隅にある“学習”をタップします。
ko: 훈련 데이터 세트를 선택하고 기계 학습 모델의 이름을 정했으니, 이제 미리보기의 오른쪽 상단 모서리에 있는 훈련을 탭하세요.
nl: Nu je een trainingsgegevensset hebt geselecteerd en je model voor machinelearning een naam hebt gegeven, tik je op 'Train' in de rechterbovenhoek van de voorvertoning.
no: Nå som du har valgt treningsdatasettet og gitt maskinlæringsmodellen et navn, trykker du på Tren øverst til høyre i forhåndsvisningen.
pt: Agora que você selecionou o conjunto de dados de treinamento e deu um nome ao modelo de aprendizado de máquina, toque em Treinar no canto superior direito da pré‑visualização.
sv: Nu när du har valt din träningsdatauppsättning och namngett maskininlärningsmodellen trycker du på Träna i det övre högra hörnet av förhandsvisningen.
th: ตอนนี้เมื่อคุณเลือกชุดข้อมูลการฝึกและตั้งชื่อโมเดลการเรียนรู้ของเครื่องของคุณแล้ว ให้แตะฝึกที่มุมขวาบนสุดของการแสดงตัวอย่าง
tr: Artık eğitim veri kümesini seçtiğine ve makine öğrenimi modelini adlandırdığına göre önizlemenin sağ üst köşesinde Eğit’e dokun.
vi: Bây giờ, bạn đã chọn tập dữ liệu huấn luyện và đặt tên cho mô hình học máy của mình, hãy chạm vào Huấn luyện ở góc trên cùng bên phải của bản xem trước.
zh_cn: 现在你选择了训练数据集并给机器学习模型起了名字，轻点预览右上角的“训练”。
zh_tw: 現在你已經選擇了訓練資料集並且為機器學習模型命名，請點按預覽右上角的「訓練」。

source: Important: Don’t leave this preview or the current file displayed in the source editor, because you could lose your training session’s progress.
de: Wichtig: Diese Vorschau oder die aktuelle Datei darf im Source Editor nicht geöffnet bleiben, da sonst der Fortschritt deiner Trainingssitzung verloren gehen könnte.
es: Importante: No dejes abierta esta previsualización o el archivo actual visible en el editor de código, ya que podrías perder el avance realizado en la sesión de entrenamiento.
es_419: Importante: No salgas de la vista previa o del archivo que se muestra actualmente en el editor de código fuente, ya que podrías perder el progreso de tu sesión de entrenamiento.
fr: Important : ne quitte pas cet aperçu ou le fichier actuel affiché dans l’éditeur de source, car tu pourrais perdre l’avancement de ta session d’entraînement.
it: Importante: non uscire da questa anteprima o dal file attuale mostrato nell’editor della sorgente, perché potresti perdere il progresso della sessione di addestramento.
ja: 重要: このプレビューや現在のファイルをソースエディタに表示したままにしないでください。学習セッションの進捗が失われるおそれがあります。
ko: 중요: 소스 편집기에 나타나는 이 미리보기 또는 현재 파일을 닫지 마세요. 훈련 세션 진행 상황이 유실될 수 있습니다.
nl: Belangrijk: Sluit deze voorvertoning of het bestand dat in de broneditor wordt weergegeven, anders kun je de voortgang van je trainingssessie kwijtraken.
no: Viktig: Du må ikke forlate forhåndsvisningen eller filen som vises i kilderedigereren. Da kan det du har gjort hittil i treningsøkten, gå tapt.
pt: Importante: não saia da pré‑visualização ou do arquivo atual que aparece no editor de fonte porque você pode perder todo o progresso da sessão de treinamento.
sv: Viktigt: Lämna inte den här förhandsvisningen eller den aktuella filen så att den är synlig i källredigeraren eftersom du kan förlora framstegen du har gjort under träningssessionen.
th: สำคัญ: อย่าเปิดการแสดงตัวอย่างนี้หรือไฟล์ปัจจุบันที่แสดงอยู่ในตัวแก้ไขต้นฉบับทิ้งไว้ เพราะคุณอาจสูญเสียความคืบหน้าของเซสชั่นการฝึก
tr: Önemli: Bu önizlemeyi veya şu anki dosyayı kaynak düzenleyicide görünür durumda bırakma, aksi takdirde eğitim oturumundaki ilerlemeyi kaybedebilirsin.
vi: Quan trọng: Không để bản xem trước này hoặc tệp hiện tại hiển thị trong trình sửa nguồn, vì bạn có thể mất tiến trình của phiên huấn luyện.
zh_cn: 重要提示：不要让这个预览或当前文件显示在源编辑器中，因为你可能会丢失训练会话的进度。
zh_tw: 重要事項：請勿將此預覽或目前的檔案一直顯示在來源程式碼編輯器中，因為你可能會遺失訓練階段的進度。

source: The length of a training session depends on the number of images in the training dataset. Be patient, this can take a long time! With a training dataset of 21 images, it can take anywhere from 2 to 5 minutes depending on your device.
de: Die Länge einer Trainingssitzung hängt von der Anzahl der Bilder im Trainingsdatensatz ab. Lehn dich zurück, das kann eine Weile dauern! Bei einem Trainingsdatensatz von 21 Bildern kann es je nach verwendetem Gerät zwischen zwei und fünf Minuten dauern.
es: La duración de una sesión de entrenamiento depende del número de imágenes que contenga el conjunto de datos de entrenamiento. Ten paciencia, que puede tardar bastante. Con un conjunto de datos de entrenamiento de 21 imágenes, puede tardar entre 2 y 5 minutos, dependiendo del dispositivo.
es_419: La duración de una sesión de entrenamiento depende del número de imágenes que tenga el conjunto de datos de entrenamiento. Ten paciencia, ya que esto puede tardar bastante. Un entrenamiento con un conjunto de datos de 21 imágenes puede tardar entre 2 y 5 minutos, dependiendo del dispositivo.
fr: La durée d’une session d’entraînement dépend du nombre d’images de l’ensemble de données d’apprentissage. Fais preuve de patience, cela peut être long ! Avec un ensemble de données d’apprentissage de 21 images, cela peut prendre entre 2 et 5 minutes en fonction de ton appareil.
it: La durata di una sessione di addestramento dipende dal numero di immagini nell’insieme di dati di addestramento. Non essere impaziente, può volerci un po’ di tempo! Con un insieme di dati di addestramento di 21 immagini, possono volerci tra i 2 e i 5 minuti, a seconda del dispositivo.
ja: 学習セッションの長さは、学習データセットに含まれるイメージの数に左右されます。これには時間がかかることがあるので、気長に待ちましょう。学習データセットが21個のイメージからなる場合は、デバイスによって2分から5分の時間がかかります。
ko: 훈련 세션의 길이는 훈련 데이터 세트의 이미지 수에 따라 달라집니다. 오래 걸릴 수도 있으니 조금만 참으세요! 21개의 이미지로 구성된 훈련 데이터 세트를 사용하면 기기에 따라 2분에서 5분 정도 걸릴 수 있습니다.
nl: De lengte van een trainingssessie is afhankelijk van het aantal afbeeldingen in de trainingsgegevensset. Heb geduld, het kan lang duren! Als een trainingsgegevensset bijvoorbeeld uit 21 afbeeldingen bestaat, kan het afhankelijk van je apparaat tussen de 2 en 5 minuten duren.
no: Lengden på treningsøkten avhenger av hvor mange bilder det er i treningsdatasettet. Vær tålmodig, dette kan ta tid! Med et treningsdatasett med 21 bilder kan det ta 2–5 minutter, avhengig av enheten din.
pt: A duração de uma sessão de treinamento depende do número de imagens no conjunto de dados de treinamento. Tenha paciência, pois ela pode levar bastante tempo! Com um conjunto de dados de treinamento de 21 imagens, a sessão pode levar de 2 a 5 minutos, dependendo do dispositivo.
sv: Längden på en träningssession varierar beroende på antalet bilder i träningsdatauppsättningen. Det kan ta en lång stund, så ha tålamod! Om du har en träningsdatauppsättning med 21 bilder kan det ta 2–5 minuter beroende på din enhet.
th: ระยะเวลาของเซสชั่นการฝึกจะขึ้นอยู่กับจำนวนของภาพในชุดข้อมูลการฝึก โปรดอดใจรอ การฝึกอาจใช้เวลานาน! ด้วยชุดข้อมูลการฝึกที่มี 21 ภาพ อาจใช้เวลาตั้งแต่ 2 ถึง 5 นาที ทั้งนี้ ขึ้นอยู่กับอุปกรณ์ของคุณ
tr: Eğitim oturumunun süresi, eğitim veri kümesindeki görüntü sayısına bağlıdır. Sabırlı ol, bu işlem uzun sürebilir! 21 görüntüden oluşan bir eğitim veri kümesiyle aygıtına bağlı olarak 2 ila 5 dakika arasında sürebilir.
vi: Độ dài của phiên huấn luyện phụ thuộc vào số lượng hình ảnh trong tập dữ liệu huấn luyện. Hãy kiên nhẫn, quá trình này có thể mất nhiều thời gian! Với một tập dữ liệu huấn luyện gồm 21 hình ảnh, có thể mất từ 2 đến 5 phút tùy theo thiết bị của bạn.
zh_cn: 训练会话的长度取决于训练数据集中的图像数量。耐心等一下，这可能需要很长时间！包含 21 张图像的训练数据集可能需要 2 到 5 分钟的时间，具体取决于你的设备性能。
zh_tw: 訓練階段的長度取決於訓練資料集中的影像數量。請耐心等待，這可能需要很長時間！使用包含 21 個影像的訓練資料集，可能需要 2 到 5 分鐘，視你的裝置而定。
