Repository: JulioPr0/ml-rock-paper-scissors
Catalog: Rock, Paper, Scissors game with ML.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: A machine learning model takes in information as input, then produces an educated guess of what that information represents. This is called a [prediction](glossary://prediction).
de: Ein Modell für maschinelles Lernen verwendet Informationen als Eingabe und stellt dann Vermutungen zu dem auf, was die Informationen repräsentieren. Diese werden als [Vorhersagen](glossary://prediction) bezeichnet.
es: Un modelo de aprendizaje automático toma la información como entrada y produce una suposición fundamentada de qué representa esa información. Esto se denomina [predicción](glossary://prediction).
es_419: Un modelo de aprendizaje automático toma información como su entrada y luego hace una suposición informada de lo que representa la información; a esto se le conoce como [predicción](glossary://prediction).
fr: Un modèle d’apprentissage automatique reçoit des informations comme entrées, puis produit une hypothèse éclairée de ce que ces informations représentent. Cela s’appelle une [prédiction](glossary://prediction).
it: Un modello di apprendimento automatico acquisisce informazioni come input, quindi produce un’ipotesi ragionata su ciò che tali informazioni rappresentano. Questa operazione è chiamata [previsione](glossary://prediction).
ja: 機械学習モデルは情報を入力として取り込み、その情報が何を意味するかを経験に基づいて推測します。これは[予測](glossary://prediction)と呼ばれます。
ko: 기계 학습 모델은 정보를 입력으로 받아들인 다음 해당 정보가 나타내는 것에 대해 지식에 근거한 추측을 생산합니다. 이를 [예측](glossary://prediction)이라고 합니다.
nl: Een model voor machinelearning ontvangt informatie als invoer en produceert vervolgens een goed onderbouwde veronderstelling van wat die informatie vertegenwoordigt. Dit wordt een [voorspelling](glossary://prediction) genoemd.
no: En maskinlæringsmodell tar inn informasjon som inndata, og deretter kommer den med en kvalifisert gjetning om hva informasjonen representerer. Dette kalles en [prediksjon](glossary://prediction).
pt: Um modelo de aprendizado de máquina recebe informações como entrada e produz um palpite do que essas informações representam. Isso é chamado de [previsão](glossary://prediction).
sv: En maskininlärningsmodell tar in information som inmatning och gör sedan en kvalificerad gissning av vad den informationen representerar. Det här kallas en [förutsägelse](glossary://prediction).
th: โมเดลการเรียนรู้ของเครื่องจะรับเข้าข้อมูลเป็น input และสร้างการคาดเดาจากการเรียนรู้เกี่ยวกับสิ่งที่ข้อมูลแสดงให้เห็น ซึ่งเรียกว่า[การคาดคะเน](glossary://prediction)
tr: Bir makine öğrenimi modeli, giriş olarak bilgi alır, sonra da bu bilginin temsil ettiği, deneyime dayalı bir tahmin üretir. Buna [tahmin](glossary://prediction) denir.
vi: Mô hình học máy lấy thông tin dưới dạng đầu vào, sau đó tạo ra một phán đoán được huấn luyện về việc thông tin đó biểu thị điều gì. Đây được gọi là một [dự đoán](glossary://prediction).
zh_cn: 机器学习模型将信息作为输入接收，然后对该信息代表的内容进行有根据的猜测。这个过程叫作[预测](glossary://prediction)。
zh_tw: 機器學習模型會將資訊做為輸入項目，然後對該資訊所代表的內容進行有根據的猜測。這稱為[預測](glossary://prediction)。

source: Consider the differences between the hand poses in Rock, Paper, Scissors.
de: Überlege dir, welche Unterschiede es zwischen den entsprechenden Handgesten in „Schere, Stein, Papier“ gibt.
es: Piensa en qué se diferencian las posturas de las manos para “Piedra”, “Papel” o “Tijera”.
es_419: Considera las diferencias entre las poses de mano del juego Piedra, papel o tijeras.
fr: Réfléchis aux différences entre les positions de la main pour la pierre, le papier et les ciseaux.
it: Considera le differenze tra le pose delle mani in Sasso, carta, forbici.
ja: グー、パー、チョキの手の形の違いを考えてみましょう。
ko: 가위, 바위, 보에서 손 포즈의 차이를 생각해 보세요.
nl: Bekijk de verschillen tussen de handgebaren in Steen, papier, schaar.
no: Tenk på forskjellen mellom tegnene i stein, saks, papir.
pt: Considere as diferenças entre os sinais com a mão em Pedra, Papel e Tesoura.
sv: Fundera på skillnaderna mellan handgesterna i Sten, sax, påse.
th: ลองคำนึงถึงความแตกต่างระหว่างท่าทางมือของค้อน กระดาษ และกรรไกร
tr: Taş, Kâğıt, Makas oyununda el pozları arasındaki farkları düşün.
vi: Cân nhắc sự khác biệt giữa các tư thế bàn tay trong Kéo Búa Bao.
zh_cn: 思考一下“石头剪刀布”中各个手势的区别。
zh_tw: 思考一下「剪刀、石頭、布」中手部姿勢之間的差異。

source: For example, one major distinction between a rock pose (✊) and a scissors pose (✌️) is that all ✌️ poses show the index and middle fingers raised, whereas a ✊ shows no raised fingers. Humans without visual impairments are able to process that information visually with their eyes.
de: Ein wichtiges Unterscheidungsmerkmal zwischen der Geste für Schere (✌️) und der für Stein (✊) ist beispielsweise, dass bei ✌️ der Zeige- und Mittelfinger und bei ✊ gar kein Finger sichtbar ist. Personen ohne Sehschwäche können diese Informationen visuell mit ihren Augen verarbeiten.
es: Por ejemplo, una diferencia significativa entre la postura de piedra (✊) y de tijeras (✌️) es que en todas las posturas de tijera (✌️) se muestran extendidos los dedos índice y corazón, mientras que en la postura de piedra (✊) no hay ningún dedo extendido. Los humanos que no tienen discapacidades visuales pueden procesar esa información con solo mirar.
es_419: Por ejemplo, una de las principales diferencias entre la piedra (✊) y las tijeras (✌️) es que ✌️ muestra los dedos índice y medio levantados, mientras que ✊ tiene todo el puño cerrado. Los humanos que no tienen discapacidades visuales pueden procesar esta información visualmente con sus ojos.
fr: Par exemple, une différence importante entre la position de la pierre (✊) et celle des ciseaux (✌️) est que toutes les positions ✌️ présentent l’index et le majeur levés, tandis qu’une position ✊ ne montre aucun doigt levé. Les humains sans déficience visuelle sont capables de traiter cette information visuellement à l’aide de leurs yeux.
it: Ad esempio, una distinzione importante tra la posa Sasso (✊) e la posa Forbici (✌️) è che tutte le pose ✌️ hanno l’indice e il medio sollevati, mentre ✊ non ha nessun dito sollevato. Gli umani senza disabilità visive sono in grado di elaborare tale informazione visivamente attraverso gli occhi.
ja: 例えば、グーの形（✊）とチョキの形（✌️）の大きな違いの1つは、すべての✌️の形は人差し指と中指を上げているのに対して、✊では1本も指を上げていません。視覚障害のない人間であれば、その情報を目で視覚的に処理することができます。
ko: 예를 들어, 가위 포즈(✌️)와 바위 포즈(✊)의 주요 차이점은 ✌️는 검지와 가운데 손가락을 들어 올린 모습을 보이는 반면, ✊는 손가락을 들어 올린 모습을 보이지 않는다는 것입니다. 시각 장애가 없는 인간은 눈으로 정보를 시각적으로 처리할 수 있습니다.
nl: Een belangrijk verschil tussen een steengebaar (✊) en een schaargebaar (✌️) is bijvoorbeeld dat bij alle ✌️-gebaren de wijs- en middelvinger worden opgestoken, terwijl bij een ✊ geen vingers worden opgestoken. Mensen zonder visuele beperkingen kunnen die informatie visueel verwerken met hun ogen.
no: For eksempel er en stor forskjell mellom tegnet for stein (✊) og tegnet for saks (✌️) at alle ✌️-tegn har utstrakt peke- og langfinger, mens ✊ ikke har noen utstrakte fingre. Mennesker som ikke har nedsatt syn, kan bearbeide den informasjonen visuelt ved hjelp av øynene sine.
pt: Por exemplo, uma distinção óbvia entre um sinal de pedra (✊) e um sinal de tesoura (✌️) é que ✌️ mostra os dedos indicador e médio levantados, enquanto ✊ não levanta nenhum dedo. Humanos sem problemas de visão são capazes de processar essas informações visualmente.
sv: Exempelvis är en stor skillnad mellan en stensymbol (✊) och en saxsymbol (✌️) att ✌️ visar uppsträckta pek- och långfingrar medan en ✊ inte visar något uppsträckt finger. Människor som inte har nedsatt syn kan bearbeta den informationen visuellt med sina ögon.
th: ตัวอย่างเช่น ความแตกต่างหลักประการหนึ่งระหว่างท่าทางค้อน (✊) และท่าทางกรรไกร (✌️) คือท่าทาง ✌️ ทั้งหมดแสดงการยกนิ้วชี้และนิ้วกลางขึ้น แต่ ✊ แสดงว่าไม่มีนิ้วยกขึ้น มนุษย์ที่ไม่ได้บกพร่องทางการมองเห็นจะสามารถประมวลผลข้อมูลนั้นได้ตามที่มองเห็นด้วยสายตา
tr: Örneğin taş pozu (✊) ile makas pozu (✌️) arasındaki önemli farklardan biri tüm ✌️ pozlarında işaret parmağı ve orta parmak yukarıda gösterilir, ✊ pozunda ise yukarıda bir parmak yoktur. Görme bozukluğu olmayan kişiler bu bilgileri gözlerini kullanarak görsel bir şekilde işleyebilir.
vi: Ví dụ: một sự khác biệt lớn giữa tư thế búa (✊) và tư thế kéo (✌️) là tất cả các tư thế ✌️ đều cho thấy ngón trỏ và ngón giữa giơ lên, trong khi ✊ không có ngón tay nào giơ lên. Những người không bị suy giảm thị lực đều có thể xử lý thông tin đó trực quan bằng mắt.
zh_cn: 例如，石头手势 (✊) 和剪刀手势 (✌️) 的一个主要区别是，所有 ✌️ 手势都伸出了食指和中指，而 ✊ 没有伸出手指。没有视觉障碍的人能够通过眼睛视觉处理该信息。
zh_tw: 例如，石頭手勢（✊）和剪刀手勢（✌️）之間的主要區別是所有 ✌️ 姿勢都顯示食指和中指舉起，而 ✊ 沒有顯示手指舉起。沒有視覺障礙的人類都能用眼睛處理這些視覺資訊。

source: Computers are similar in this way – they can also process information visually, although they see it as a 2D array of pixels, instead of as a hand or a tree.
de: Computer sind, was das betrifft, ähnlich: Sie können Informationen ebenfalls visuell verarbeiten. Anstelle einer Hand oder eines Baums sehen Computer aber ein 2D-Array aus Pixeln.
es: En este sentido, los ordenadores son parecidos: también pueden procesar visualmente la información, aunque la ven como un vector en 2D de píxeles, en vez de como una mano o un árbol.
es_419: En este sentido, las computadoras son parecidas a nosotros, ya que también procesan información visualmente, aunque la visualizan mediante un arreglo 2D de pixeles en lugar de una mano.
fr: Les ordinateurs sont pareils : ils peuvent traiter cette information visuellement, bien qu’ils la voient comme un tableau 2D de pixels, plutôt que comme une main ou un arbre.
it: I computer sono simili in questo senso: anche loro possono elaborare informazioni visivamente, però le vedono come un array 2D di pixel, piuttosto che come una mano o come un albero.
ja: コンピュータもその点では似ています—同じく視覚的に情報を処理しますが、手や木としてではなく、ピクセルの2次元配列として見ています。
ko: 컴퓨터도 이와 유사한 방식으로 정보를 시각적으로 처리할 수 있지만, 정보를 손이나 나무가 아닌 2D 픽셀 배열로 볼 수 있습니다.
nl: Computers werken op een vergelijkbare manier. Ze kunnen informatie ook visueel verwerken, maar zien de informatie als een 2D-array met pixels in plaats van een hand of een boom.
no: Her ligner datamaskiner på oss. De kan også behandle informasjon visuelt, selv om de ser den som en todimensjonal matrise med piksler i stedet for som en hånd eller et tre.
pt: Computadores se parecem um pouco com humanos nesse quesito, pois também podem processar informações visualmente, embora as vejam como um vetor de pixels 2D, em vez de uma mão ou árvore.
sv: Datorer liknar oss på det sättet – de kan också bearbeta information visuellt även om de ser den som en 2D-array med pixlar istället för som en hand eller ett träd.
th: วิธีนี้คล้ายกับคอมพิวเตอร์ที่สามารถประมวลผลข้อมูลตามที่มองเห็นได้เช่นกัน แม้ว่าสิ่งที่เครื่องเห็นจะเป็นอาร์เรย์ของพิกเซล 2D แทนที่จะเป็นมือหรือต้นไม้
tr: Bilgisayarlar da buna benzer ve bilgileri görsel olarak işleyebilir ama bilgiyi bir el veya ağaç yerine 2B piksel dizisi olarak görür.
vi: Các máy tính cũng hoạt động tương tự như cách này – chúng cũng có thể xử lý thông tin trực quan, mặc dù chúng nhìn thông tin dưới dạng một dãy điểm ảnh 2D, thay vì dưới dạng một bàn tay hoặc cái cây.
zh_cn: 电脑在这方面也类似，它们也可以通过视觉处理信息，但会将信息视为二维像素数组，而不是一只手或一棵树。
zh_tw: 電腦在這方面是相似的，它們也能以視覺化的方式處理資料，儘管它們是將資料視為 2D 像素陣列，而不是手或樹。

source: The camera in your app is the machine’s eyes. You can use image data from the camera as input for your `HandPoseMLModel`. Your ML model uses this data to identify the different types of hand poses.
de: In deiner App übernimmt die Kamera für die Maschine die Aufgabe der Augen. Du kannst die Bilddaten von der Kamera als Eingabe für `HandPoseMLModel` (ML-Modell für Handgesten) verwenden. Dein ML-Modell nutzt diese Daten zum Identifizieren der verschiedenen Handgestentypen.
es: En la app, la cámara hace las funciones de los ojos. Puedes usar los datos de imagen de la cámara como entrada del modelo `HandPoseMLModel`. El modelo de ML utiliza estos datos para identificar las distintas posturas de las manos.
es_419: La cámara en tu app hace la función de los ojos de la máquina. Puedes usar los datos de imagen de la cámara como la entrada de tu modelo `HandPoseMLModel`. Tu modelo de ML usa estos datos para identificar las distintas poses de mano.
fr: L’appareil photo de ton app constitue les yeux de la machine. Tu peux utiliser les données d’image de l’appareil photo comme entrées pour ton `HandPoseMLModel`. Ton modèle d’apprentissage automatique utilise ces données pour identifier les différents types de positions de la main.
it: Nella tua app, la fotocamera funge da occhi per la macchina. Puoi utilizzare i dati immagine dalla fotocamera come input per il modello `HandPoseMLModel`. Il modello utilizza questi dati per identificare i diversi tipi di pose delle mani.
ja: Appのカメラが機械の目に相当します。カメラからのイメージデータを`HandPoseMLModel`への入力として使用することができます。機械学習モデルはこのデータを使って、さまざまな種類の手の形を識別します。
ko: 앱에 있는 카메라는 기계의 눈입니다. 카메라의 이미지 데이터를 `HandPoseMLModel`의 입력으로 사용할 수 있습니다. ML 모델은 이 데이터를 사용하여 다양한 유형의 손 포즈를 식별합니다.
nl: De camera in je app fungeert als de ogen van de machine. Je kunt afbeeldingsgegevens van de camera als invoer voor `HandPoseMLModel` gebruiken. Je ML-model gebruikt deze gegevens om de verschillende soorten handgebaren te herkennen.
no: Kameraet i appen er maskinens øyne. Du kan bruke bildedata fra kameraet som inndata for `HandPoseMLModel`. Maskinlæringsmodellen din bruker disse dataene til å identifisere de forskjellige håndtegnene.
pt: A câmera no app serve como os olhos da máquina. Você pode usar os dados de imagem da câmera como entrada de `HandPoseMLModel`. O modelo de AM usa esses dados para identificar os diferentes tipos de sinais com a mão.
sv: Kameran i appen är maskinens ögon. Du kan använda bilddata från kameran som inmatning för `HandPoseMLModel`. Din maskininlärningsmodell använder dessa data till att identifiera de olika typerna av handgester.
th: กล้องในแอปของคุณคือตาของเครื่อง คุณสามารถใช้ข้อมูลภาพจากกล้องเป็น input สำหรับ `HandPoseMLModel` ของคุณ โมเดล ML จะใช้ข้อมูลนี้เพื่อระบุท่าทางมือประเภทต่างๆ
tr: Uygulamandaki kamera makinenin gözleridir. Kameradan gelen görüntü verilerini `HandPoseMLModel` için giriş olarak kullanabilirsin. Makine öğrenimi modelin, farklı türlerde el pozlarını belirlemek için bu verileri kullanır.
vi: Camera trong ứng dụng của bạn chính là mắt của máy. Bạn có thể sử dụng dữ liệu hình ảnh từ camera dưới dạng đầu vào cho `HandPoseMLModel`. Mô hình ML của bạn sử dụng dữ liệu này để nhận dạng các kiểu tư thế bàn tay khác nhau.
zh_cn: App 中的摄像头就是机器的眼睛。你可以将摄像头中的图像数据用作 `HandPoseMLModel`（手势机器学习模型）的输入。你的机器学习模型使用这些数据来识别不同类型的手势。
zh_tw: App 中的相機就是機器的眼睛。你可以使用來自相機的影像資料做為 `HandPoseMLModel` 的輸入。你的 ML 模型會使用這項資料來辨識不同類型的手部姿勢。

source: The [Vision Framework](doc://com.apple.documentation/documentation/vision) makes it easy for your app to convert the camera’s image data into something the ML model can understand.
de: Das [Vision-Framework](doc://com.apple.documentation/documentation/vision) ermöglicht deiner App, die Bilddaten der Kamera in Informationen zu konvertieren, die das ML-Model verarbeiten kann.
es: La [estructura Vision](doc://com.apple.documentation/documentation/vision) hace que para la app sea fácil convertir los datos de imagen de la cámara en algo comprensible para el modelo de ML.
es_419: La estructura [Vision Framework](doc://com.apple.documentation/documentation/vision) facilita que tu app convierta los datos de imagen de la cámara en algo que el modelo de ML pueda comprender.
fr: Grâce au [framework Vision](doc://com.apple.documentation/documentation/vision), ton app peut facilement convertir les données d’image de l’appareil photo en quelque chose que ton modèle d’apprentissage automatique peut comprendre.
it: Il framework [Vision](doc://com.apple.documentation/documentation/vision) facilita all’app il compito di convertire i dati immagine della fotocamera in qualcosa che può essere compreso dal modello di apprendimento automatico.
ja: [Vision Framework](doc://com.apple.documentation/documentation/vision)を使うことで、カメラのイメージデータを機械学習モデルが理解できるものに変換することができます。
ko: [Vision Framework](doc://com.apple.documentation/documentation/vision)를 사용하면 앱이 카메라의 이미지 데이터를 ML 모델이 이해할 수 있는 것으로 쉽게 변환할 수 있습니다.
nl: Met het [Vision Framework](doc://com.apple.documentation/documentation/vision) kan je app de afbeeldingsgegevens van de camera gemakkelijk omzetten in iets wat het ML-model kan begrijpen.
no: [Vision-rammeverket](doc://com.apple.documentation/documentation/vision) gjør det enkelt for appen å konvertere bildedataene fra kameraet til noe som maskinlæringsmodellen kan forstå.
pt: O [Vision Framework](doc://com.apple.documentation/documentation/vision) faz com que seja fácil para o app converter os dados de imagem da câmera em algo que o modelo de AM possa entender.
sv: [Vision-ramverket](doc://com.apple.documentation/documentation/vision) gör det enkelt för appen att konvertera kamerans bilddata till något som maskininlärningsmodellen kan förstå.
th: [เฟรมเวิร์ค Vision](doc://com.apple.documentation/documentation/vision) ทำให้แอปของคุณสามารถแปลงข้อมูลภาพของกล้องเป็นสิ่งที่โมเดล ML เข้าใจได้ง่ายๆ
tr: [Vision Framework](doc://com.apple.documentation/documentation/vision), uygulamanın kameradan gelen görüntü verilerini makine öğrenimi modelinin anlayabileceği bir şeye dönüştürmesini kolaylaştırır.
vi: [Chương trình khung Vision](doc://com.apple.documentation/documentation/vision) giúp ứng dụng của bạn dễ dàng chuyển đổi dữ liệu hình ảnh của camera thành nội dung mà mô hình ML có thể hiểu được.
zh_cn: [Vision 框架](doc://com.apple.documentation/documentation/vision)（视觉框架）可让 App 轻松将摄像头的图像数据转换成机器学习模型能够理解的东西。
zh_tw: [Vision Framework](doc://com.apple.documentation/documentation/vision) 讓你的 App 可以輕鬆地將相機的影像資料轉換為 ML 模型可以理解的內容。

source: Every time your camera’s frame updates, your app gathers [VNHumanHandPoseObservations](doc://com.apple.documentation/documentation/vision/vnhumanhandposeobservation) from the frame’s pixel buffer.
de: Bei jeder Aktualisierung des Kamerarahmens sammelt deine App [VNHumanHandPoseObservations](doc://com.apple.documentation/documentation/vision/vnhumanhandposeobservation) (beobachtete menschliche Handgesten) aus dem Pixelzwischenspeicher des Rahmens.
es: Cada vez que se actualiza el marco de la cámara, la app toma las observaciones [VNHumanHandPoseObservations](doc://com.apple.documentation/documentation/vision/vnhumanhandposeobservation) del búfer de píxeles del encuadre.
es_419: Cada vez que se actualiza el visor de la cámara, tu app recopila [VNHumanHandPoseObservations](doc://com.apple.documentation/documentation/vision/vnhumanhandposeobservation) (observaciones de poses de manos) provenientes del búffer de pixeles del visor.
fr: Chaque fois que l’image de ton appareil photo se met à jour, ton app collecte des [VNHumanHandPoseObservations](doc://com.apple.documentation/documentation/vision/vnhumanhandposeobservation) du tampon de pixels de l’image.
it: Ogni volta che l’inquadratura della fotocamera si aggiorna, l’app raccoglie osservazioni [VNHumanHandPoseObservations](doc://com.apple.documentation/documentation/vision/vnhumanhandposeobservation) dal buffer dei pixel dell’inquadratura.
ja: カメラのフレームがアップデートするたびに、Appはフレームのピクセルバッファから[VNHumanHandPoseObservations](doc://com.apple.documentation/documentation/vision/vnhumanhandposeobservation)を収集します。
ko: 카메라의 프레임이 업데이트될 때마다 앱은 프레임의 픽셀 버퍼에서 [VNHumanHandPoseObservations](doc://com.apple.documentation/documentation/vision/vnhumanhandposeobservation)를 수집합니다.
nl: Steeds wanneer het beeld van de camera wordt bijgewerkt, verzamelt je app [VNHumanHandPoseObservations](doc://com.apple.documentation/documentation/vision/vnhumanhandposeobservation) uit de pixelbuffer van het beeld.
no: Hver gang bildet fra kameraet oppdateres, samler appen inn [VNHumanHandPoseObservations](doc://com.apple.documentation/documentation/vision/vnhumanhandposeobservation) fra kameraets pikselbuffer.
pt: Sempre que o quadro da câmera é atualizado, o app reúne [VNHumanHandPoseObservations](doc://com.apple.documentation/documentation/vision/vnhumanhandposeobservation) do buffer de pixels do quadro.
sv: Varje gång kamerans bildruta uppdateras samlar appen in [VNHumanHandPoseObservations](doc://com.apple.documentation/documentation/vision/vnhumanhandposeobservation) från bildrutans pixelbuffert.
th: ทุกครั้งที่เฟรมกล้องของคุณอัปเดต แอปของคุณจะรวบรวม [VNHumanHandPoseObservations](doc://com.apple.documentation/documentation/vision/vnhumanhandposeobservation) จากพิกเซลบัฟเฟอร์ของเฟรม
tr: Kameradaki kare her güncellendiğinde uygulaman, karenin piksel arabelleğinden [VNHumanHandPoseObservations](doc://com.apple.documentation/documentation/vision/vnhumanhandposeobservation) gözlemlerini toplar.
vi: Mỗi lần khung hình của camera cập nhật, ứng dụng của bạn thu thập [VNHumanHandPoseObservations](doc://com.apple.documentation/documentation/vision/vnhumanhandposeobservation) từ bộ đệm điểm ảnh của khung hình.
zh_cn: 每次摄像头的框架更新时，App 会从这个框架的像素缓冲区收集 [VNHumanHandPoseObservations](doc://com.apple.documentation/documentation/vision/vnhumanhandposeobservation)（VN 人类手势观察）。
zh_tw: 每次相機的影格更新時，你的 App 都會從影格的像素緩衝區中收集 [VNHumanHandPoseObservations](doc://com.apple.documentation/documentation/vision/vnhumanhandposeobservation)。
