Repository: JulioPr0/ml-rock-paper-scissors
Catalog: Rock, Paper, Scissors game with ML.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: This is because a computer requires lots of data to identify and distinguish meaningful features of such hand poses, something the human brain can do rather effortlessly.
de: Der Grund hierfür ist, dass der Computer viele Daten benötigt, um die wichtigen Eigenschaften solcher Handgesten identifizieren und unterscheiden zu können. Ein menschliches Gehirn schafft das fast mühelos.
es: Esto es así porque los ordenadores necesitan montones de datos para identificar y distinguir rasgos significativos de esas posturas de manos, algo que el cerebro humano puede hacer con bastante poco esfuerzo.
es_419: La computadora requiere muchos datos para poder identificar y distinguir características significativas de las poses de las manos, pero esto es algo que el cerebro humano puede hacer casi sin esfuerzo.
fr: En effet, un ordinateur a besoin de beaucoup de données pour identifier et différencier les caractéristiques importantes de telles positions de la main, ce que le cerveau humain peut faire sans beaucoup d’efforts.
it: Questo perché un computer ha bisogno di tanti dati per identificare e distinguere le caratteristiche significative di tali pose, una cosa che il cervello umano riesce a fare piuttosto facilmente.
ja: これは、そうした手の形が持つ意味ある特徴をコンピュータが識別・区別するには、大量のデータが必要なためです（人間の頭脳は大して苦労なく行うことができます）。
ko: 이는 컴퓨터가 인간의 뇌에서 다소 쉽게 처리할 수 있는 그러한 손 포즈의 의미 있는 특징을 식별하고 구별하는 데 많은 데이터를 필요로 하기 때문입니다.
nl: Dit komt doordat een computer veel gegevens nodig heeft om betekenisvolle kenmerken van handgebaren te herkennen en van elkaar te onderscheiden, iets wat de menselijke hersenen moeiteloos kunnen doen.
no: Det skyldes at en datamaskin trenger store mengder med data for å kunne identifisere og skille mellom slike tegn, noe den menneskelige hjernen kan gjøre uten store anstrengelser.
pt: Isso acontece porque um computador requer muitos dados para identificar e distinguir características relevantes desses sinais com a mão, algo que o cérebro humano é capaz de fazer praticamente sem nenhum esforço.
sv: Det beror på att en dator kräver massor av data för att kunna identifiera och särskilja meningsfulla skillnader mellan sådana handgester. Det är något som mänskliga hjärnor kan göra utan att anstränga sig.
th: เนื่องจากคอมพิวเตอร์ต้องใช้ข้อมูลจำนวนมากเพื่อระบุและจำแนกคุณสมบัติที่สำคัญของท่าทางมือดังกล่าว ซึ่งเป็นสิ่งที่สมองของมนุษย์สามารถทำได้โดยแทบไม่ต้องพยายามเลย
tr: İnsan beyninin zahmetsizce gerçekleştirebilmesinin aksine bir bilgisayarın böyle el pozlarının anlamlı özelliklerini belirlemesi ve ayırt etmesi için çok fazla veri gerekir.
vi: Đó là vì máy tính yêu cầu nhiều dữ liệu để nhận dạng và phân biệt các đặc điểm có nghĩa của những tư thế bàn tay đó, một việc mà bộ não người có thể thực hiện khá dễ dàng.
zh_cn: 这是因为电脑需要大量数据，来识别和区分此类手势中有意义的特征，而人类大脑可以毫不费力地做到这一点。
zh_tw: 這是因為電腦需要大量資料來辨識和區分此類手部姿勢有意義的特徵，而人腦可以毫不費力地做到這一點。

source: To use machine learning in your app, you’ll use the [CreateML](doc://com.apple.documentation/documentation/createml) and [CoreML](doc://com.apple.documentation/documentation/coreml) frameworks.
de: Um maschinelles Lernen in deiner App zu verwenden, nutzt du die Frameworks [CreateML](doc://com.apple.documentation/documentation/createml) und [CoreML](doc://com.apple.documentation/documentation/coreml).
es: Para usar el aprendizaje automático en la app, utilizarás las estructuras [CreateML](doc://com.apple.documentation/documentation/createml) and [CoreML](doc://com.apple.documentation/documentation/coreml).
es_419: Para usar el aprendizaje automático en tu app, debes usar las estructuras [CreateML](doc://com.apple.documentation/documentation/createml) y [CoreML](doc://com.apple.documentation/documentation/coreml).
fr: Pour utiliser l’apprentissage automatique dans ton app, tu utiliseras les frameworks [CreateML](doc://com.apple.documentation/documentation/createml) et [CoreML](doc://com.apple.documentation/documentation/coreml).
it: Per utilizzare l’apprendimento automatico nella tua app, utilizzerai i framework [CreateML](doc://com.apple.documentation/documentation/createml) e [CoreML](doc://com.apple.documentation/documentation/coreml).
ja: Appで機械学習を使用するには、[CreateML](doc://com.apple.documentation/documentation/createml)および[CoreML](doc://com.apple.documentation/documentation/coreml)フレームワークを使用します。
ko: 앱에서 기계 학습을 사용하려면 [CreateML](doc://com.apple.documentation/documentation/createml) 및 [CoreML](doc://com.apple.documentation/documentation/coreml) 프레임워크를 사용합니다.
nl: Om machinelearning in je app toe te passen, ga je de [CreateML](doc://com.apple.documentation/documentation/createml)- en [CoreML](doc://com.apple.documentation/documentation/coreml)-frameworks gebruiken.
no: For å kunne bruke maskinlæring i appen må du bruke rammeverkene [CreateML](doc://com.apple.documentation/documentation/createml) og [CoreML](doc://com.apple.documentation/documentation/coreml).
pt: Para usar o aprendizado de máquina no app, você usará os frameworks [CreateML](doc://com.apple.documentation/documentation/createml) e [CoreML](doc://com.apple.documentation/documentation/coreml).
sv: När du vill använda maskininlärning i din app kommer du att använda ramverken [CreateML](doc://com.apple.documentation/documentation/createml) och [CoreML](doc://com.apple.documentation/documentation/coreml).
th: ในการใช้การเรียนรู้ของเครื่องในแอปของคุณ คุณจะต้องใช้ [CreateML](doc://com.apple.documentation/documentation/createml) และ [CoreML](doc://com.apple.documentation/documentation/coreml) frameworks
tr: Uygulamanda makine öğrenimini kullanmak için [CreateML](doc://com.apple.documentation/documentation/createml) ve [CoreML](doc://com.apple.documentation/documentation/coreml) framework’lerini kullanacaksın.
vi: Để sử dụng học máy trong ứng dụng của mình, bạn sẽ sử dụng các chương trình khung [CreateML](doc://com.apple.documentation/documentation/createml) và [CoreML](doc://com.apple.documentation/documentation/coreml).
zh_cn: 如果要在 App 中使用机器学习，你需要使用 [CreateML](doc://com.apple.documentation/documentation/createml)（创建机器学习）和 [CoreML](doc://com.apple.documentation/documentation/coreml)（核心机器学习）框架。
zh_tw: 若要在你的 App 中使用機器學習，你會使用 [CreateML](doc://com.apple.documentation/documentation/createml) 和 [CoreML](doc://com.apple.documentation/documentation/coreml) 架構。

source: Your Rock, Paper, Scissors app uses image [classification](glossary://classification) to recognize different hand poses shown in the camera.
de: Deine „Schere, Stein, Papier“-App verwendet eine Bild[klassifizierung](glossary://classification), um die verschiedenen, in die Kamera gezeigten Handgesten zu erkennen.
es: Para reconocer las diferentes posturas de las manos que se muestran a la cámara, la app “Piedra, papel o tijera” usa la [clasificación](glossary://classification) de imágenes.
es_419: Tu app Piedra, papel o tijeras usa la [clasificación](glossary://classification) de imágenes para reconocer las distintas poses de manos que se muestran en la cámara.
fr: Ton app Pierre, papier, ciseaux utilise une [classification](glossary://classification) d’images pour reconnaître différentes positions de la main présentées à l’appareil photo.
it: La tua app Sasso, carta, forbici utilizza la [classificazione](glossary://classification) delle immagini per riconoscere le diverse pose mostrate nella fotocamera.
ja: あなたのじゃんけんAppは、画像[分類](glossary://classification)を使用して、カメラに映ったさまざまな手の形を認識します。
ko: 가위, 바위, 보 앱은 이미지 [분류](glossary://classification)를 사용하여 카메라에 포착된 서로 다른 손 포즈를 인식합니다.
nl: Je Steen, papier, schaar-game gebruikt afbeeldings[classificatie](glossary://classification) om verschillende handgebaren te herkennen die in de camera worden getoond.
no: Stein, saks, papir-appen din bruker bilde[klassifikasjon](glossary://classification) til å gjenkjenne forskjellige håndtegn som vises til kameraet.
pt: O app Pedra, Papel e Tesoura usa a [classificação](glossary://classification) de imagens para reconhecer os diferentes sinais com a mão que aparecem na câmera.
sv: Din Sten, sax, påse-app använder bild[klassificeringar](glossary://classification) till att identifiera skillnader mellan olika handgester som visas i kameran.
th: แอปเป่ายิ้งฉุบของคุณใช้[การจัดประเภท](glossary://classification)ภาพเพื่อรู้จำท่าทางมือที่แตกต่างกันที่แสดงในกล้อง
tr: Taş, Kâğıt, Makas uygulaman, kamerada gösterilen farklı el pozlarını tanımak için görüntü [sınıflandırmasını](glossary://classification) kullanır.
vi: Ứng dụng Kéo Búa Bao của bạn sử dụng [phân loại](glossary://classification) hình ảnh để nhận biết các tư thế bàn tay khác nhau được hiển thị trong camera.
zh_cn: 你的“石头剪刀布” App 使用图像[分类](glossary://classification)来识别摄像头中出现的不同手势。
zh_tw: 你的「剪刀、石頭、布」App 使用影像[分類](glossary://classification)來辨識相機中顯示的不同手部姿勢。

source: “Classification” is a type of machine learning algorithm that categorizes examples from a dataset into different groups. You’ll use the [MLHandPoseClassifier](doc://com.apple.documentation/documentation/createml/mlhandposeclassifier) to classify different hand poses (✊, ✋, and ✌️) from a stream of images from the camera.
de: „Klassifizierung“ ist im maschinellen Lernen ein Algorithmustyp, der Beispiele aus einem Datensatz in verschiedene Gruppen einsortiert. Du verwendest [MLHandPoseClassifier](doc://com.apple.documentation/documentation/createml/mlhandposeclassifier), um verschiedene Handgesten (✌️, ✊ und ✋) aus dem Bilderstream der Kamera zu klassifizieren.
es: La “clasificación” es un tipo de algoritmo de aprendizaje automático que categoriza en varios grupos los ejemplos de un conjunto de datos. Para clasificar las distintas posturas de las manos (✊, ✋ y ✌️) que contiene una serie de imágenes de la cámara se utiliza [MLHandPoseClassifier](doc://com.apple.documentation/documentation/createml/mlhandposeclassifier).
es_419: La clasificación es un tipo de algoritmo de aprendizaje automático que categoriza los ejemplos de un conjunto de datos en diferentes grupos. Debes usar [MLHandPoseClassifier](doc://com.apple.documentation/documentation/createml/mlhandposeclassifier) para clasificar las distintas poses de mano (✊, ✋ y ✌️) a partir de una secuencia de imágenes de la cámara.
fr: Une « classification » est un type d’algorithme d’apprentissage automatique qui classe les exemples d’un ensemble de données dans différents groupes. Tu utiliseras le [MLHandPoseClassifier](doc://com.apple.documentation/documentation/createml/mlhandposeclassifier) pour classifier les différentes positions de la main (✊, ✋ et ✌️) d’un flux d’images de l’appareil photo.
it: La “classificazione” è un tipo di algoritmo di apprendimento automatico che categorizza esempi da un insieme di dati in vari gruppi. Utilizzerai [MLHandPoseClassifier](doc://com.apple.documentation/documentation/createml/mlhandposeclassifier) per classificare diverse pose (✊, ✋ e ✌️) da uno streaming di immagini dalla fotocamera.
ja: “分類”とは機械学習アルゴリズムの一種で、データセットからの例をさまざまなグループにカテゴリ分けします。カメラからのイメージのストリームからのさまざまな手の形（✊、✋、および✌️）を分類するには、[MLHandPoseClassifier](doc://com.apple.documentation/documentation/createml/mlhandposeclassifier)を使用します。
ko: ‘분류’는 데이터 세트의 예제를 다른 그룹으로 분류하는 기계 학습 알고리즘의 유형입니다. [MLHandPoseClassifier](doc://com.apple.documentation/documentation/createml/mlhandposeclassifier)를 사용하여 카메라에서 포착한 일련의 이미지에서 서로 다른 손 포즈(✊, ✋ 및 ✌️)를 분류합니다.
nl: "Classificatie" is een algoritme voor machinelearning dat voorbeelden uit een gegevensset onderverdeelt in verschillende groepen. Je gebruikt de [MLHandPoseClassifier](doc://com.apple.documentation/documentation/createml/mlhandposeclassifier) om verschillende handgebaren te classificeren (✊, ✋ en ✌️) in een afbeeldingenstroom uit de camera.
no: «Klassifikasjon» er en type maskinlæringsalgoritme som kategoriserer eksempler fra et datasett i forskjellige grupper. Du bruker [MLHandPoseClassifier](doc://com.apple.documentation/documentation/createml/mlhandposeclassifier) til å klassifisere forskjellige tegn (✊, ✌️ og ✋) fra en strøm med bilder fra kameraet.
pt: A “classificação” é um tipo de algoritmo de aprendizado de máquina que categoriza os exemplos de um conjunto de dados em grupos diferentes. Você usará [MLHandPoseClassifier](doc://com.apple.documentation/documentation/createml/mlhandposeclassifier) para classificar diversos sinais com a mão (✊, ✋ e ✌️) a partir de um fluxo de imagens da câmera.
sv: ”Klassificering” är en typ av maskininlärningsalgoritm som kategoriserar exempel från en datauppsättning i olika grupper. Du använder [MLHandPoseClassifier](doc://com.apple.documentation/documentation/createml/mlhandposeclassifier) till att klassificera olika handgester (✊, ✋ och ✌️) från en ström med bilder från kameran.
th: “การจัดประเภท” คืออัลกอริทึมการเรียนรู้ของเครื่องประเภทหนึ่งที่จะจัดหมวดหมู่ตัวอย่างจากชุดข้อมูลออกเป็นกลุ่มต่างๆ คุณจะได้ใช้ [MLHandPoseClassifier](doc://com.apple.documentation/documentation/createml/mlhandposeclassifier) เพื่อจัดประเภทท่าทางมือที่แตกต่างกัน (✊, ✋ และ ✌️) จากการสตรีมภาพจากกล้อง
tr: “Sınıflandırma”, bir veri kümesindeki örnekleri farklı gruplar hâlinde kategorize eden bir makine öğrenimi algoritması türüdür. Kameradan gelen görüntü akışındaki farklı el pozlarını (✊, ✋ ve ✌️) sınıflandırmak için [MLHandPoseClassifier](doc://com.apple.documentation/documentation/createml/mlhandposeclassifier) kullanacaksın.
vi: “Phân loại” là một kiểu thuật toán học máy có chức năng phân loại các ví dụ từ một tập dữ liệu thành các nhóm khác nhau. Bạn sẽ sử dụng [MLHandPoseClassifier](doc://com.apple.documentation/documentation/createml/mlhandposeclassifier) để phân loại các tư thế bàn tay khác nhau (✊, ✋ và ✌️) từ một kho hình ảnh từ camera.
zh_cn: “分类”是一种机器学习算法，可将数据集中的例子分类成不同的群组。你将使用 [MLHandPoseClassifier](doc://com.apple.documentation/documentation/createml/mlhandposeclassifier)（机器学习手势分类器）来分类一连串摄像头图像中的不同手势（✊、✋ 和 ✌️）。
zh_tw: 「分類」是一種機器學習演算法，它會將資料集的範例分類到不同的群組中。你將使用 [MLHandPoseClassifier](doc://com.apple.documentation/documentation/createml/mlhandposeclassifier) 對來自相機的影像串流中的不同手勢（✊、✋ 和 ✌️）進行分類。

source: To create a [machine learning model](glossary://machine%20learning%20model), you need to feed a large amount of data — in this case, images — to your classifier. This is called [training](glossary://training) your ML model, because you’re teaching it how to recognize different things.
de: Um ein [Modell für maschinelles Lernen](glossary://machine%20learning%20model) zu erstellen, musst du eine große Menge von Daten – in diesem Fall Bilder – für die Klassifizierung bereitstellen. Dieses Verfahren wird als [Trainieren](glossary://training) des ML-Modells bezeichnet, weil du dem Modell beibringst, verschiedene Objekte zu erkennen.
es: Para crear un [modelo de aprendizaje automático](glossary://machine%20learning%20model), tienes que proporcionarle al clasificador una gran cantidad de datos, en este caso, de imágenes. Esto se llama [entrenamiento](glossary://training) del modelo de aprendizaje automático (ML), porque le estás enseñando a reconocer distintas cosas.
es_419: Para crear un [modelo de aprendizaje automático](glossary://machine%20learning%20model), debes proporcionar una gran cantidad de datos (en este caso, imágenes) a tu clasificador. A este proceso se le llama [entrenar](glossary://training) el modelo de ML, ya que le estás enseñando a reconocer diferencias.
fr: Pour créer un [modèle d’apprentissage automatique](glossary://machine%20learning%20model), tu dois fournir à ton classificateur une grande quantité de données, des images dans notre cas. Cette opération est appelée l’[entraînement](glossary://training) de ton modèle d’apprentissage automatique, puisque tu lui apprends à reconnaître différentes choses.
it: Per creare un [modello di apprendimento automatico](glossary://machine%20learning%20model), devi fornire al classificatore una grande quantità di dati, in questo caso, immagini. Questo processo prende il nome di [addestramento](glossary://training) del modello di apprendimento automatico, perché gli stai insegnando a riconoscere diverse cose.
ja: [機械学習モデル](glossary://machine%20learning%20model)を作成するには、大量のデータ（今回はイメージ）を分類器に与える必要があります。さまざまなものを認識するように教えているので、これを機械学習モデルの[学習](glossary://training)と呼びます。
ko: [기계 학습 모델](glossary://machine%20learning%20model)을 생성하려면 대량의 데이터(이 경우 이미지)를 분류자에게 제공해야 합니다. 이를 ML 모델 [훈련](glossary://training)이라고 하는데, 서로 다른 사물을 인식하는 방법을 가르치기 때문입니다.
nl: Om een [model voor machinelearning](glossary://machine%20learning%20model) aan te maken, moet je een grote hoeveelheid gegevens, in dit geval afbeeldingen, invoeren in je classificatie-algoritme. Dit wordt het [trainen](glossary://training) van je ML-model genoemd, omdat je het model leert om verschillende dingen te herkennen.
no: For å lage en [maskinlæringsmodell](glossary://machine%20learning%20model) må du gi klassifisereren en stor mengde data – i dette tilfellet bilder. Dette kalles å [trene](glossary://training) maskinlæringsmodellen, siden du trener den opp til å gjenkjenne forskjellige ting.
pt: Para criar um [modelo de aprendizado de máquina](glossary://machine%20learning%20model), você precisa passar uma grande quantidade de dados (neste caso, imagens) para o classificador. Isso é chamado de [treinamento](glossary://training) do modelo de AM, já que você está ensinando ele a reconhecer coisas diferentes.
sv: När du skapar en [maskininlärningsmodell](glossary://machine%20learning%20model) måste du ge en stor mängd data, i det här fallet bilder, till klassificeraren. Det här kallas att [träna](glossary://training) maskininlärningsmodellen eftersom du tränar den att känna igen olika saker.
th: ในการสร้าง[โมเดลการเรียนรู้ของเครื่อง](glossary://machine%20learning%20model) คุณต้องป้อนข้อมูลจำนวนมาก ในกรณีนี้คือภาพ ไปยังตัวจัดประเภทของคุณ กระบวนการนี้เรียกว่า[การฝึก](glossary://training)โมเดล ML ของคุณ เพราะคุณกำลังสอนวิธีรู้จำสิ่งต่างๆ ให้กับเครื่อง
tr: Bir [makine öğrenimi modeli](glossary://machine%20learning%20model) yaratmak için sınıflandırıcına çok fazla veri (bu durumda görüntüler) vermen gerekir. Makine öğrenimi modeline farklı şeyleri tanımayı öğrettiğin için buna modelin [eğitimi](glossary://training) adı verilir.
vi: Để tạo ra một [mô hình học máy](glossary://machine%20learning%20model), bạn cần cung cấp một lượng lớn dữ liệu — trong trường hợp này là hình ảnh — cho bộ phân loại của mình. Đây được gọi là [huấn luyện](glossary://training) mô hình ML vì bạn đang dạy mô hình cách nhận biết những thứ khác nhau.
zh_cn: 如果要创建[机器学习模型](glossary://machine%20learning%20model)，你需要向分类器提供大量数据，本例中为图像。这个过程叫作[训练](glossary://training)机器学习模型，因为你在教它如何识别不同的东西。
zh_tw: 若要建立[機器學習模型](glossary://machine%20learning%20model)，你需要將大量資料（在本範例中為影像）提供給分類器。這稱為[訓練](glossary://training)你的 ML 模型，因為你正在教它如何辨識不同的事物。

source: You can think of a machine learning model as a machine’s brain and all the knowledge it knows about a certain type of pattern – in this case, hand poses.
de: Du kannst dir ein Modell für maschinelles Lernen wie das Gehirn einer Maschine vorstellen, in dem sich das gesamte erlernte Wissen über einen bestimmten Typ von Mustern – in diesem Fall Handgesten – befindet.
es: Puedes imaginar un modelo de aprendizaje automático como el cerebro de una máquina y todo el conocimiento que tiene sobre un determinado tipo de patrón, en este caso, posturas de las manos.
es_419: Puedes imaginar que un modelo de aprendizaje automático es el cerebro de una máquina que posee un conocimiento sobre un cierto tipo de patrón; en este caso, poses de manos.
fr: Tu peux considérer un modèle d’apprentissage automatique comme le cerveau d’une machine et toutes les connaissances qu’elle possède sur un certain type de pattern, les positions de la main dans notre cas.
it: Puoi considerare un modello di apprendimento automatico come il cervello di una macchina e tutte le competenze che possiede su un certo tipo di schema (in questo caso, pose delle mani).
ja: 機械学習モデルは、機械の頭脳と、特定の種類のパターン（今回は手の形）に関して機械が持っているすべての知識を合わせたものとして考えることができます。
ko: 기계 학습 모델을 기계의 두뇌와 특정 유형의 패턴에 대해 알고 있는 모든 지식으로 생각할 수 있습니다. 이 경우에는 손 포즈가 해당합니다.
nl: Je kunt een model voor machinelearning beschouwen als het brein van een machine met daarin alle kennis over een bepaald soort patroon, in dit geval handgebaren.
no: Du kan se for deg en maskinlæringsmodell som maskinens hjerne og all kunnskapen den har om et bestemt mønster – i dette tilfellet håndtegn.
pt: Pense em um modelo de aprendizado de máquina como um cérebro de máquina e todo o conhecimento que ele tem sobre um certo tipo de padrão (neste caso, sinais com a mão).
sv: Du kan tänka på en maskininlärningsmodell som hjärnan i en maskin och all den kunskap den har om en viss typ av mönster – i det här fallet handgester.
th: คุณสามารถคิดว่าโมเดลการเรียนรู้ของเครื่องคือสมองของเครื่องและความรู้ทั้งหมดที่เครื่องทราบเกี่ยวกับรูปแบบบางประเภท ในกรณีนี้คือ ท่าทางมือ
tr: Makine öğrenimi modelini makinenin beyni ve belirli bir örüntü türü (bu durumda el pozları) hakkında bildiği bilgilerin tümü olarak düşünebilirsin.
vi: Bạn có thể hình dung mô hình học máy giống như bộ não của máy và tất cả kiến thức mà máy đó biết về một loại khuôn mẫu nhất định – trong trường hợp này là các tư thế bàn tay.
zh_cn: 你可以把机器学习模型当作机器的大脑以及大脑所掌握的与某一种模式相关的所有知识，本例中为手势。
zh_tw: 你可以將機器學習模型視為機器的大腦，以及它所知道關於某種類型模式的所有知識，在這個例子中是手勢。
