Repository: JulioPr0/ml-rock-paper-scissors
Catalog: Rock, Paper, Scissors game with ML.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: If so, try changing the logic by modifying which moves beat the others. How does this change your game?
de: Wenn du das möchtest, musst du die Logik entsprechend ändern und festlegen, welcher Spielzug die anderen schlägt. Welchen Einfluss hat das auf dein Spiel?
es: Si quieres, intenta cambiar la lógica modificando qué jugadas ganan a otras. ¿Cómo cambia esto el juego?
es_419: Si te parece bien, intenta cambiar la lógica modificando qué movimiento vence a los otros. ¿Cómo se ve este cambio en el juego?
fr: Dans ce cas, essaie de changer la logique en modifiant quels coups battent les autres. En quoi cela change-t-il ton jeu ?
it: Se vuoi, prova a modificare la logica cambiando quali mosse battono le altre. Come cambia il gioco?
ja: そうであれば、どの手がどの手に勝つかを変更してロジックを変えてみましょう。これでゲームはどう変わるでしょうか?
ko: 그렇다면, 어떤 동작이 다른 동작을 이기는지 수정하여 로직에 변화를 줘 보세요. 게임이 어떻게 바뀌나요?
nl: Als je dat wilt, moet je de logica wijzigen door aan te passen welke zetten de andere zetten verslaan. Welk effect heeft dit op je game?
no: Da kan du tilpasse logikken ved å endre hvilke trekk som slår de andre. Hvordan påvirker dette spillet?
pt: Nesse caso, experimente mudar a lógica e modifique quais movimentos ganham uns dos outros. Como isso muda o jogo?
sv: Om du vill det ändrar du logiken genom att modifiera vilka drag som slår de andra. Hur förändrar det spelet?
th: ถ้าเป็นเช่นนั้น ลองเปลี่ยนตรรกะด้วยการแก้ไขท่าที่ชนะท่าอื่นๆ การทำเช่นนี้จะเปลี่ยนแปลงเกมของคุณอย่างไร
tr: Öyleyse hangi hareketin diğerlerini yeneceğini değiştirerek mantığı değiştirmeyi dene. Bu, oyunu nasıl değiştirdi?
vi: Nếu vậy, hãy thử thay đổi logic bằng cách sửa đổi nước đi nào thắng các nước đi khác. Việc này thay đổi trò chơi của bạn như thế nào?
zh_cn: 如果想的话，尝试修改哪个动作可以打败哪个来更改逻辑。游戏会因此发生什么变化呢？
zh_tw: 如果是這樣，請嘗試透過修改哪些動作贏過其他動作來更改邏輯。這樣會如何改變你的遊戲呢？

source: What if you added a new move that beats everything?
de: Was wäre denn, wenn du einen neuen Spielzug hinzufügen würdest, der alle anderen schlägt?
es: ¿Y si añadieras una nueva jugada que le ganara a todo?
es_419: ¿Y si agregaras un movimiento nuevo que vence a todos los demás?
fr: Et si tu ajoutais un nouveau coup qui battait tous les autres ?
it: E se aggiungessi una nuova mossa che le batte tutte?
ja: すべてに勝つ新しい手を追加したらどうなるでしょうか?
ko: 모두 이기는 새로운 동작을 추가한다면 어떨까요?
nl: Stel dat je een nieuwe zet toevoegt die alle andere zetten verslaat.
no: Hva skjer hvis du legger til et nytt trekk som slår alle de andre?
pt: E se você adicionasse um movimento que ganhasse de todos os outros?
sv: Vad händer om du lägger till ett nytt drag som slår allt?
th: จะเกิดอะไรขึ้นหากคุณเพิ่มท่าใหม่ที่ชนะทุกอย่าง
tr: Peki ya her şeyi yenen yeni bir hareket eklersen?
vi: Nếu bạn đã thêm một nước đi mới thắng mọi nước đi thì sao?
zh_cn: 如果添加了可以打败一切的新动作会怎么样呢？
zh_tw: 假如你加入了一個可以贏過一切的新動作會發生什麼事呢？

source: Try adding a new move by yourself, and customize the game to your heart’s content:
de: Versuche auf eigene Faust, einen neuen Spielzug hinzuzufügen, und passe das Spiel so an, wie es dir gefällt:
es: Intenta añadirla sin ayuda y personaliza el juego según cómo quieres que funcione:
es_419: Intenta agregar un movimiento nuevo y personaliza el juego a tu gusto:
fr: Essaie d’ajouter un nouveau coup par toi-même et personnalise le jeu à ta guise :
it: Prova ad aggiungere una nuova mossa autonomamente e personalizza il gioco a tuo piacimento:
ja: 自分で新しい手を追加してみて、思う存分にゲームをカスタマイズしてみましょう:
ko: 나만의 새로운 동작을 추가하고 게임을 마음껏 사용자화해 보세요.
nl: Voeg zelf een nieuwe zet toe en pas de game aan je eigen wensen aan:
no: Prøv å legge til et nytt trekk selv, slik at du kan tilpasse spillet helt fritt:
pt: Tente adicionar um novo movimento por conta própria e personalize o jogo da maneira que você quiser:
sv: Försök att lägga till ett nytt drag på egen hand och anpassa spelet precis som du vill:
th: ลองเพิ่มท่าใหม่ด้วยตัวคุณเอง และกำหนดเกมให้มีเนื้อหาตามใจของคุณ:
tr: Kendin yeni bir hareket eklemeyi dene ve oyunu istediğin gibi özelleştir:
vi: Thử tự mình thêm một nước đi mới và tùy chỉnh trò chơi theo nội dung mong muốn của bạn:
zh_cn: 试着自己添加一个新动作，然后根据你的想法自定游戏：
zh_tw: 嘗試自己加入新動作，並且根據自己的喜好來自訂遊戲：

source: let panda = GameMove(name: "panda", icon: "🐼") panda.beats([rock,paper,scissors]) validMoves[panda.name] = panda
th: let panda = GameMove(name: "แพนด้า", icon: "🐼") panda.beats([rock,paper,scissors]) validMoves[panda.name] = panda
zh_cn: let panda = GameMove(name: "熊猫", icon: "🐼") panda.beats([rock,paper,scissors]) validMoves[panda.name] = panda

source: When you’re done configuring your game, change the rules back to the basic Rock, Paper, Scissors game logic.
de: Wenn du mit dem Konfigurieren deines Spiels fertig bist, ändere die Regeln wieder zurück auf die Standardlogik für „Schere, Stein, Papier“.
es: Cuando hayas terminado de configurar el juego, devuelve las reglas a como estaban antes, a la lógica básica del juego “Piedra, papel o tijera”.
es_419: Cuando hayas terminado de configurar tu juego, revierte las reglas a la lógica original del juego Piedra, papel o tijeras.
fr: Lorsque tu as terminé la configuration de ton jeu, modifie les règles pour revenir à la logique de base du jeu Pierre, papier, ciseaux.
it: Quando hai finito di configurare, riporta le regole alla logica di un gioco Sasso, carta, forbici di base.
ja: ゲームの設定をいじり終えたら、ルールを基本的なじゃんけんゲームのロジックに戻しておきましょう。
ko: 게임 구성을 마쳤으면 기본 가위, 바위, 보 게임 로직으로 규칙을 다시 변경합니다.
nl: Als je klaar bent met het configureren van je game, verander je de regels terug naar de standaardlogica voor de Steen, papier, schaar-game.
no: Når du har konfigurert spillet, endrer du reglene tilbake til den grunnleggende logikken for stein, saks, papir.
pt: Quando terminar de configurar o jogo, mude as regras de volta para a lógica padrão do jogo Pedra, Papel e Tesoura.
sv: När du är klar med konfigureringen av spelet ändrar du tillbaka reglerna till den grundläggande spellogiken för Sten, sax, påse.
th: เมื่อคุณกำหนดค่าเกมของคุณเสร็จแล้ว ให้เปลี่ยนกฎกลับไปเป็นตรรกะเกมเป่ายิ้งฉุบพื้นฐาน
tr: Oyununu ayarlamayı bitirdikten sonra kuralları yeniden temel Taş, Kâğıt, Makas oyun mantığına değiştir.
vi: Khi bạn hoàn tất định cấu hình trò chơi, hãy thay đổi các quy tắc trở lại thành logic trò chơi Kéo Búa Bao cơ bản.
zh_cn: 配置完游戏后，将规则改回“石头剪刀布”游戏的基本逻辑。
zh_tw: 完成遊戲的配定後，將規則改回基本的「剪刀、石頭、布」遊戲邏輯。

source: Replace all of the code in the initializer with this code:
de: Ersetze den gesamten Code in der Initialisierung durch diesen Code:
es: Sustituye todo el código del inicializador por este otro:
es_419: Reemplaza todo el código del inicializador con este:
fr: Remplace tout le code de l’initialiseur par celui-ci :
it: Sostituisci tutto il codice nell’inizializzatore con questo codice:
ja: 初期化子内のコード全体を以下のコードで置き換えます:
ko: 이니셜라이저의 모든 코드를 다음 코드로 대치합니다.
nl: Vervang alle code in de initializer door deze code:
no: Bytt ut all koden i initialisereren med denne koden:
pt: Substitua todo o código no inicializador por este código:
sv: Ersätt all kod i initieraren med den här koden:
th: แทนที่โค้ดทั้งหมดในตัวเริ่มต้นด้วยโค้ดนี้:
tr: İlk değer atayıcıdaki kodun tümünü bu kodla değiştir:
vi: Thay thế tất cả mã trong trình khởi tạo bằng mã này:
zh_cn: 使用这些代码来替换构造器中的所有代码：
zh_tw: 用這段程式碼取代初始化程序中的所有程式碼：

source: let rock = GameMove(name: "rock", icon: "✊") let paper = GameMove(name: "paper", icon: "✋") let scissors = GameMove(name: "scissors", icon: "✌️") rock.beats([scissors]) paper.beats([rock]) scissors.beats([paper]) validMoves[rock.name] = rock validMoves[paper.name] = paper validMoves[scissors.name] = scissors
de: let rock = GameMove(name: "Stein", icon: "✊") let paper = GameMove(name: "Papier", icon: "✋") let scissors = GameMove(name: "Schere", icon: "✌️") rock.beats([scissors]) paper.beats([rock]) scissors.beats([paper]) validMoves[rock.name] = rock validMoves[paper.name] = paper validMoves[scissors.name] = scissors
es: let rock = GameMove(name: "piedra", icon: "✊") let paper = GameMove(name: "papel", icon: "✋") let scissors = GameMove(name: “tijeras", icon: "✌️") rock.beats([scissors]) paper.beats([rock]) scissors.beats([paper]) validMoves[rock.name] = rock validMoves[paper.name] = paper validMoves[scissors.name] = scissors ```
th: let rock = GameMove(name: "ค้อน", icon: "✊") let paper = GameMove(name: "กระดาษ", icon: "✋") let scissors = GameMove(name: "กรรไกร", icon: "✌️") rock.beats([scissors]) paper.beats([rock]) scissors.beats([paper]) validMoves[rock.name] = rock validMoves[paper.name] = paper validMoves[scissors.name] = scissors
tr: let rock = GameMove(name: "taş", icon: "✊") let paper = GameMove(name: "kâğıt", icon: "✋") let scissors = GameMove(name: "makas", icon: "✌️") rock.beats([scissors]) paper.beats([rock]) scissors.beats([paper]) validMoves[rock.name] = rock validMoves[paper.name] = paper validMoves[scissors.name] = scissors
zh_cn: let rock = GameMove(name: "石头", icon: "✊") let paper = GameMove(name: "布", icon: "✋") let scissors = GameMove(name: "剪刀", icon: "✌️") rock.beats([scissors]) paper.beats([rock]) scissors.beats([paper]) validMoves[rock.name] = rock validMoves[paper.name] = paper validMoves[scissors.name] = scissors

source: For more details about creating your own Rock, Paper, Scissors game, see the [Rock, Paper, Scissors](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.rockpaperscissors.edition4) playground book.
de: Weitere Infos zum Erstellen deines eigenen „Schere, Stein, Papier“-Spiels findest du im Playground-Buch [Schere, Stein, Papier](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.rockpaperscissors.edition4).
es: Para obtener información más detallada sobre cómo crear el juego “Piedra, papel o tijera”, consulta el libro de áreas de juegos [Piedra, papel o tijera](x-com-apple-playgrounds://documents?documentId=com.apple.playgrounds.rockpaperscissors.edition4).
es_419: Para obtener más detalles sobre cómo crear tu propio juego de este tipo, consulta el playground [Piedra, papel o tijeras](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.rockpaperscissors.edition4).
fr: Pour en savoir plus sur la création de ton propre jeu Pierre, papier, ciseaux, consulte le livre playground [Pierre, papier, ciseaux](x-com-apple-playgrounds://documents?documentId=com.apple.playgrounds.rockpaperscissors.edition4).
it: Per ulteriori dettagli su come creare il tuo gioco Sasso, carta, forbici, consulta il libro del playground [Sasso, carta, forbici](x-com-apple-playgrounds://documents?documentId=com.apple.playgrounds.rockpaperscissors.edition4).
ja: 自分だけのじゃんけんゲームを作ることについて詳しくは、[じゃんけん](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.rockpaperscissors.edition4)プレイグラウンドブックを参照してください。
ko: 나만의 가위, 바위, 보 게임을 생성하는 자세한 사항은 [가위, 바위, 보](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.rockpaperscissors.edition4) 플레이그라운드 책을 참조하세요.
nl: Raadpleeg het playgroundboek [Steen, papier, schaar](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.rockpaperscissors.edition4) voor meer informatie over het maken van je eigen Steen, papier, schaar-game.
no: Hvis du vil ha mer informasjon om hvordan du lager ditt eget stein, saks, papir-spill, kan du se playground-boken [Rock, Paper, Scissors](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.rockpaperscissors.edition4).
pt: Para ver mais detalhes sobre como criar o seu próprio jogo de Pedra, Papel e Tesoura, consulte o livro do playground [Pedra, Papel e Tesoura](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.rockpaperscissors.edition4).
sv: För mer information om hur du skapar ditt eget Sten, sax, påse-spel, se playgroundboken [Sten, sax, påse](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.rockpaperscissors.edition4).
th: สำหรับรายละเอียดเพิ่มเติมเกี่ยวกับการสร้างเกมเป่ายิ้งฉุบของคุณเอง ให้ดูที่หนังสือ Playground [เป่ายิ้งฉุบ](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.rockpaperscissors.edition4)
tr: Kendi Taş, Kâğıt, Makas oyununu yaratma hakkında daha fazla ayrıntı için [Taş, Kâğıt, Makas](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.rockpaperscissors.edition4) oyun alanı kitabına bak.
vi: Để biết thêm chi tiết về cách tạo ra trò chơi Kéo Búa Bao của riêng bạn, hãy xem sách playground [Kéo Búa Bao](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.rockpaperscissors.edition4).
zh_cn: 有关创建专属“石头剪刀布”游戏的更多详细信息，你可以参阅[石头剪刀布](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.rockpaperscissors.edition4) Playground 图书。
zh_tw: 若要進一步瞭解製作自己的「剪刀、石頭、布」遊戲的詳細資訊，請參閱 [Rock, Paper, Scissors](x-com-apple-playgrounds://projects?contentId=com.apple.playgrounds.rockpaperscissors.edition4) Playground 書籍。

# GuideBook..Guide0..StepGet Started with Machine Learning..TaskGroup1..title
source: Using machine learning to recognize gestures
de: Maschinelles Lernen zum Erkennen von Gesten verwenden
es: Uso del aprendizaje automático para reconocer posturas
es_419: Usar aprendizaje automático para reconocer gestos
fr: Utilisation de l’apprentissage automatique pour reconnaître des gestes
it: Utilizzare l’apprendimento automatico per riconoscere i gesti
ja: 機械学習を使ってジェスチャを認識させる
ko: 기계 학습을 사용하여 제스처 인식하기
nl: Machinelearning gebruiken om gebaren te herkennen
no: Bruk maskinlæring til å gjenkjenne tegn
pt: Usando aprendizado de máquina para reconhecer gestos
sv: Använda maskininlärning till att känna igen gester
th: การใช้การเรียนรู้ของเครื่องเพื่อรู้จำท่าทาง
tr: Hareketleri tanımak için makine öğrenimini kullanma
vi: Sử dụng học máy để nhận biết các cử chỉ
zh_cn: 使用机器学习来识别手势
zh_tw: 使用機器學習模型辨識手勢

source: Learn the fundamentals of machine learning
de: Grundlagen des maschinellen Lernens
es: Aspectos básicos del aprendizaje automático
es_419: Fundamentos del aprendizaje automático
fr: Découvrir les notions fondamentales de l’apprentissage automatique
it: Concetti fondamentali dell’apprendimento automatico
ja: 機械学習の基本を学ぶ
ko: 기계 학습의 기초 배우기
nl: De basisbeginselen van machinelearning
no: Lær det grunnleggende om maskinlæring
pt: Aprenda os fundamentos do aprendizado de máquina
sv: Lär dig grunderna om maskininlärning
th: เรียนรู้พื้นฐานของการเรียนรู้ของเครื่อง
tr: Makine öğreniminin temellerini öğrenme
vi: Tìm hiểu các nguyên tắc cơ bản của học máy
zh_cn: 了解机器学习的基础知识
zh_tw: 瞭解機器學習的基本知識

source: Find out how machine learning makes predictions from data.
de: Erfahre, wie maschinelles Lernen auf Grundlage von Daten Vorhersagen macht.
es: Descubre cómo hace predicciones el aprendizaje automático a partir de los datos.
es_419: Averigua cómo el aprendizaje automático hace predicciones a partir de los datos.
fr: Découvre comment l’apprentissage automatique réalise des prédictions à partir des données.
it: Scopri in che modo l’apprendimento automatico effettua previsioni a partire dai dati.
ja: 機械学習がデータからどのように予測するのかを理解しましょう。
ko: 기계 학습이 데이터를 기반으로 어떻게 예측하는지 알아보세요.
nl: Ontdek hoe machinelearning voorspellingen doet op basis van gegevens.
no: Finn ut hvordan maskinlæring bruker data til å lage prediksjoner.
pt: Descubra como o aprendizado de máquina faz previsões a partir de dados.
sv: Ta reda på hur maskininlärning gör förutsägelser från data.
th: ทราบวิธีที่การเรียนรู้ของเครื่องคาดคะเนจากข้อมูล
tr: Makine öğreniminin verileri kullanarak nasıl tahminde bulunduğunu öğren.
vi: Tìm hiểu cách học máy đưa ra các dự đoán từ dữ liệu.
zh_cn: 弄清楚机器学习是如何基于数据进行预测的。
zh_tw: 瞭解機器學習如何從資料進行預測。

source: [Machine learning](glossary://machine%20learning) is the process of how you can “teach” computers, like your iPad or Mac, to make educated guesses by providing them lots of examples, or data.
de: Mit [maschinellem Lernen](glossary://machine%20learning) kannst du Computern wie deinem iPad oder Mac durch Bereitstellen vieler verschiedener Beispiele oder Daten „beibringen“, Vermutungen aufzustellen.
es: El [aprendizaje automático](glossary://machine%20learning) es el proceso de “enseñar” a los ordenadores, como el iPad o el Mac, a hacer suposiciones fundamentadas proporcionándoles muchos ejemplos, o datos.
es_419: El [aprendizaje automático](glossary://machine%20learning) es el proceso mediante el cual puedes “enseñarle” a las computadoras, como tu iPad o Mac, a hacer suposiciones informadas tras haberles proporcionado muchos ejemplos (es decir, datos).
fr: L’[apprentissage automatique](glossary://machine%20learning) est le processus par lequel tu peux « apprendre » à des ordinateurs, comme ton iPad ou ton Mac, à faire des hypothèses éclairées en leur fournissant de nombreux exemples, ou données.
it: L’[apprendimento automatico](glossary://machine%20learning) è il processo attraverso il quale si può “insegnare” ai computer, come iPad o il Mac, a formulare ipotesi ragionate fornendo loro molti esempi o dati.
ja: [機械学習](glossary://machine%20learning)とは、iPadやMacといったコンピュータに、大量の例（データ）を与えることで、経験に基づいた推測ができるように“教える”プロセスです。
ko: [기계 학습](glossary://machine%20learning)은 iPad 또는 Mac과 같은 컴퓨터를 ‘가르치는’ 방법에 대한 프로세스로, 대량의 예시나 데이터를 제공하여 지식에 근거한 추측을 가능하게 합니다.
nl: [Machinelearning](glossary://machine%20learning) is het proces waarbij je computers, zoals een iPad of Mac, "leert" hoe ze goed onderbouwde voorspellingen kunnen doen door ze van veel voorbeelden (gegevens) te voorzien.
no: [Maskinlæring](glossary://machine%20learning) er prosessen du kan bruke til å «lære opp» datamaskiner, for eksempel iPad eller Mac, til å komme med kvalifiserte gjetninger ved å gi dem mange eksempler, eller data.
pt: O [aprendizado de máquina](glossary://machine%20learning) é o processo de como você pode “ensinar” computadores, como o iPad ou Mac, a dar um palpite depois de fornecer a eles muitos exemplos (ou dados).
sv: [Maskininlärning](glossary://machine%20learning) är den process du kan använda till att ”lära” datorer, som en iPad eller Mac, att göra kvalificerade gissningar genom att ge dem massor av exempel (data).
th: [การเรียนรู้ของเครื่อง](glossary://machine%20learning)คือกระบวนการของวิธีที่คุณ “สอน” คอมพิวเตอร์ เช่น iPad หรือ Mac ของคุณเพื่อทำการคาดเดาจากการเรียนรู้ด้วยการให้ตัวอย่างหรือข้อมูลจำนวนมาก
tr: [Makine öğrenimi](glossary://machine%20learning), iPad'iniz veya Mac'iniz gibi bilgisayarlara çok fazla örnek veya veri vererek onlara bilgiye ve deneyime dayanan tahminlerde bulunmayı “öğretme” işlemidir.
vi: [Học máy](glossary://machine%20learning) là quá trình mà bạn có thể “dạy” các máy tính, như iPad hoặc máy Mac, để đưa ra các phán đoán được huấn luyện bằng cách cung cấp cho chúng nhiều ví dụ hoặc dữ liệu.
zh_cn: [机器学习](glossary://machine%20learning)是给电脑（如 iPad 或 Mac）提供大量的例子或数据，然后“教”它们做出有依据的猜测的过程。
zh_tw: [機器學習](glossary://machine%20learning)是一個過程，是你如何透過提供大量範例或資料來「教導」電腦（如 iPad 或 Mac）做出有根據的猜測。

source: Because they’re so smart (🧠), humans can see very few examples of hand poses and immediately tell the difference between ✊ and ✌️. However, a computer requires many examples of those hand poses to correctly identify them.
de: Da Menschen schlau (🧠) sind, reichen ein paar wenige Beispiele für Handgesten, um sofort den Unterschied zwischen ✌️ und ✊ zu erkennen. Ein Computer braucht dafür aber sehr viele Beispiele, um die Handgesten korrekt identifizieren zu können.
es: Como son tan inteligentes (🧠), a los humanos les hacen falta muy pocos ejemplos de posturas de las manos para detectar inmediatamente la diferencia entre ✊ y ✌️. Sin embargo, los ordenadores requieren muchos ejemplos de esas posturas para identificarlas correctamente.
es_419: Como son tan inteligentes (🧠), los humanos pueden diferenciar entre ✊ y ✌️ después de haber visto apenas unos cuantos ejemplos de poses de manos. Sin embargo, una computadora requiere muchos ejemplos de estas poses para poder identificarlas correctamente.
fr: Parce qu’ils sont très intelligents (🧠), les humains peuvent voir très peu d’exemples de positions de la main et faire immédiatement la différence entre ✊ et ✌️. Cependant, un ordinateur a besoin de nombreux exemples de positions pour pouvoir les identifier correctement.
it: Dal momento che sono molto intelligenti (🧠), gli umani possono vedere anche solo pochi esempi di pose delle mani e capire immediatamente la differenza tra ✊ e ✌️. Un computer, invece, richiede molti esempi di pose delle mani per identificarle.
ja: 人間はとても賢い（🧠）ので、手の形をほんのいくつか見れば、すぐに✊と✌️の違いが分かります。ですが、コンピュータがそれらを正しく識別できるようになるには、その手の形の例が数多く必要です。
ko: 인간은 매우 똑똑(🧠)하기 때문에 몇 안되는 손 포즈로도 ✊와 ✌️의 차이를 바로 구별해 낼 수 있습니다. 하지만 컴퓨터는 많은 예제의 손 포즈를 필요로 합니다.
nl: Omdat ze zo slim zijn (🧠), kunnen mensen op basis van slechts een paar voorbeelden onmiddellijk het verschil zien tussen ✊ en ✌️. Een computer heeft daarentegen een groot aantal voorbeelden van die handgebaren nodig om ze goed te kunnen herkennen.
no: Siden mennesker er så smarte (🧠), trenger vi bare å se noen få eksempler på tegnene for å kunne se forskjellen mellom ✊ og ✌️. Men en datamaskin må se mange eksempler på tegnene for å kunne identifisere dem.
pt: Por serem muito inteligentes (🧠), os humanos podem ver apenas alguns exemplos de sinais com a mão e notar imediatamente a diferença entre ✊ e ✌️. Mas um computador requer muitos exemplos desses sinais com a mão para identificá‑los corretamente.
sv: Eftersom de är så smarta (🧠) kan människor se några få exempel på handgester och omedelbart se skillnaden mellan ✊ och ✌️. En dator kräver däremot många exempel på de handgesterna innan den kan identifiera dem träffsäkert.
th: เนื่องจากมีความฉลาดมาก (🧠) มนุษย์จึงสามารถดูตัวอย่างของท่าทางมือเพียงเล็กน้อยแล้วบอกความแตกต่างระหว่าง ✊ และ ✌️ ได้ทันที แต่คอมพิวเตอร์ต้องใช้ตัวอย่างของท่าทางมือจำนวนมากเพื่อให้ระบุได้อย่างถูกต้อง
tr: İnsanlar çok zeki oldukları için (🧠) çok az el pozu görüp ✊ ile ✌️ arasındaki farkı hemen söyleyebilir. Ancak bir bilgisayarın bunları doğru bir şekilde belirleyebilmesi için çok fazla örnek gerekir.
vi: Bởi vì con người rất thông minh (🧠) nên họ chỉ cần nhìn thấy rất ít ví dụ về các tư thế bàn tay và ngay lập tức chỉ ra sự khác biệt giữa ✊ và ✌️. Tuy nhiên, máy tính yêu cầu nhiều ví dụ về những tư thế bàn tay này để có thể nhận dạng đúng.
zh_cn: 人类很聪明 (🧠)，只需看很少的手势例子就能立即区分 ✊ 和 ✌️。然而，电脑需要很多此类手势的例子来正确识别它们。
zh_tw: 因為它們非常聰明（🧠），人類可以看到很少的手勢範例並立即區分 ✊ 和 ✌️ 之間的差別。但是，電腦需要許多這些手勢範例才能正確地辨識它們。
