Repository: JulioPr0/ml-rock-paper-scissors
Catalog: Rock, Paper, Scissors game with ML.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

# GuideBook..title
source: Get Started with Machine Learning
de: Los gehts mit maschinellem Lernen
es: Introducción al aprendizaje automático
es_419: Introducción al aprendizaje automático
fr: Premiers pas avec l’apprentissage automatique
it: Introduzione all’apprendimento automatico
ja: 機械学習を始めよう
ko: 기계 학습 시작하기
nl: Aan de slag met machinelearning
no: Kom i gang med maskinlæring
pt: Comece com o Aprendizado de Máquina
sv: Kom igång med maskininlärning
th: เริ่มต้นใช้การเรียนรู้ของเครื่อง
tr: Makine Öğrenimine Giriş
vi: Bắt đầu với học máy
zh_cn: 机器学习入门
zh_tw: 機器學習入門

# GuideBook..WelcomeMessageGet Started with Machine Learning..title
source: Get Started with Machine Learning
de: Los gehts mit maschinellem Lernen
es: Introducción al aprendizaje automático
es_419: Introducción al aprendizaje automático
fr: Premiers pas avec l’apprentissage automatique
it: Introduzione all’apprendimento automatico
ja: 機械学習を始めよう
ko: 기계 학습 시작하기
nl: Aan de slag met machinelearning
no: Kom i gang med maskinlæring
pt: Comece com o Aprendizado de Máquina
sv: Kom igång med maskininlärning
th: เริ่มต้นใช้การเรียนรู้ของเครื่อง
tr: Makine Öğrenimine Giriş
vi: Bắt đầu với học máy
zh_cn: 机器学习入门
zh_tw: 機器學習入門

# GuideBook..WelcomeMessageGet Started with Machine Learning..Paragraph0
source: Welcome! In this sample, you’ll transform a Rock, Paper, Scissors game into a full-fledged machine learning (ML) app.
de: Herzlich Willkommen! In diesem Beispiel verwandelst du ein „Schere, Stein, Papier“-Spiel in eine vollwertige App zum maschinellen Lernen (ML).
es: Te damos la bienvenida. En este ejemplo, transformarás un típico juego de “Piedra, papel o tijera” en una completa app de aprendizaje automático (ML).
es_419: Te damos la bienvenida a esta muestra, en donde transformarás un juego de Piedra, papel o tijeras en una app de aprendizaje automático (ML).
fr: Bienvenue ! Dans cet échantillon, tu vas transformer un jeu Pierre, papier, ciseaux en une app d’apprentissage automatique à part entière.
it: Ti diamo il benvenuto! In questo playground di esempio, trasformerai un gioco Sasso, carta, forbici in un’app di apprendimento automatico a pieno titolo.
ja: ようこそ! このサンプルでは、じゃんけんゲームを本格的な機械学習（ML）Appに変身させます。
ko: 환영합니다! 이 샘플에서는 가위, 바위, 보 게임을 모든 기능이 갖춰진 기계 학습(ML) 앱으로 변환합니다.
nl: Welkom! In dit voorbeeld ga je een Steen, papier, schaar-game veranderen in een complete ML-app (machinelearning).
no: Velkommen! I dette eksempelet skal du forvandle et stein, saks, papir-spill til en fullverdig maskinlæringsapp.
pt: Olá! Nesta amostra, você transformará um jogo de Pedra, Papel e Tesoura em um app de aprendizado de máquina (AM) completo.
sv: Välkommen! I det här exemplet förvandlar du ett Sten, sax, påse-spel till en fullfjädrad maskininlärningsapp.
th: ยินดีต้อนรับ! ในตัวอย่างนี้ คุณจะได้เปลี่ยนเกมเป่ายิ้งฉุบให้เป็นแอปการเรียนรู้ของเครื่อง (ML) โดยสมบูรณ์
tr: Merhaba! Bu örnekte bir Taş, Kâğıt, Makas oyununu tam bir makine öğrenimi (ML) uygulamasına dönüştüreceksin.
vi: Chào mừng bạn! Trong mẫu này, bạn sẽ biến đổi một trò chơi Kéo Búa Bao thành một ứng dụng học máy (ML) đầy đủ chức năng.
zh_cn: 欢迎你！在这个示例中，你会将“石头剪刀布”游戏转换为经过充分训练的机器学习 (ML) App。
zh_tw: 歡迎！在此範例中，你會將「剪刀、石頭、布」遊戲轉換為成熟的機器學習（ML）App。

# GuideBook..Guide0..StepGet Started with Machine Learning..title
source: Get Started with Machine Learning
de: Los gehts mit maschinellem Lernen
es: Introducción al aprendizaje automático
es_419: Introducción al aprendizaje automático
fr: Premiers pas avec l’apprentissage automatique
it: Introduzione all’apprendimento automatico
ja: 機械学習を始めよう
ko: 기계 학습 시작하기
nl: Aan de slag met machinelearning
no: Kom i gang med maskinlæring
pt: Comece com o Aprendizado de Máquina
sv: Kom igång med maskininlärning
th: เริ่มต้นใช้การเรียนรู้ของเครื่อง
tr: Makine Öğrenimine Giriş
vi: Bắt đầu với học máy
zh_cn: 机器学习入门
zh_tw: 機器學習入門

source: Have you played the game Rock, Paper, Scissors before? It’s a two player game where you can choose one of three actions, each beating one another:
de: Hast du schon mal „Schere, Stein, Papier“ gespielt? Dabei handelt es sich um ein Spiel für zwei Personen, bei dem du dich für eine von drei Aktionen entscheiden kannst, um die Aktion der anderen zu schlagen:
es: ¿Has jugado alguna vez a “Piedra, papel o tijera”? Es un juego para dos personas en el que puedes elegir una de tres acciones, y cada una gana a otra:
es_419: ¿Alguna vez has jugado Piedra, papel o tijeras? Es un juego para dos personas en donde eliges una de tres acciones, y cada una vence a otra:
fr: As-tu déjà joué à Pierre, papier, ciseaux ? Il s’agit d’un jeu qui se joue à deux, dans lequel tu peux choisir l’une des trois actions, chacune en battant une autre :
it: Hai mai giocato a Sasso, carta, forbici? Si gioca in due e si può scegliere un’azione fra le tre disponibili. Ognuna di queste vince su una delle altre due:
ja: 今までにじゃんけんをしたことはありますか? 2人で行うゲームで、3つの手のいずれかを選択します。それぞれが別の手に勝ちます:
ko: 가위, 바위, 보 게임을 해 본 적이 있나요? 2인용 게임으로 세 가지 동작 중 하나를 선택할 수 있으며, 각각 서로 다른 동작을 이기는 게임입니다.
nl: Heb je wel eens de game Steen, papier, schaar gespeeld? Dit is een game voor twee spelers waarin je drie handgebaren kunt kiezen die alle drie een van de andere gebaren verslaan:
no: Har du spilt stein, saks, papir? Det er et spill for to spillere, som går ut på at man skal velge ett av de tre tegnene, som alle slår et annet tegn:
pt: Você já jogou Pedra, Papel e Tesoura? Um jogo para dois jogadores onde você pode escolher uma de três ações que ganham uma da outra:
sv: Har du spelat Sten, sax, påse någon gång? Det är en handlek för två spelare där du väljer en av tre åtgärder. Var och en av åtgärderna slår någon annan:
th: คุณเคยเล่นเกมเป่ายิ้งฉุบมาก่อนไหม เกมนี้เป็นเกมผู้เล่นสองคนที่คุณสามารถเลือกหนึ่งจากสามท่า ซึ่งแต่ละท่าจะชนะท่าอื่นหนึ่งท่า:
tr: Taş, Kâğıt, Makas oyununu daha önce hiç oynadın mı? Her biri diğerini yenen üç eylemden birini seçtiğin bir oyundur:
vi: Bạn đã từng chơi trò chơi Kéo Búa Bao trước đây chưa? Đó là một trò chơi gồm hai người chơi mà bạn có thể chọn một trong ba hành động, mỗi hành động sẽ thắng hành động còn lại:
zh_cn: 你玩过“石头剪刀布”的游戏吗？游戏需要两位玩家，你可以从三个动作中选择一个，每个动作可打败另一个：
zh_tw: 你玩過「剪刀、石頭、布」這個遊戲嗎？這是一個兩人遊戲，你可以在三個動作之中選擇一個，每個動作可以贏過另一個動作：

source: Rock ✊ beats Scissors ✌️
de: Schere ✌️ schlägt Papier ✋
es: La Piedra ✊ gana a las Tijeras ✌️
es_419: Piedra ✊ vence a tijeras ✌️
fr: La pierre ✊ bat les ciseaux ✌️
it: Sasso ✊ batte Forbici ✌️
ja: グー✊はチョキ✌️に勝つ
ko: 바위 ✊는 가위 ✌️에 승
nl: Steen ✊ verslaat schaar ✌️
no: Stein ✊ slår saks ✌️
pt: Pedra ✊ ganha da Tesoura ✌️
sv: Sten ✊ slår sax ✌️
th: ค้อน ✊ ชนะกรรไกร ✌️
tr: Taş ✊ makası ✌️ yener
vi: Búa ✊ thắng Kéo ✌️
zh_cn: 石头 ✊ 打败剪刀 ✌️
zh_tw: 石頭 ✊ 贏了剪刀 ✌️

source: Paper ✋ beats Rock ✊
de: Stein ✊ schlägt Schere ✌️
es: El Papel ✋ gana a la Piedra ✊
es_419: Papel ✋ vence a piedra ✊
fr: Le papier ✋ bat la pierre ✊
it: Carta ✋ batte Sasso ✊
ja: パー✋はグー✊に勝つ
ko: 보 ✋는 바위 ✊에 승
nl: Papier ✋ verslaat steen ✊
no: Papir ✋ slår stein ✊
pt: Papel ✋ ganha da Pedra ✊
sv: Påse ✋ slår sten ✊
th: กระดาษ ✋ ชนะค้อน ✊
tr: Kâğıt ✋ taşı ✊ yener
vi: Bao ✋ thắng Búa ✊
zh_cn: 布 ✋ 打败石头 ✊
zh_tw: 布 ✋ 贏了石頭 ✊

source: Scissors ✌️ beats Paper ✋
de: Papier ✋ schlägt Stein ✊
es: Las Tijeras ✌️ ganan al Papel ✋
es_419: Tijeras ✌️ vence a papel ✋
fr: Les ciseaux ✌️ battent le papier ✋
it: Forbici ✌️ batte Carta ✋
ja: チョキ✌️はパー✋に勝つ
ko: 가위 ✌️는 보 ✋에 승
nl: Schaar ✌️ verslaat papier ✋
no: Saks ✌️ slår papir ✋
pt: Tesoura ✌️ ganha do Papel ✋
sv: Sax ✌️ slår påse ✋
th: กรรไกร ✌️ ชนะกระดาษ ✋
tr: Makas ✌️ kâğıdı ✋ yener
vi: Kéo ✌️ thắng Bao ✋
zh_cn: 剪刀 ✌️ 打败布 ✋
zh_tw: 剪刀 ✌️ 贏了布 ✋

source: The rules are easy enough that you can teach a computer to play. But how much work does it take to teach your iPad or Mac to recognize your hand poses, such as ✊, ✋, or ✌️?
de: Die Regeln sind so einfach, dass du sie einem Computer beibringen kannst. Doch wie viel Aufwand ist es, deinem iPad oder Mac das Erkennen von Handgesten wie ✌️, ✊ oder ✋ beizubringen?
es: Las normas son lo bastante sencillas para que puedas enseñar a jugar a tu ordenador. ¿Pero cuánto trabajo necesitas para enseñar al iPad o al Mac a reconocer las posturas de las manos, como ✊, ✋ o ✌️?
es_419: Las reglas son tan simples que le puedes enseñar a una computadora a jugar. Aunque, ¿cuánto tiempo tomaría enseñarle al iPad o a la Mac a reconocer las posiciones de la mano, como ✊, ✋ o ✌️?
fr: Les règles sont suffisamment simples pour que tu puisses apprendre à un ordinateur comment jouer. Mais quel travail est nécessaire pour apprendre à ton iPad ou à ton Mac à reconnaître les positions de tes mains, comme ✊, ✋ ou ✌️ ?
it: Le regole sono talmente semplici che puoi insegnare a un computer a giocare. Ma quanto lavoro serve per insegnare ad iPad o al Mac a riconoscere le pose della tua mano, come ✊, ✋ o ✌️?
ja: 簡単なルールなので、コンピュータに遊び方を教えることができます。でも、✊、✋、✌️の手の形を認識できるようにiPadやMacに教えるのは、どれくらい大変でしょうか?
ko: 규칙은 컴퓨터가 플레이하도록 가르칠 수 있을 정도로 매우 쉽습니다. 하지만 ✊, ✋ 또는 ✌️와 같은 손 포즈를 iPad 또는 Mac이 인식하도록 가르치는 데는 얼마나 많은 작업이 필요할까요?
nl: De regels zijn eenvoudig en je kunt een computer gemakkelijk leren hoe de game moet worden gespeeld. Maar hoeveel werk is het om je iPad of Mac je handgebaren, zoals ✊, ✋ of ✌️, te leren herkennen?
no: Reglene er så enkle at du kan lære en datamaskin spillet. Men hvor mye jobb kreves det for å lære en iPad eller Mac å gjenkjenne tegn som ✊, ✌️ eller ✋?
pt: As regras são fáceis o suficiente para que você ensine um computador a jogar. Mas quanto trabalho dá ensinar o iPad ou Mac a reconhecer os sinais com a mão, como ✊, ✋ ou ✌️?
sv: Reglerna är så pass enkla att du kan lära en dator att spela det. Men hur mycket jobb krävs det för att lära en iPad eller Mac att känna igen handgester som ✊, ✋ eller ✌️?
th: กฎนั้นง่ายพอที่คุณจะสอนคอมพิวเตอร์ให้เล่นได้ แต่จะต้องทำงานมากเพียงใดเพื่อสอน iPad หรือ Mac ของคุณให้รู้จำท่าทางมือ เช่น ✊, ✋ หรือ ✌️
tr: Kurallar, bir bilgisayara oynamayı öğretebilecek kadar kolaydır. Ancak iPad’ine veya Mac’ine ✊, ✋ veya ✌️ gibi el pozlarını tanımayı öğretmek ne kadar bir iş gerektirir?
vi: Các quy tắc đủ dễ để bạn có thể dạy máy tính cách chơi. Nhưng bạn cần làm những gì để dạy cho iPad hoặc máy Mac nhận ra tư thế bàn tay của mình, ví dụ như ✊, ✋ hoặc ✌️?
zh_cn: 规则十分简单，你可以教电脑玩。但需要多大的工作量，才能教会 iPad 或 Mac 识别你的手势（如 ✊、✋ 或 ✌️）呢？
zh_tw: 規則很簡單，你可以教電腦玩。但是教你的 iPad 或 Mac 辨識你的手勢（例如 ✊、✋ 或 ✌️）需要下多少功夫？

source: In this sample, you’ll take an existing Rock, Paper, Scissors game and upgrade it to an awesome machine learning powered game with the help of a camera and a [machine learning model](glossary://machine%20learning%20model). Time to get started!
de: In diesem Beispiel aktualisierst du ein vorhandenes „Schere, Stein, Papier"-Spiel und machst daraus mithilfe der Kamera und einem [Modell für maschinelles Lernen](glossary://machine%20learning%20model) ein fantastisches und selbstlernendes Spiel. Lass uns loslegen!
es: En este ejemplo, tomarás un juego de “Piedra, papel o tijera” existente y lo actualizarás a un impresionante juego basado en el aprendizaje automático con la ayuda de una cámara y de un [modelo de aprendizaje automático](glossary://machine%20learning%20model). ¡Vamos a ello!
es_419: En esta muestra, partirás de un juego existente de Piedra, papel o tijeras y lo mejorarás mediante aprendizaje automático y la ayuda de una cámara y un [modelo de aprendizaje automático](glossary://machine%20learning%20model). ¡Adelante!
fr: Dans cet échantillon, tu mettras à niveau un jeu Pierre, papier, ciseaux existant afin d’obtenir un formidable jeu utilisant l’apprentissage automatique à l’aide d’un appareil photo et d’un [modèle d’apprentissage automatique](glossary://machine%20learning%20model). Il est temps de t’y mettre !
it: In questo playground di esempio, partirai da un gioco Sasso, carta, forbici esistente e lo aggiornerai a un fantastico gioco basato sull’apprendimento automatico con l’aiuto della fotocamera e di un [modello di apprendimento automatico](glossary://machine%20learning%20model). Iniziamo!
ja: このサンプルでは、カメラと[機械学習モデル](glossary://machine%20learning%20model)を使って、おなじみのじゃんけんゲームを機械学習で動くすばらしいゲームにアップグレードします。それでは始めましょう!
ko: 이 샘플에서는 기존의 가위, 바위, 보 게임을 카메라와 [기계 학습 모델](glossary://machine%20learning%20model)의 도움을 받아 멋진 기계 학습 구동 게임으로 업그레이드합니다. 그럼 시작해 볼게요!
nl: In dit voorbeeld ga je een bestaande Steen, papier, schaar-game upgraden naar een fantastische machinelearninggame met behulp van een camera en een [model voor machinelearning](glossary://machine%20learning%20model). Tijd om aan de slag te gaan!
no: I dette eksempelet skal du ta utgangspunkt i spillet stein, saks papir og oppgradere det til et supert spill som drives av maskinlæring ved hjelp av et kamera og en [maskinlæringsmodell](glossary://machine%20learning%20model). Det er på tide å sette i gang!
pt: Nesta amostra, você usará o jogo Pedra, Papel e Tesoura, e o atualizará para criar um incrível jogo sustentado por aprendizado de máquina, com a ajuda de uma câmera e um [modelo de aprendizado de máquina](glossary://machine%20learning%20model). É hora de começar!
sv: I det här exemplet tar du en befintlig version av spelet Sten, sax, påse och uppgraderar det till ett suveränt spel som drivs av maskininlärning med hjälp av en kamera och en [maskininlärningsmodell](glossary://machine%20learning%20model). Det är dags att börja!
th: ในตัวอย่างนี้ คุณจะได้นำเกมเป่ายิ้งฉุบที่มีอยู่มาอัปเกรดให้เป็นสุดยอดเกมที่ทำงานด้วยการเรียนรู้ของเครื่อง ร่วมกับกล้องและ[โมเดลการเรียนรู้ของเครื่อง](glossary://machine%20learning%20model) ถึงเวลาเริ่มกันแล้ว!
tr: Bu örnekte var olan bir Taş, Kâğıt, Makas oyununu alacak ve onu bir kameranın ve bir [makine öğrenimi modelinin](glossary://machine%20learning%20model) yardımıyla, gücünü makine öğreniminden alan harika bir oyuna yükselteceksin. Başlama zamanı!
vi: Trong mẫu này, bạn sẽ sử dụng một trò chơi Kéo Búa Bao hiện có và nâng cấp lên thành một trò chơi được hỗ trợ công nghệ học máy tuyệt vời với sự trợ giúp của camera và một [mô hình học máy](glossary://machine%20learning%20model). Đã đến lúc bắt đầu!
zh_cn: 在这个示例中，你将在现有“石头剪刀布”游戏的基础上，借助摄像头和[机器学习模型](glossary://machine%20learning%20model)，将它升级成基于机器学习的好玩游戏。快开始吧！
zh_tw: 在此範例中，你將使用現有的「剪刀、石頭、布」遊戲，並藉助相機和[機器學習模型](glossary://machine%20learning%20model)將其升級為出色的機器學習動力遊戲。是時候開始進行了！

source: Start Walkthrough
de: Schritt-für-Schritt-Anleitung starten
es: Iniciar el tutorial
es_419: Iniciar tutorial
fr: Commencer les explications
it: Avvia la guida passo passo
ja: ガイドを開始
ko: 가이드 시작하기
no: Start gjennomgangen
pt: Iniciar Passo a Passo
sv: Starta genomgången
th: เริ่มการสาธิต
tr: Kılavuzu Başlat
vi: Bắt đầu hướng dẫn
zh_cn: 开始演示
zh_tw: 開始演練

source: AX description for button
de: Bedienungshilfen-Beschreibung für Taste
es: Descripción de accesibilidad del botón
es_419: Descripción de accesibilidad del botón
fr: Description d’accessibilité pour le bouton
it: Descrizione di accessibilità per il pulsante
ja: ボタンのアクセシビリティの説明
ko: 버튼에 대한 손쉬운 사용 설명
nl: Toegankelijkheidsbeschrijving voor knop
no: Tilgjengelighetsbeskrivelse for knapp
pt: Descrição de acessibilidade do botão
sv: Hjälpmedelsbeskrivning för knapp
th: คำอธิบาย AX สำหรับปุ่ม
tr: Düğme için erişilebilirlik açıklaması
vi: Mô tả AX cho nút
zh_cn: 按钮辅助功能描述
zh_tw: 按鈕的 AX 描述

# GuideBook..Guide0..StepGet Started with Machine Learning..TaskGroup0..title
source: Completing the game logic
de: Spiellogik vervollständigen
es: Completar la lógica del juego
es_419: Completar la lógica del juego
fr: Finalisation de la logique du jeu
it: Completare la logica del gioco
ja: ゲームロジックを完成させる
ko: 게임 로직 완성하기
nl: De gamelogica voltooien
no: Fullføre spillogikken
pt: Completando a lógica do jogo
sv: Slutföra spellogiken
th: การทำให้ตรรกะของเกมสมบูรณ์
tr: Oyun mantığını tamamlama
vi: Hoàn thành logic trò chơi
zh_cn: 补全游戏逻辑
zh_tw: 完成遊戲邏輯

source: Add in the remaining game logic 🕹
de: Verbleibende Spiellogik hinzufügen 🕹
es: Añadir al juego la lógica que falta 🕹
es_419: Agregar la lógica restante del juego 🕹
fr: Ajouter le reste de la logique du jeu 🕹
it: Aggiungere il resto della logica del gioco 🕹
ja: 残りのゲームロジック🕹を追加する
ko: 남은 게임 로직 추가하기 🕹
nl: De resterende gamelogica toevoegen 🕹
no: Legg til resten av spillogikken 🕹
pt: Adicione a lógica de jogo remanescente 🕹
sv: Lägg till den återstående spellogiken 🕹
th: เพิ่มตรรกะเกมที่เหลือ 🕹
tr: Oyun mantığının geri kalanını ekleme 🕹
vi: Thêm logic trò chơi còn lại🕹
zh_cn: 补全游戏逻辑 🕹
zh_tw: 加入剩下的遊戲邏輯 🕹

source: Learn how to create a Rock, Paper, Scissors game in Swift.
de: Lerne, wie du ein „Schere, Stein, Papier“-Spiel in Swift erstellst.
es: Aprende a crear un juego de “Piedra, papel o tijera” en Swift.
es_419: Aprende a crear un juego de Piedra, papel o tijeras en Swift.
fr: Découvre comment créer un jeu Pierre, papier, ciseaux dans Swift.
it: Scopri come creare un gioco Sasso, carta, forbici in Swift.
ja: Swiftでじゃんけんゲームを作成する方法を学びましょう。
ko: Swift에서 가위, 바위, 보 게임을 만드는 방법을 배워보세요.
nl: Leer hoe je een Steen, papier, schaar-game maakt in Swift.
no: Lær hvordan du lager et stein, saks, papir-spill i Swift.
pt: Aprenda a criar um jogo de Pedra, Papel e Tesoura em Swift.
sv: Lär dig hur du skapar ett Sten, sax, påse-spel i Swift.
th: เรียนรู้วิธีสร้างเกมเป่ายิ้งฉุบใน Swift
tr: Swift’te Taş, Kâğıt, Makas oyunu yaratmayı öğren.
vi: Tìm hiểu cách tạo ra một trò chơi Kéo Búa Bao trong Swift.
zh_cn: 了解如何在 Swift 中创建“石头剪刀布”游戏。
zh_tw: 學習如何在 Swift 中製作「剪刀、石頭、布」遊戲。

source: In your preview, you can see a basic game of Rock, Paper, Scissors. In this version of the game, you can select your move by using the left and right arrow buttons.
de: In der Vorschau siehst du ein normales „Schere, Stein, Papier“-Spiel. In dieser Version des Spiels kannst du mit den Links- und Rechtspfeiltasten deinen Spielzug auswählen.
es: En la previsualización puedes ver una versión básica del juego “Piedra, papel o tijera”. En esta versión del juego, puedes seleccionar tu jugada usando los botones de flecha hacia la izquierda y hacia la derecha.
es_419: En tu vista previa, encontrarás un juego básico de Piedra, papel o tijeras. En esta versión del juego, puedes seleccionar tu movimiento usando los botones de flecha izquierda o derecha.
fr: Dans ton aperçu, tu peux voir un jeu Pierre, papier, ciseaux basique. Dans cette version du jeu, tu peux sélectionner ton coup à l’aide des boutons fléchés vers la gauche ou la droite.
it: Nell’anteprima, puoi vedere un semplice gioco Sasso, carta, forbici. In questa versione, puoi selezionare la tua mossa utilizzando i pulsanti con le frecce a sinistra e a destra.
ja: プレビューには、基本的なじゃんけんゲームが表示されています。ゲームのこのバージョンでは、左右の矢印ボタンを使って手を選択できます。
ko: 미리보기에서는 기본 버전의 가위, 바위, 보 게임을 볼 수 있습니다. 이 버전의 게임에서는 왼쪽 및 오른쪽 화살표 버튼을 사용하여 동작을 선택할 수 있습니다.
nl: In de voorvertoning kun je een eenvoudige Steen, papier, schaar-game zien. In deze versie van de game kun je een zet selecteren met de pijl naar links en naar rechts.
no: I forhåndsvisningen ser du en enkel variant av spillet stein, saks, papir. I denne versjonen av spillet kan du velge trekket ditt ved å bruke knappene med pil til høyre og venstre.
pt: Na pré‑visualização, você pode ver um jogo básico de Pedra, Papel e Tesoura. Nessa versão do jogo, você pode usar os botões de seta esquerda e direita para selecionar o movimento.
sv: I den här förhandsvisningen ser du ett enkelt Sten, sax, påse-spel. I den här versionen av spelet kan du välja ditt drag genom att använda höger- och vänsterpilsknapparna.
th: ในการแสดงตัวอย่าง คุณจะเห็นเกมเป่ายิ้งฉุบพื้นฐาน ในเกมเวอร์ชั่นนี้ คุณสามารถเลือกท่าของคุณได้โดยใช้ปุ่มลูกศรซ้ายและขวา
tr: Önizlemende temel Taş, Kâğıt, Makas oyununu görebilirsin. Oyunun bu sürümünde sol ve sağ ok düğmelerini kullanarak hareketini seçebilirsin.
vi: Trong bản xem trước, bạn có thể nhìn thấy một trò chơi Kéo Búa Bao cơ bản. Trong phiên bản trò chơi này, bạn có thể chọn nước đi của bạn bằng cách sử dụng các nút mũi tên trái và phải.
zh_cn: 在预览中，你可以看到基础的“石头剪刀布”游戏。在这个版本的游戏中，你可以使用左箭头和右箭头按钮来选择动作。
zh_tw: 在你的預覽中，你可以看到「剪刀、石頭、布」的基本遊戲。在此版本的遊戲中，你可以使用左右箭頭按鈕來選擇動作。

source: Tap Play for your iPad or Mac to generate a move. Take a second and try out the game.
de: Tippe auf „Spielen“ für dein iPad oder deinen Mac, um einen Spielzug zu erstellen. Nimm dir einen Moment Zeit und probiere das Spiel aus.
es: Toca Play para que el iPad o el Mac genere una jugada. Date un momento para probar el juego.
es_419: Toca Play (jugar) para que tu iPad o Mac genere un movimiento. Tómate un momento para probar el juego.
fr: Touche Play pour que ton iPad ou ton Mac génère un coup. Prend un moment pour essayer le jeu.
it: Tocca o fai clic su Play (gioca) su iPad o sul Mac per generare una mossa. Prenditi un minuto per provare il gioco.
ja: iPadまたはMacで“プレイ”をタップすると手が生成されます。少し時間を取ってゲームをやってみましょう。
ko: iPad 또는 Mac의 재생을 탭하여 동작을 생성합니다. 잠시 시간을 내서 게임을 해보세요.
nl: Tik op 'Play' om je iPad of Mac een zet te laten doen. Neem even de tijd om de game uit te proberen.
no: Trykk på Play for å få iPaden eller Macen til å velge et trekk. Bruk litt tid til å prøve spillet.
pt: Toque em Jogar no iPad ou Mac para gerar um movimento. Experimente o jogo com calma.
sv: Tryck på Spela så att din iPad eller Mac skapar ett drag. Ägna en liten stund åt att testa spelet.
th: แตะเล่นสำหรับ iPad หรือ Mac ของคุณเพื่อสร้างท่า ใช้เวลาสักครู่และลองเล่นเกม
tr: Bir hareket yapmak için iPad’in veya Mac’in için Oyna’ya dokun. Birkaç saniyeni ayır ve oyunu dene.
vi: Chạm vào Chơi cho iPad hoặc máy Mac của bạn để tạo ra một nước đi. Hãy dành giây lát và thử chơi trò chơi.
zh_cn: 轻点 iPad 或 Mac 上的“开始”来生成一个动作。花点时间试玩游戏。
zh_tw: 點一下「啟動」來讓你的 iPad 或 Mac 產生動作。花點時間嘗試玩一下遊戲。

source: Do you notice anything wrong with the game?
de: Fällt dir irgendetwas auf? Stimmt etwas nicht mit dem Spiel?
es: ¿Notas algo que no vaya bien en el juego?
es_419: ¿Notaste algún problema con el juego?
fr: As-tu remarqué un problème avec le jeu ?
it: Noti niente di sbagliato nel gioco?
ja: ゲームに何かおかしなところがあるでしょうか?
ko: 게임에 무슨 문제라도 있나요?
nl: Kun je een fout ontdekken in de game?
no: Merker du noe galt med spillet?
pt: Você reparou em algo errado no jogo?
sv: Märkte du något fel med spelet?
th: คุณสังเกตเห็นสิ่งผิดปกติเกี่ยวกับเกมไหม
tr: Oyunla ilgili bir sorun fark ettin mi?
vi: Bạn có nhận thấy bất kỳ điều gì không đúng với trò chơi không?
zh_cn: 你注意到了游戏哪里有问题吗？
zh_tw: 你注意到遊戲有什麼問題嗎？

source: You may have noticed that the game rules are a little broken! Don’t worry, you’ll fix this soon enough.
de: Dir ist wahrscheinlich aufgefallen, dass da irgendetwas mit den Spielregeln nicht stimmt! Keine Sorge, du behebst das Problem bald.
es: Quizás te hayas dado cuenta de que las reglas no se respetan mucho. No te preocupes, lo arreglarás pronto.
es_419: Es posible que hayas notado que las reglas del juego no funcionan del todo. No te preocupes, pronto lo arreglaremos.
fr: Tu peux remarquer que les règles du jeu sont un peu erronées ! Ne t’inquiète pas, tu corrigeras cela assez vite.
it: Forse avrai notato che le regole del gioco non stanno funzionando troppo bene! Non preoccuparti, tra poco le aggiusterai.
ja: ゲームのルールが少しおかしいことに気付いたかもしれません! 大丈夫、すぐに修正します。
ko: 게임 규칙에 조금 어긋나는 부분을 알아챘나요? 걱정 마세요. 곧 고칠 테니까요.
nl: Het is je misschien opgevallen dat de regels van de game niet goed werken! Maak je geen zorgen, dit ga je zo meteen oplossen.
no: Du har kanskje lagt merke til at reglene ikke stemmer helt. Ta det med ro, det skal du ordne snart.
pt: Talvez você tenha reparado que as regras do jogo estão um pouco erradas! Não se preocupe, você corrigirá isso em breve.
sv: Du kanske har märkt att spelreglerna verkar lite svajiga? Oroa dig inte, du kommer snart att fixa det.
th: คุณอาจสังเกตว่ากฎของเกมมีปัญหานิดหน่อย! ไม่ต้องกังวล คุณจะได้แก้ไขปัญหานี้เร็วๆ นี้
tr: Oyun kurallarının biraz bozulduğunu fark etmişsindir! Endişelenme, bunu birazdan düzelteceksin.
vi: Bạn có thể đã nhận ra rằng các quy tắc trò chơi đã bị phá vỡ một chút! Đừng lo, bạn sẽ sớm khắc phục việc này.
zh_cn: 你可能注意到了游戏规则有点问题！别担心，很快你就会修复这个问题。
zh_tw: 你可能已經注意到遊戲規則有點不對勁！別擔心，你很快就會解決這個問題。
