Repository: JulioPr0/ml-rock-paper-scissors
Catalog: Rock, Paper, Scissors game with ML.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: de, es, es_419, fr, it, ja, ko, nl, no, pt, sv, th, tr, vi, zh_cn, zh_tw

source: Do you see nodes on other, non-hand objects? Why do you think this is?
de: Siehst du Knoten auf anderen Objekten als deiner Hand? Hast du eine Idee, warum das so ist?
es: ¿Ves los nodos que hay en los otros objetos que no son manos? ¿Por qué crees que pasa esto?
es_419: ¿Ves nodos en otros objetos que no son manos? ¿Por qué crees que pasa esto?
fr: Vois-tu des nœuds sur d’autres objets qui ne sont pas des mains ? À ton avis, pourquoi ?
it: Vedi dei nodi su altri oggetti che non sono mani? Secondo te, perché accade?
ja: 手以外の物体にもノードが表示されますか? なぜそうなるのでしょうか?
ko: 손이 아닌 다른 대상체에 노드가 보이나요? 왜 그럴까요?
nl: Zie je nodes op andere objecten dan handen? Waarom denk je dat dit is?
no: Ser du noder på andre ting som ikke er hånden din? Hvorfor tror du at det er slik?
pt: Você vê algum nó em outros lugares além da mão? Por que isso acontece?
sv: Ser du noder på andra saker som inte är en hand? Varför tror du att det blir så?
th: คุณเห็นโหนดบนวัตถุอื่นที่ไม่ใช่มือหรือไม่ คุณคิดว่าเป็นเพราะอะไร
tr: El olmayan diğer nesnelerde düğümler görüyor musun? Sence bunlar ne?
vi: Bạn có nhìn thấy các node trên các đối tượng khác không phải là bàn tay không? Tại sao bạn lại nghĩ như vậy?
zh_cn: 节点有出现在手除外的其他物体上吗？你觉得这是为什么呢？
zh_tw: 你看到了其他非手部物件上的節點嗎？你為什麼認為這是？

source: Try placing two hands in the same frame. Where do the nodes get placed?
de: Versuche, zwei Hände in den gleichen Rahmen zu halten. Wo werden die Knoten platziert?
es: Prueba a poner dos manos en el mismo marco. ¿Dónde quedan colocados los nodos?
es_419: Intenta colocar dos manos al mismo tiempo. ¿Dónde se colocan los nodos?
fr: Essaie de placer tes deux mains dans la même image. Où les nœuds sont-ils placés ?
it: Prova a posizionare due mani nella stessa inquadratura. Dove vengono posizionati i nodi?
ja: 同じフレーム内に両手を出してみましょう。ノードはどこに配置されるでしょうか?
ko: 같은 프레임에 양 손을 놓아 보세요. 어디에 노드가 배치되나요?
nl: Plaats twee handen in hetzelfde beeld. Waar worden de nodes geplaatst?
no: Prøv å plassere to hender i samme bilde. Hvor blir nodene plassert?
pt: Tente colocar duas mãos no mesmo quadro. Onde os nós são posicionados?
sv: Prova att placera två händer i samma bildruta. Var placeras noderna?
th: ลองวางมือสองข้างในเฟรมเดียวกัน โหนดวางตำแหน่งไว้ที่ใด
tr: İki elini de aynı kareye koymayı dene. Düğümler nereye yerleştiriliyor?
vi: Thử đặt hai bàn tay trong cùng một khung hình. Các node được đặt ở đâu?
zh_cn: 试着两只手都放在同一个取景框中。节点分布在了什么位置？
zh_tw: 嘗試將兩隻手放在同一個框架中。節點放在哪裡？

source: As you move your hand around, what do you notice about the location of the nodes?
de: Fällt dir bezüglich der Knotenposition etwas auf, wenn du die Hand bewegst?
es: Cuando mueves la mano, ¿notas algo sobre la ubicación de los nodos?
es_419: ¿Notas algo sobre la ubicación de los nodos conforme mueves la mano?
fr: Lorsque tu bouges la main, que remarques-tu à propos de la position des nœuds ?
it: Mentre sposti la mano, cosa noti riguardo alla posizione dei nodi?
ja: 手の位置を動かすと、ノードの位置はどうなりますか?
ko: 손을 이리저리 움직이면 노드의 위치에 대해 무엇을 알 수 있나요?
nl: Wat gebeurt er met de locatie van de nodes als je je hand beweegt?
no: Hva skjer med nodenes plassering når du beveger hånden?
pt: Conforme você move a mão, o que você nota sobre a localização dos nós?
sv: Vad märker du gällande placeringen av noderna när du rör på handen?
th: เมื่อคุณเคลื่อนมือไปรอบๆ คุณสังเกตอะไรเกี่ยวกับตำแหน่งของโหนดบ้าง
tr: Elini hareket ettirirken bu düğümlerin konumları ile ilgili bir şey fark ettin mi?
vi: Khi di chuyển bàn tay của mình, bạn nhận thấy điều gì về vị trí của các node?
zh_cn: 移动手时，你注意到节点的位置发生了什么变化吗？
zh_tw: 當你移動你的手時，你注意到節點的位置是什麼？

source: You are seeing a live visualization of data that your ML model uses to predict which pose is shown.
de: Du siehst gerade eine Live-Visualisierung der Daten, die dein ML-Modell verwendet, um die gezeigte Geste vorherzusagen.
es: Estás viendo una visualización en vivo de los datos que usa tu modelo de ML para detectar qué postura se está mostrando.
es_419: Estas viendo una visualización en vivo de los datos que tu modelo de ML usa para reconocer la pose que se muestra.
fr: Tu vois une visualisation en direct des données que ton modèle d’apprentissage automatique utilise pour prédire quelle position lui est présentée.
it: Stai vedendo una visualizzazione in tempo reale dei dati che il modello di apprendimento automatico utilizza per prevedere quale mossa viene mostrata.
ja: 今見えているのは、どの形が映っているかを機械学習モデルが予測するのに使用するデータをライブで視覚化したものです。
ko: ML 모델이 어떤 포즈가 표시되는지 예측하는 데 사용하는 실시간 데이터 시각화를 현재 보고 있습니다.
nl: Je ziet een live visualisatie van gegevens die je ML-model gebruikt om te voorspellen welk gebaar wordt getoond.
no: Du ser en visualisering i sanntid av dataene som maskinlæringsmodellen bruker til å forutse hvilket tegn du kommer til å vise.
pt: Você está vendo uma visualização ao vivo dos dados que o modelo de AM usa para prever qual sinal é mostrado.
sv: Du ser en direktvisualisering av de data som maskininlärningsmodellen använder till att förutsäga vilken gest som visas.
th: คุณกำลังดูการแสดงภาพสดของข้อมูลที่โมเดล ML ของคุณใช้เพื่อคาดคะเนว่าท่าทางใดแสดงอยู่
tr: Makine öğrenimi modelinin hangi pozun gösterildiğini tahmin etmek için kullandığı verilerin canlı bir görselleştirmesini görüyorsun.
vi: Bạn đang nhìn thấy một hình ảnh trực quan trực tiếp của dữ liệu mà mô hình ML sử dụng để dự đoán tư thế nào được hiển thị.
zh_cn: 你将看到数据的实时可视化，机器学习模型使用这些数据来预测展示了哪个手势。
zh_tw: 你現在看到的即時視覺化，呈現了你的 ML 模型使用資料來預測顯示哪一個手勢。

source: Imagine if your hand was partially covered in the image. What do you think would happen to the accuracy of your predictions for that hand pose? The next task uses `DebugModeView` to evaluate and debug your ML model.
de: Stell dir vor, dass deine Hand im Bild teilweise verdeckt wäre. Was denkst du, würde mit der Genauigkeit der Vorhersagen für diese Handgeste passieren? Die nächste Aufgabe verwendet `DebugModeView` (Debuggingmodus-Ansicht), um das ML-Modell zu evaluieren und zu debuggen.
es: Imagínate que tu mano queda parcialmente tapada en la imagen. ¿Qué crees que pasaría con la precisión de las predicciones para esa postura de mano? La tarea siguiente usa `DebugModeView` para evaluar el modelo de ML y depurarlo.
es_419: Imagina que tu mano está parcialmente cubierta en la imagen. ¿Qué crees que pasaría con la precisión de las predicciones para la pose? La siguiente tarea usa `DebugModeView` (visualización de modo de depuración) para evaluar y depurar tu modelo de ML.
fr: Imagine que ta main soit partiellement couverte dans l’image. À ton avis, qu’arriverait-il à la précision de tes prédictions pour cette position de la main ? La tâche suivante utilise `DebugModeView` pour évaluer et déboguer ton modèle d’apprentissage automatique.
it: Immagina se la mano fosse parzialmente coperta nell’immagine. Cosa pensi che accadrebbe all’accuratezza delle previsioni per quella posa? L’attività successiva usa `DebugModeView` per valutare il modello di apprendimento automatico ed eseguirne il debug.
ja: イメージに写った手の一部が隠れているとします。その手の形を予測するときの精度はどうなるでしょうか? 次のタスクでは、`DebugModeView`を使って機械学習モデルを評価およびデバッグします。
ko: 이미지에서 손 일부가 가려져 있다고 상상해 보세요. 손 포즈에 대한 예측의 정확도에 어떤 변화가 있을까요? 다음 작업에서는 `DebugModeView`를 사용하여 평가하고 디버깅 해 볼게요.
nl: Stel je voor dat je hand in de afbeelding gedeeltelijk is bedekt. Welk effect zou dit volgens jou hebben op de juistheid van de voorspellingen voor dat gebaar? In de volgende taak wordt `DebugModeView` gebruikt om je ML-model te evalueren en op fouten te controleren.
no: Se for deg at hånden din er delvis tildekket i bildet. Hva tror du skjer med treffsikkerheten for prediksjonene for det håndtegnet? Den neste oppgaven bruker `DebugModeView` til å evaluere og feilsøke maskinlæringsmodellen.
pt: Imagine se a sua mão estivesse parcialmente coberta na imagem. O que você acha que aconteceria com a precisão da previsão desse sinal com a mão? A próxima tarefa usa `DebugModeView` para avaliar e depurar o modelo de AM.
sv: Föreställ dig att din hand är delvis täckt i bilden. Vad tror du skulle hända med träffsäkerheten för förutsägelserna av den handgesten? Nästa uppgift använder `DebugModeView` till att utvärdera och felsöka maskininlärningsmodellen.
th: ลองจินตนาการว่ามือของคุณถูกปกปิดไว้บางส่วนในภาพ คุณคิดว่าจะเกิดอะไรขึ้นกับความแม่นยำของการคาดคะเนสำหรับท่าทางมือดังกล่าว งานถัดไปจะใช้ `DebugModeView` เพื่อประเมินและแก้บั๊กโมเดล ML ของคุณ
tr: Görüntüde elinin kısmen örtülü olduğunu varsay. Bu el pozuna yönelik tahminlerinin doğruluğu sence ne olur? Bir sonraki görev, makine öğrenimi modelini değerlendirmek ve modeldeki hataları ayıklamak için `DebugModeView`’u kullanır.
vi: Hãy tưởng tượng nếu bàn tay của bạn bị che một phần trong hình ảnh. Bạn nghĩ điều gì sẽ xảy ra đối với độ chính xác của các dự đoán cho tư thế bàn tay đó? Tác vụ tiếp theo sử dụng `DebugModeView` để đánh giá và gỡ lỗi mô hình ML của bạn.
zh_cn: 设想一下图像中你的手被部分遮挡的情况。你觉得会对这个手势的预测准确性产生什么影响？下一个任务会使用 `DebugModeView`（调试模式视图）来评估和调试你的机器学习模型。
zh_tw: 想像一下，如果你的手被部分覆蓋在影像中。你認為你對這個手勢的預測準確性會發生什麼變化？下一個任務使用會 `DebugModeView` 來評估和除錯 ML 模型。

source: Test your model
de: Dein Modell testen
es: Probar el modelo
es_419: Probar el modelo
fr: Tester ton modèle
it: Testare il modello
ja: モデルを検証する
ko: 모델 테스트하기
nl: Het model testen
no: Prøv modellen din
pt: Teste o modelo
sv: Testa modellen
th: ทดสอบโมเดลของคุณ
tr: Modelini test etme
vi: Kiểm tra mô hình của bạn
zh_cn: 测试你的模型
zh_tw: 測試你的模型

source: Is your machine learning model accurately identifying the different hand poses?
de: Werden die verschiedenen Handgesten von deinem Modell für maschinelles Lernen korrekt identifiziert?
es: ¿Está identificando con precisión las diferentes posturas de las manos tu modelo de aprendizaje automático?
es_419: ¿Tu modelo de aprendizaje automático está identificando de forma precisa las distintas poses de mano?
fr: Ton modèle d’apprentissage automatique identifie-t-il avec précision les différentes positions de la main ?
it: Il modello di apprendimento automatico sta identificando in modo accurato le diverse pose delle mani?
ja: 機械学習モデルはさまざまな手の形を正確に識別していますか?
ko: 기계 학습 모델이 다른 손 포즈를 정확하게 식별하고 있습니까?
nl: Worden de verschillende handgebaren goed door je ML-model herkend?
no: Er maskinlæringsmodellen treffsikker når den identifiserer forskjellige håndtegn?
pt: O modelo de aprendizado de máquina identifica com precisão os diferentes sinais com a mão?
sv: Är din maskininlärningsmodell träffsäker när den identifierar olika handgester?
th: โมเดลการเรียนรู้ของเครื่องของคุณระบุท่าทางมือที่แตกต่างกันได้อย่างแม่นยำหรือไม่
tr: Makine öğrenimi modelin farklı el pozlarını doğru bir şekilde belirliyor mu?
vi: Mô hình học máy của bạn có nhận dạng chính xác các tư thế bàn tay khác nhau không?
zh_cn: 你的机器学习模型能准确识别不同的手势吗？
zh_tw: 你的機器學習模型是否能準確辨識不同的手部姿勢？

source: You can use `DebugModeView` to evaluate and debug your ML model.
de: Du kannst `DebugModeView` zum Evaluieren und Debuggen des ML-Modells verwenden.
es: Puedes usar `DebugModeView` para evaluar y depurar el modelo de aprendizaje automático.
es_419: Puedes usar `DebugModeView` para evaluar y depurar tu modelo de ML.
fr: Tu peux utiliser `DebugModeView` pour évaluer et déboguer ton modèle d’apprentissage automatique.
it: Puoi utilizzare `DebugModeView` per valutare il modello di apprendimento automatico ed eseguirne il debug.
ja: `DebugModeView`を使って機械学習モデルの評価とデバッグを行うことができます。
ko: `DebugModeView`를 사용하여 ML 모델을 평가하고 디버깅할 수 있습니다.
nl: Je kunt `DebugModeView` gebruiken om je ML-model te evalueren en op fouten te controleren.
no: Du kan bruke `DebugModeView` til å evaluere og feilsøke maskinlæringsmodellen.
pt: Você pode usar `DebugModeView` para avaliar e depurar o modelo de AM.
sv: Du kan använda `DebugModeView` till att utvärdera och felsöka din maskininlärningsmodell.
th: คุณสามารถใช้ `DebugModeView` เพื่อประเมินและแก้บั๊กโมเดล ML ของคุณได้
tr: Makine öğrenimi modelini değerlendirmek ve modelindeki hataları ayıklamak için`DebugModeView`’u kullanabilirsin.
vi: Bạn có thể sử dụng `DebugModeView` để đánh giá và gỡ lỗi mô hình ML của mình.
zh_cn: 你可以使用 `DebugModeView` 来评估和调试你的机器学习模型。
zh_tw: 你可以使用 `DebugModeView` 來評估並且為你的 ML 模型除錯。

source: In this view, you’ll have a camera view and a bar [chart](doc://com.apple.documentation/documentation/charts) that visualizes in real time how confident your ML model is in its [prediction](glossary://prediction).
de: In dieser Ansicht hast du eine Kameraansicht und ein Balken[diagramm](doc://com.apple.documentation/documentation/charts), das in Echtzeit visualisiert, mit welcher Konfidenz das ML-Modell seine [Vorhersage](glossary://prediction) aufstellt.
es: En esta vista, tendrás una visión de la cámara y una barra [gráfica](doc://com.apple.documentation/documentation/charts) que indica en tiempo real el grado de confianza que tienen las [predicciones](glossary://prediction) del modelo de aprendizaje automático.
es_419: En esta visualización, contarás con un visor de cámara y una [gráfica](doc://com.apple.documentation/documentation/charts) de barras que visualiza en tiempo real el grado de confianza que tienen las [predicciones](glossary://prediction) del modelo de ML.
fr: Dans cette vue, tu auras une vue d’appareil photo et un [graphique](doc://com.apple.documentation/documentation/charts) à barres qui visualise en temps réel le degré de confiance de ton modèle d’apprentissage automatique dans sa [prédiction](glossary://prediction).
it: In questa vista, avrai una vista fotocamera e un [grafico](doc://com.apple.documentation/documentation/charts) a barre che mostra in tempo reale l’accuratezza del modello di apprendimento automatico nelle sue [previsioni](glossary://prediction).
ja: このビューには、カメラビューと、機械学習モデルの[予測](glossary://prediction)の信頼度がリアルタイムで視覚化される棒[グラフ](doc://com.apple.documentation/documentation/charts)があります。
ko: 이 보기에서는 카메라 뷰와 ML 모델이 [예측](glossary://prediction)에 대해 얼마나 확신하는지 실시간으로 시각화하는 막대 [차트](doc://com.apple.documentation/documentation/charts)가 표시됩니다.
nl: Deze weergave bevat een cameraweergave en een staaf[diagram](doc://com.apple.documentation/documentation/charts) die in realtime de betrouwbaarheid van de [voorspelling](glossary://prediction) van je ML-model visualiseert.
no: I denne visningen har du en kameravisning og et stolpe[diagram](doc://com.apple.documentation/documentation/charts) som visualiserer i sanntid hvor pålitelige [prediksjoner](glossary://prediction) maskinlæringsmodellen kommer med.
pt: Nesta visualização, você tem uma visualização da câmera e um [chart](doc://com.apple.documentation/documentation/charts) de barras que visualiza em tempo real a confiança que o modelo de AM tem em sua própria [previsão](glossary://prediction).
sv: I den här vyn har du en kamera och ett stapel[diagram](doc://com.apple.documentation/documentation/charts) som i realtid visualiserar hur konfident maskininlärningsmodellen är i sina [förutsägelser](glossary://prediction).
th: ในมุมมองนี้ คุณจะมีมุมมองกล้องและ[แผนภูมิ](doc://com.apple.documentation/documentation/charts)แท่งที่แสดงภาพแบบเรียลไทม์ว่าโมเดล ML ของคุณมั่นใจใน[การคาดคะเน](glossary://prediction)ของตัวเองเพียงใด
tr: Bu görüntüde, bir kamera görüntüsü ile birlikte makine öğrenimi modelinin [tahminlerinde](glossary://prediction) ne kadar güvenilir olduğunu gerçek zamanlı olarak görselleştiren bir çubuk [grafik](doc://com.apple.documentation/documentation/charts) olacak.
vi: Trong chế độ xem này, bạn sẽ có một chế độ xem camera và một [biểu đồ](doc://com.apple.documentation/documentation/charts) thanh giúp trực quan hóa độ tin cậy của mô hình ML của bạn trong [dự đoán](glossary://prediction) trong thời gian thực.
zh_cn: 这个视图中将有一个摄像头视图和一个条形[图表](doc://com.apple.documentation/documentation/charts)，它可实时可视化你的机器学习模型在[预测](glossary://prediction)中的置信度。
zh_tw: 在此顯示區中，你會有一個相機顯示區和一個長條[圖](doc://com.apple.documentation/documentation/charts)，可以即時地視覺化你的 ML 模型對其[預測](glossary://prediction)的信心。

source: In the preview, hold up a couple different hand poses to the camera and notice how the prediction changes. Which pose is it most confident in?
de: Halte in der Vorschau ein paar andere Handgesten in die Kamera und sieh dir an, wie sich die Vorhersage ändert. Bei welcher Geste siehst du die höchste Konfidenz?
es: En la vista previa, mantén ante la cámara un par de posturas de las manos y observa cómo cambia la predicción. ¿Con qué postura obtienes mayor precisión?
es_419: En la vista previa, realiza distintas poses de mano en la cámara y observa cómo cambia la predicción. ¿Qué pose es la que cuenta con un mayor grado de confianza?
fr: Dans l’aperçu, présente différentes positions de la main à l’appareil photo et remarque comment la prédiction change. Pour quelle position le modèle est-il le plus confiant ?
it: Nell’anteprima, mostra un paio di pose della mano alla fotocamera e osserva in che modo cambia la previsione. Per quale posa ottieni un’accuratezza maggiore?
ja: プレビューで、いくつか異なる手の形をカメラに見せて、予測がどのように変わるか見てみましょう。最も信頼度が高いのはどの形でしょうか?
ko: 미리보기에서 카메라를 향해 몇 가지 다른 손 포즈를 취하고 예측이 어떻게 변화하는지 살펴봅니다. 어떤 포즈를 취할 때 가장 잘 예측하나요?
nl: Maak in de voorvertoning een paar verschillende handgebaren voor de camera. Zie je hoe de voorspelling verandert? Bij welk gebaar is de betrouwbaarheid het hoogst?
no: Hold opp et par forskjellige tegn foran kameraet i forhåndsvisningen og legg merke til hvordan prediksjonen endres. Hvilket tegn er den mest riktig for?
pt: Na pré‑visualização, mostre alguns sinais com a mão para a câmera e repare como a previsão muda. Em qual sinal o modelo tem mais confiança?
sv: Håll upp ett par olika handgester för kameran i förhandsvisningen och lägg märke till hur förutsägelsen ändras. För vilken gest är konfidensen högst?
th: ในการแสดงตัวอย่าง ให้ทำท่าทางมือที่แตกต่างกันสองท่าให้กล้องเห็น แล้วสังเกตว่าการคาดคะเนเปลี่ยนแปลงไปหรือไม่ ท่าทางใดที่ระบบมั่นใจมากที่สุด
tr: Önizlemede, kameraya doğru birkaç farklı el pozu tut ve tahminin nasıl değiştiğine dikkat et. En güvenilir poz hangisi?
vi: Trong bản xem trước, hãy giữ một vài tư thế bàn tay khác nhau trước camera và lưu ý cách dự đoán thay đổi. Tư thế nào có độ tin cậy cao nhất?
zh_cn: 在预览中，向摄像头展示几个不同的手势，然后留意预测是如何变化的。哪个姿势的置信度最高呢？
zh_tw: 在預覽中，對著相機舉起幾個不同的手部姿勢，並注意預測的變化。它對哪個手勢最有信心？

source: Try answering the following questions:
de: Versuche, die folgenden Fragen zu beantworten:
es: Intenta responder a las preguntas siguientes:
es_419: Intenta contestar las preguntas siguientes:
fr: Essaie de répondre aux questions suivantes :
it: Prova a rispondere alla seguenti domande:
ja: 以下の質問に答えてみましょう:
ko: 다음 질문에 답해 보세요.
nl: Probeer de volgende vragen te beantwoorden:
no: Prøv å svare på disse spørsmålene:
pt: Tente responder às seguintes perguntas:
sv: Försök att besvara följande frågor:
th: ลองตอบคำถามต่อไปนี้:
tr: Aşağıdaki soruları yanıtlamayı dene:
vi: Thử trả lời các câu hỏi sau đây:
zh_cn: 尝试回答下面的问题：
zh_tw: 嘗試回答下列問題：

source: How does the bar chart change when you show the camera a Paper pose (✋) and rotate your hand 90 degrees?
de: Wie ändert sich das Balkendiagramm, wenn du die Papier-Geste (✋) in die Kamera hältst und deine Hand um 90 Grad drehst?
es: ¿Cómo cambia la gráfica de la barra cuando haces con la mano ante la cámara la postura de Papel (✋) y la giras 90 grados?
es_419: ¿Cómo cambia la gráfica de barras cuando haces una pose de papel (✋) en la cámara y luego giras la mano 90 grados?
fr: Comment le graphique à barres change-t-il lorsque tu montres à l’appareil photo une position de papier (✋), puis que tu fais pivoter ta main de 90 degrés ?
it: Come cambia il grafico a barre quando mostri alla fotocamera una posa Carta (✋) e ruoti la mano di 90 gradi?
ja: カメラにパーの形（✋）を見せてから手を90度回転させると棒グラフはどう変わるでしょうか?
ko: 카메라에 보 포즈(✋)를 보여주고 손을 90도 회전하면 막대 차트가 어떻게 변하나요?
nl: Op welke manier verandert het staafdiagram wanneer je de camera een papiergebaar (✋) laat zien en je je hand 90 graden draait?
no: Hvordan endres stolpediagrammet når du viser tegnet for papir (✋) til kameraet og vrir hånden 90 grader?
pt: Como o gráfico de barras muda quando você mostra à câmera um sinal de Papel (✋) e gira a mão 90 graus?
sv: Hur förändras stapeldiagrammet när du visar en pappersgest (✋) för kameran och vrider handen 90 grader?
th: แผนภูมิแท่งจะเปลี่ยนแปลงอย่างไรเมื่อคุณแสดงให้กล้องเห็นท่าทางกระดาษ (✋) แล้วหมุนมือของคุณ 90 องศา
tr: Kameraya bir Kâğıt pozu (✋) gösterip elini 90 derece döndürdüğünde çubuk grafiği nasıl değişiyor?
vi: Biểu đồ thanh thay đổi như thế nào khi bạn thể hiện tư thế Bao (✋) trước camera và xoay bàn tay của mình 90 độ?
zh_cn: 向摄像头展示布的手势 (✋) 并转动你的手 90 度时，条形图会发生什么变化？
zh_tw: 當你向相機展示「布」的手勢（✋）並將你的手旋轉 90 度時，長條圖會如何變化？

source: What about when you move your hand closer to the camera or further away?
de: Was passiert, wenn du deine Hand in Richtung Kamera oder von ihr weg bewegst?
es: ¿Y qué pasa cuando acercas la mano a la cámara o cuando la alejas?
es_419: ¿Y qué pasa cuando acercas o alejas la mano de la cámara?
fr: Et si tu rapproche ou éloigne la main de l’appareil photo ?
it: Cosa accade quando avvicini la mano alla fotocamera o la allontani?
ja: 手をカメラに近づけたり遠ざけたりするとどうなるでしょうか?
ko: 손을 카메라 가까이 이동하거나 더 멀리 떨어지게 하면 어떤가요?
nl: Wat gebeurt er wanneer je je hand dichter bij de camera houdt over verder bij de camera vandaan?
no: Hva skjer når du flytter hånden nærmere eller lenger bort fra kameraet?
pt: E quando você aproxima ou afasta a mão da câmera?
sv: Vad händer när du flyttar handen närmare eller längre bort från kameran?
th: จะเกิดอะไรขึ้นเมื่อคุณเคลื่อนมือของคุณเข้าใกล้กล้องมากขึ้นหรือห่างออกไปมากขึ้น
tr: Elini kameraya yaklaştırdığında veya uzaklaştırdığında ne oluyor?
vi: Vậy khi bạn di chuyển bàn tay của mình đến gần hơn hoặc xa hơn so với camera thì sao?
zh_cn: 当手移近或远离摄像头时又会发生什么变化？
zh_tw: 當你將手靠近或遠離相機時會怎樣？
